a               33
able            2
about           17
absolute        3
actual          4
adapt           3
addition        2
address         2
aft             31
again           7
ago             3
agree           2
all             36
almost          7
already         4
also            5
although        2
alway           2
am              7
amazon          9
amount          2
an              24
and             175
anoth           7
any             12
anymore         2
anyone          4
anything        10
apart           2
apple           6
are             25
arriv           4
arrive          3
ask             4
at              27
average         2
aware           2
away            7
back            16
bad             16
bar             2
basical         2
batterie        3
battery         12
be              34
because         8
been            6
before          6
believe         2
bett            14
between         2
beware          2
biofeedback     2
bit             4
black           3
body            4
boston          2
both            4
bought          24
box             4
brand           2
break           5
broke           8
broken          4
bud             3
burn            2
but             47
button          6
buy             48
by              11
ca              5
calendar        2
came            4
camera          3
can             18
canot           3
card            9
cd              2
chang           3
charg           3
charge          7
cheap           13
check           2
child           3
christma        4
clean           2
clear           2
come            3
company         3
compatible      2
complete        4
complicat       2
comput          9
condition       2
conect          4
consider        2
contact         3
control         3
correct         2
cost            3
could           17
couple          3
crash           3
crashe          3
creative        4
custom          6
cuz             2
daught          2
day             14
dead            4
defective       4
definite        2
deliv           2
dent            3
deserve         2
design          3
device          10
di              10
did             26
didnt           3
different       3
difficult       3
disappoint      4
disc            4
display         4
do              56
doe             22
doesnt          6
dont            9
down            5
download        7
drink           4
drive           4
dur             3
dvd             7
each            2
ear             3
easi            2
easy            3
effect          2
effort          2
elliptical      2
else            2
email           3
end             2
energy          2
enough          5
ev              16
even            17
eventual        2
every           10
everything      2
everywhere      2
exercise        6
expect          4
expensive       5
experienc       2
experience      4
fail            5
fall            3
far             4
fast            2
fat             2
fault           2
feature         3
feel            2
few             4
figure          3
file            5
final           3
find            3
fine            6
first           14
flash           4
flashlight      2
flaw            2
fm              6
fool            2
for             100
force           3
forev           2
found           7
four            2
fragile         2
free            3
freeze          3
friend          2
from            35
froze           5
frustrat        2
full            2
functionality   2
game            2
gave            2
gb              6
get             31
gett            5
gift            3
give            9
go              13
goe             2
good            16
got             17
gotten          2
great           8
guess           2
guitar          5
guy             2
ha              12
had             21
half            3
hand            3
hang            2
happen          2
happy           6
hard            13
hardware        2
hate            2
have            46
he              2
headphone       7
heard           2
heavy           2
here            2
hi              2
high            2
hold            4
horrible        5
hotel           6
hour            9
how             10
howev           3
hr              2
i               103
idea            3
if              22
im              5
impossible      2
in              59
inaccurate      4
includ          2
inferior        4
install         2
instead         3
instruction     4
interface       2
internet        2
into            5
invest          2
ipod            24
it              290
item            30
itself          2
ive             17
jump            2
junk            12
just            27
kazoo           2
kept            2
kid             4
know            11
l               2
lack            2
last            7
lat             2
lcd             4
less            2
let             3
life            4
light           6
like            16
list            3
little          5
load            6
lock            2
long            4
look            9
loose           3
lost            3
lot             6
love            2
machine         3
made            7
make            9
manual          2
manufactur      3
many            3
matt            3
max             2
may             3
maybe           4
me              14
mean            2
measurement     2
media           2
memory          5
met             2
microsoft       3
might           3
mine            5
minute          7
miss            2
mode            2
model           5
money           24
monitor         2
monst           2
month           27
more            29
mouse           2
mp              22
much            8
multiple        4
music           9
my              34
nano            2
ne              2
need            2
neith           2
nev             18
new             9
next            2
nice            5
nitru           2
no              25
nor             4
not             180
notebook        2
nothing         8
now             14
octob           2
of              97
off             7
often           2
ok              2
old             5
on              68
once            4
one             39
onto            3
open            2
operate         2
or              11
ord             6
order           7
oregon          3
oth             9
out             27
ov              6
overall         2
overpric        2
own             3
page            3
paid            2
pain            2
pair            2
palm            2
pap             2
pay             9
pedomet         2
pedometer       2
people          4
perfect         2
perhap          2
philip          2
phone           2
photo           2
pick            4
piece           6
place           6
plastic         2
play            46
player          2
poor            3
portable        2
pound           2
pow             3
present         3
pretty          5
pric            3
price           11
problem         12
product         46
promis          4
proper          2
proprietary     2
provide         2
purchas         9
purchase        3
put             2
quality         14
quick           3
quite           3
radio           5
random          2
range           2
rate            2
rca             2
read            6
real            9
reason          3
reasonable      2
receipt         2
receiv          6
reciev          2
recogniz        2
recomend        2
recommend       10
record          3
refund          7
reliable        2
rememb          2
rep             2
repair          3
replac          4
reset           3
respond         4
rest            2
restart         2
return          23
review          7
right           4
rio             2
room            2
rope            2
run             2
said            3
same            8
samsung         2
sandisk         5
save            4
saw             2
say             9
scientific      2
scratch         3
scratche        4
screen          11
screw           5
sd              2
second          7
seem            7
seen            2
sell            4
send            6
sense           2
sent            6
service         10
set             2
several         6
shipp           9
shock           3
short           5
should          8
show            2
shuffle         2
sign            2
since           3
slow            3
small           5
so              24
software        8
sold            3
some            9
someone         3
something       2
sometime        2
son             2
song            9
sony            4
sound           4
spec            3
spend           6
spent           4
spin            2
star            3
start           7
stat            2
stay            15
stiff           2
still           10
stink           2
stinky          2
stop            4
stopp           4
string          3
stuff           2
stupid          2
sturdy          2
such            5
suck            5
suggest         3
support         3
sure            2
switch          2
system          2
tak             2
take            7
talk            2
tell            3
terrible        7
textbook        2
th              18
than            11
thank           2
that            41
the             241
their           3
them            12
then            14
there           16
therefore       2
these           10
they            21
thi             163
think           6
third           2
tho             2
those           4
though          4
thought         2
three           7
thru            2
tighten         4
time            31
to              153
toilet          4
too             13
took            3
toothbrush      2
total           3
touch           2
tourist         2
toy             4
transf          2
transfer        2
trash           2
tri             9
try             3
tun             4
turn            10
twice           3
two             13
unable          2
und             2
unfortunate     2
unit            5
unless          2
until           8
up              21
upgrade         2
upload          2
us              14
usb             6
use             24
useless         3
vendor          2
very            33
video           3
wa              63
want            7
wasnt           3
waste           16
watch           3
way             9
we              7
wear            2
web             2
website         2
week            13
weight          3
well            7
went            3
were            10
what            20
when            16
which           5
while           4
who             6
whole           3
why             3
will            17
window          5
wipe            2
wish            4
with            45
within          8
wo              9
work            55
worse           4
worst           10
worth           10
worthless       2
would           37
wrong           2
xp              4
yahoo           3
year            12
you             60
your            17
zen             3
