</stop>                         540
aaa                             3
able                            5
absolut                         2
absolute                        2
accurate                        5
actual                          4
adapt                           6
add                             4
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      2
afraid                          2
again                           5
ago                             6
agree                           3
airport                         2
album                           4
allow                           2
almost                          10
alone                           2
along                           3
alot                            2
already                         5
although                        3
alway                           7
amaz                            7
amazo                           2
amazon                          10
amazone                         2
amount                          3
amp                             2
anoth                           11
answ                            2
anymore                         2
anyone                          9
anything                        10
anywhere                        2
apart                           2
apple                           7
archo                           2
around                          7
arriv                           5
arrive                          3
ask                             5
attention                       2
audio                           2
available                       2
average                         2
avoid                           3
aware                           2
away                            5
awsome                          2
baby                            3
backpack                        2
bad                             17
ball                            2
band                            5
bar                             8
basi                            2
basical                         2
bass                            2
batterie                        7
battery                         13
be                              6
beautiful                       3
become                          2
before                          11
begin                           2
bell                            2
best                            14
bett                            23
between                         2
beware                          2
big                             6
bike                            7
biofeedback                     2
birthday                        2
bit                             3
black                           5
body                            3
book                            2
boost                           2
bose                            2
boston                          2
both                            8
bought                          35
box                             4
brand                           5
break                           6
broke                           9
broken                          4
brought                         2
buck                            2
bud                             3
built                           3
business                        4
button                          7
buy                             38
bye                             2
cable                           2
calendar                        2
camera                          10
car                             4
card                            13
care                            2
carry                           4
case                            4
cash                            3
caus                            2
cd                              3
cent                            2
certain                         3
chang                           3
charg                           3
charge                          9
cheap                           14
check                           3
child                           3
children                        2
christma                        7
city                            2
class                           2
clean                           7
clear                           7
clip                            5
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     5
common                          3
compact                         6
company                         4
compatible                      3
complaint                       4
complete                        7
complicat                       2
comput                          11
condition                       4
conect                          2
conector                        2
consider                        3
constant                        2
contact                         4
control                         6
convenient                      3
cool                            7
copy                            2
cord                            5
correct                         3
cost                            7
count                           2
couple                          4
cov                             2
cover                           2
crash                           5
crashe                          3
creative                        3
cute                            4
cuz                             2
cymbal                          3
dad                             4
dai                             2
damag                           2
damage                          2
data                            2
daught                          7
daughter                        2
day                             11
dead                            3
deal                            7
defective                       4
definate                        3
delhi                           2
deliv                           2
deliver                         3
delivery                        2
dent                            3
describ                         3
describe                        2
description                     2
deserve                         2
design                          5
develop                         2
device                          9
di                              8
diap                            2
didnt                           3
die                             2
different                       8
difficult                       2
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      5
disc                            2
disk                            2
display                         4
do                              4
doesnt                          6
dog                             2
dollar                          2
dont                            4
down                            4
download                        6
drain                           3
drink                           5
driv                            2
drive                           11
dropp                           2
drum                            4
dur                             2
durable                         2
dvd                             10
easi                            5
easy                            37
eat                             2
effect                          2
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            7
email                           4
end                             3
energy                          2
enjoy                           7
enough                          7
entire                          2
equipment                       2
especial                        2
etc                             2
ev                              20
eventual                        2
everthing                       2
every                           7
everything                      10
everywhere                      4
exact                           2
excellent                       9
except                          3
exercis                         2
exercise                        10
expect                          9
expensive                       6
experienc                       2
experience                      5
extra                           3
extreme                         2
face                            2
fail                            6
fami                            2
fantastic                       4
far                             10
fast                            10
fat                             3
fault                           3
favorite                        4
feature                         10
feedback                        2
feel                            3
few                             5
figur                           2
figure                          3
file                            7
fill                            2
final                           2
find                            6
fine                            10
fit                             6
fitness                         2
five                            2
flash                           2
flashlight                      2
flat                            2
flavor                          4
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           4
forget                          2
form                            3
format                          2
found                           11
four                            2
fragile                         2
free                            3
freeze                          3
friend                          10
froze                           5
full                            4
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              10
gen                             4
general                         3
gett                            5
gift                            9
girl                            2
glad                            5
go                              12
good                            49
gotten                          3
great                           63
green                           2
guess                           4
guest                           2
guitar                          5
guy                             2
gym                             4
half                            3
hand                            4
handl                           2
handle                          3
handy                           5
hang                            2
happen                          3
happy                           14
hard                            12
hardware                        2
hate                            2
hav                             4
have                            2
headphone                       10
healthy                         2
hear                            3
heard                           6
heavy                           3
help                            3
helpful                         2
here                            4
high                            5
hold                            10
home                            5
hooah                           3
hope                            2
horrible                        5
horse                           3
hotel                           11
hour                            10
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         4
hype                            2
id                              3
idea                            3
ill                             2
im                              10
impossible                      2
inaccurate                      4
includ                          3
inexpensive                     2
inferior                        3
info                            2
information                     2
inside                          3
install                         3
instead                         3
instruction                     5
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            31
iriv                            2
isnt                            2
issue                           2
item                            33
itself                          2
ive                             12
junk                            6
kazoo                           2
keep                            7
kept                            2
key                             2
kid                             5
kind                            3
know                            13
l                               2
lack                            2
lady                            2
laptop                          2
large                           5
last                            14
lat                             4
late                            3
lcd                             2
learn                           3
least                           3
less                            6
let                             3
level                           2
lexar                           2
life                            11
light                           9
lightweight                     3
like                            38
line                            4
list                            3
listen                          6
little                          17
load                            2
location                        3
lock                            2
long                            8
look                            7
loose                           2
lose                            2
lost                            2
lot                             12
loud                            2
lov                             5
love                            29
low                             4
m                               2
machine                         7
made                            14
major                           2
mak                             2
make                            14
man                             2
manual                          3
manufactur                      2
many                            6
market                          2
mat                             2
matt                            5
max                             2
may                             3
maybe                           4
mb                              4
mean                            2
measurement                     2
media                           4
meditation                      2
memory                          9
mention                         2
menu                            2
mess                            2
met                             3
mic                             4
microphone                      4
microsoft                       2
might                           4
military                        2
million                         2
minute                          8
miss                            2
mode                            2
model                           7
mom                             2
money                           15
monitor                         5
monst                           2
month                           21
more                            35
mouse                           2
move                            2
movie                           2
mp                              9
much                            15
multiple                        2
music                           29
musical                         2
must                            3
myself                          2
nano                            8
navigation                      2
ne                              8
near                            2
neck                            2
need                            11
negative                        2
nev                             14
new                             10
next                            4
nice                            18
nifty                           2
night                           3
no                              31
noise                           2
nokia                           3
nor                             4
not                             130
note                            2
notebook                        2
nothing                         7
notice                          2
o                               2
octob                           2
off                             9
offer                           2
often                           3
oh                              2
ok                              4
old                             10
omron                           2
once                            6
one                             4
onto                            3
open                            4
operate                         2
opinion                         2
option                          6
ord                             8
order                           6
other                           2
otherwise                       2
over                            3
overall                         3
overpric                        2
own                             9
p                               3
package                         6
page                            4
paid                            3
pain                            2
pair                            2
palm                            2
pap                             3
pay                             9
pedomet                         3
pedometer                       2
pen                             2
people                          7
perfect                         12
perform                         3
performance                     3
perhap                          2
personal                        2
philip                          2
phone                           9
photo                           5
pic                             3
pick                            5
picture                         7
piece                           4
pillow                          4
pink                            2
place                           7
plastic                         2
play                            52
pleas                           8
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        5
pound                           3
pow                             2
present                         7
pretty                          6
previou                         2
pric                            3
price                           28
print                           3
probab                          3
problem                         17
produc                          2
product                         58
promis                          5
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         16
purchase                        5
purse                           2
put                             3
quality                         20
quick                           7
quite                           6
radio                           10
random                          2
range                           2
rate                            2
rath                            2
read                            8
real                            22
reason                          3
receipt                         2
receiv                          11
recharge                        2
reciev                          6
recogniz                        2
recommend                       14
record                          5
refuse                          2
relative                        2
reliable                        3
rememb                          2
repair                          4
replac                          2
replace                         2
requir                          4
reset                           3
respond                         6
response                        2
rest                            2
restart                         2
result                          4
return                          11
review                          7
right                           12
rio                             5
rock                            2
roll                            2
room                            6
rope                            2
run                             9
safe                            3
same                            7
samsung                         3
sandisk                         7
sansa                           3
satisfi                         3
sav                             2
save                            2
say                             3
scratch                         3
scratche                        3
screen                          12
screw                           2
sd                              3
second                          4
secure                          2
seem                            13
select                          2
sell                            4
seller                          2
send                            6
sense                           2
sent                            8
service                         18
set                             9
sett                            2
several                         5
shape                           6
shave                           2
shipp                           12
shock                           2
short                           5
show                            9
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          4
since                           6
site                            2
size                            16
slight                          2
slim                            2
slow                            3
small                           20
snack                           3
snug                            2
so                              2
soft                            2
software                        11
sold                            3
solid                           3
someone                         5
something                       9
sometime                        3
son                             5
song                            16
sony                            6
soon                            2
soooo                           2
sound                           21
south                           2
space                           4
speak                           2
spec                            3
special                         3
spend                           6
spent                           6
spin                            3
sport                           2
st                              2
staff                           3
stand                           3
star                            6
start                           11
stat                            2
stay                            12
stereo                          2
stick                           2
stiff                           3
still                           10
stinky                          2
stop                            3
stopp                           3
stor                            2
storage                         4
store                           6
strap                           2
strong                          2
stuff                           4
stupid                          2
sturdy                          4
such                            8
suck                            5
sudden                          2
sugar                           2
summ                            2
support                         4
suppos                          2
suprising                       2
sure                            6
switch                          2
system                          5
tak                             2
take                            10
talk                            3
tape                            2
target                          2
tast                            3
taste                           5
tell                            4
tempo                           2
terrible                        5
textbook                        2
th                              25
thank                           6
that                            2
there                           3
therefore                       2
theyre                          3
thin                            3
thing                           6
third                           3
tho                             2
though                          4
three                           6
through                         3
thru                            2
thumb                           2
tight                           2
tighten                         4
time                            34
tiny                            5
tip                             2
title                           2
tivo                            2
today                           4
toilet                          2
ton                             3
too                             12
tool                            2
toothbrush                      3
top                             3
toss                            2
total                           4
touch                           2
tough                           2
tourist                         2
toy                             4
track                           2
transf                          3
transfer                        2
trash                           2
travel                          4
tri                             10
try                             7
tun                             5
turn                            7
tv                              4
twice                           4
type                            4
unable                          2
und                             2
unfortunate                     2
unit                            6
unless                          3
until                           9
update                          2
upgrad                          2
upgrade                         3
upload                          2
upset                           2
us                              27
usb                             9
use                             5
useful                          2
useless                         3
utility                         2
value                           2
vendor                          2
version                         3
very                            39
video                           12
vista                           2
volume                          2
wait                            2
walk                            3
walmart                         2
want                            8
wasnt                           3
waste                           3
watch                           3
wear                            4
web                             2
website                         4
week                            14
weight                          5
what                            2
whatsoev                        2
where                           2
while                           12
whole                           4
why                             6
wife                            4
window                          5
wipe                            2
wish                            6
within                          2
without                         6
wonderful                       5
word                            2
work                            16
world                           2
worse                           4
worst                           7
worth                           13
worthless                       2
wrong                           6
xlr                             2
xp                              4
ye                              3
year                            9
yet                             4
you                             3
young                           3
youre                           4
yr                              2
zen                             6
zune                            2
