aaa                             2
able                            3
accurate                        5
adapt                           4
add                             4
adult                           2
advertis                        3
affordable                      2
ago                             2
airport                         2
album                           4
allow                           2
almost                          4
alway                           4
amaz                            7
amazon                          5
anoth                           3
anyone                          6
anywhere                        2
apple                           2
around                          4
arriv                           2
attention                       2
awsome                          2
baby                            3
bad                             5
ball                            2
band                            4
bar                             6
basi                            2
bass                            2
batterie                        5
battery                         4
be                              3
beautiful                       3
before                          6
bell                            2
best                            14
bett                            12
big                             4
bike                            7
birthday                        2
book                            2
bose                            2
both                            5
bought                          18
brand                           3
built                           2
business                        4
buy                             17
bye                             2
cable                           3
camera                          7
car                             3
card                            4
care                            2
carry                           3
case                            3
cd                              2
certain                         3
cheap                           5
christma                        4
class                           2
clean                           5
clear                           5
clip                            5
close                           2
combination                     2
comfortable                     4
common                          2
compact                         6
company                         2
complaint                       4
complete                        2
comput                          2
condition                       3
control                         3
convenient                      3
cool                            7
cord                            5
cost                            4
cover                           2
creative                        2
cute                            2
cymbal                          3
dad                             3
damage                          2
daught                          5
daughter                        2
day                             2
deal                            6
definate                        3
definite                        2
delhi                           2
delivery                        2
describ                         3
describe                        2
description                     2
design                          2
device                          4
diap                            2
different                       5
digg                            2
digital                         2
direct                          2
dog                             3
dont                            2
download                        2
drive                           5
drum                            4
durable                         2
dvd                             4
easi                            3
easy                            33
eat                             2
effective                       2
elegant                         2
else                            4
energy                          2
enjoy                           6
enough                          3
equipment                       3
especial                        2
ev                              8
every                           4
everything                      8
everywhere                      3
exact                           2
excellent                       9
except                          2
exercise                        5
expect                          6
extra                           2
extreme                         2
face                            2
fantastic                       4
far                             7
fast                            9
favorite                        3
feature                         7
feel                            2
fell                            2
figur                           2
file                            2
fill                            2
find                            3
fine                            5
fit                             3
fitness                         2
flash                           2
flavor                          4
floor                           3
food                            2
forev                           2
forget                          2
form                            2
found                           4
friend                          7
full                            2
fun                             2
gadget                          2
gb                              7
gen                             4
general                         2
gift                            5
girl                            2
glad                            5
go                              5
good                            42
great                           60
guess                           2
guitar                          2
gym                             4
hand                            2
handl                           2
handle                          3
handy                           5
happen                          2
happy                           11
hard                            4
hav                             4
have                            2
headphone                       4
healthy                         2
hear                            2
heard                           4
help                            3
here                            2
high                            3
hold                            5
home                            4
hooah                           3
hope                            3
horse                           3
hotel                           5
house                           2
huge                            2
hungry                          2
hurt                            2
husband                         3
id                              2
im                              4
includ                          2
inexpensive                     2
inside                          2
instruction                     3
instrument                      2
ipod                            20
item                            12
itself                          2
ive                             4
keep                            6
key                             2
kid                             2
kind                            2
know                            4
large                           3
last                            9
learn                           2
least                           2
less                            4
life                            6
light                           5
lightweight                     3
like                            24
line                            3
listen                          5
little                          12
location                        2
long                            7
look                            5
lose                            2
lot                             7
loud                            2
lov                             4
love                            28
low                             3
machine                         4
made                            5
make                            8
man                             2
many                            2
mat                             2
media                           2
memory                          5
met                             2
mic                             4
microphone                      4
might                           2
military                        2
million                         2
model                           2
mom                             2
money                           3
monitor                         3
month                           6
more                            18
move                            2
movie                           2
mp                              5
much                            11
music                           17
musical                         2
must                            3
nano                            8
ne                              6
near                            2
need                            8
negative                        2
nev                             5
new                             5
nice                            15
nifty                           2
night                           2
no                              16
noise                           2
nokia                           3
not                             47
note                            2
oh                              2
ok                              2
old                             6
once                            3
one                             4
open                            4
opinion                         2
option                          5
order                           2
other                           2
over                            2
own                             6
p                               2
package                         5
pay                             2
pedomet                         3
pen                             2
people                          3
perfect                         10
perform                         2
performance                     3
phone                           8
photo                           3
pic                             2
pick                            2
picture                         8
piece                           3
pillow                          3
pink                            2
place                           2
play                            28
pleas                           8
plenty                          2
pocket                          2
pod                             2
portable                        3
present                         4
pretty                          3
price                           23
print                           3
probab                          3
problem                         7
produc                          2
product                         25
purchas                         7
purchase                        3
purse                           2
put                             2
quality                         11
quick                           4
quite                           3
radio                           9
rate                            2
read                            6
real                            13
reason                          2
receiv                          5
reciev                          4
recommend                       8
record                          3
reliable                        2
requir                          2
result                          3
review                          2
right                           8
rio                             3
rock                            2
roll                            2
room                            5
run                             7
safe                            3
same                            3
sansa                           2
satisfi                         3
say                             2
screen                          5
secure                          2
seem                            8
sent                            2
service                         11
set                             5
several                         2
shape                           6
shave                           2
shipp                           5
show                            8
simple                          4
since                           3
size                            17
sleek                           2
slight                          2
slim                            2
small                           15
snack                           3
snug                            2
soft                            2
software                        4
solid                           3
someone                         4
something                       8
son                             2
song                            8
soooo                           2
sound                           17
south                           2
space                           3
speak                           2
special                         3
spent                           2
staff                           2
stand                           3
star                            3
start                           6
stay                            4
stereo                          2
still                           5
stor                            2
storage                         4
store                           4
strap                           2
strong                          2
stuff                           2
sturdy                          2
such                            3
summ                            2
suppos                          2
sure                            4
system                          5
take                            5
talk                            2
tast                            3
taste                           4
tempo                           2
th                              12
thank                           6
theyre                          2
thin                            2
thing                           6
though                          2
through                         3
tight                           2
time                            13
tiny                            4
ton                             2
too                             5
tool                            2
top                             2
total                           2
tough                           2
track                           2
transf                          4
travel                          4
tri                             3
try                             3
tun                             3
tv                              3
type                            3
unit                            3
until                           2
upgrad                          2
us                              13
usb                             4
use                             4
useful                          2
utility                         2
value                           2
version                         2
very                            20
video                           8
walk                            2
want                            8
watch                           2
wear                            2
week                            2
weight                          2
while                           8
why                             2
wife                            3
window                          2
wish                            2
without                         5
wonderful                       5
work                            9
worth                           2
wrong                           4
xlr                             2
year                            2
yet                             3
you                             2
young                           2
youre                           2
yr                              2
zen                             3
