a               42
aaa             2
able            2
about           13
accurate        7
adapt           4
add             3
adult           2
advertis        3
aft             5
again           3
ago             2
airport         2
album           3
all             28
allow           2
almost          5
also            10
alway           3
am              15
amaz            8
amazon          5
an              22
and             243
anoth           4
any             13
anyone          6
anywhere        2
apple           4
are             27
arm             2
around          6
arriv           2
at              26
attention       2
average         2
awesome         4
baby            2
back            3
bad             4
ball            2
band            5
bar             5
batterie        6
battery         15
be              18
beautiful       3
because         4
been            6
before          6
bell            2
best            14
bett            15
big             4
bike            7
birthday        2
blood           5
book            4
bose            2
both            7
bought          22
brand           2
built           2
business        4
but             33
buy             23
by              7
ca              4
cable           3
came            6
camera          6
can             23
car             3
card            6
care            3
carry           6
case            2
cd              3
certain         3
cheap           5
christma        8
class           2
clean           7
clear           4
clip            5
close           2
color           3
combination     2
come            7
comfortable     4
common          2
compact         9
company         3
complaint       4
condition       7
control         3
convenient      2
cool            7
cord            5
cost            6
could           7
cover           2
creative        6
cute            2
cymbal          2
dad             2
damage          2
daught          9
daughter        2
day             5
deal            7
definate        3
definite        2
delhi           2
delivery        3
describ         2
describe        2
description     2
design          3
device          5
diap            2
did             7
different       5
digg            2
digital         2
do              21
doe             17
dog             3
dominat         2
dont            2
download        3
drive           5
drum            3
durable         2
dvd             3
earbud          2
easi            4
easy            50
eat             2
elegant         2
else            4
energy          6
enjoy           7
enough          6
equipment       2
ev              8
even            8
every           4
everything      8
everywhere      3
exact           2
excellent       15
except          2
exercise        9
expect          8
extra           5
extreme         2
face            2
fami            3
fantastic       3
far             8
fast            11
favorite        5
feature         10
feel            8
fell            2
figur           2
file            3
find            2
fine            6
first           6
fit             4
fitness         2
fix             2
flash           2
flavor          4
floor           2
fm              4
food            2
for             123
forev           4
forget          2
form            2
found           4
free            5
friend          9
from            20
full            2
fun             2
future          2
gadget          2
garage          2
gave            2
gb              7
gen             4
general         2
get             16
gift            9
girl            2
give            3
glad            5
go              12
good            62
got             12
great           125
guess           2
gym             4
h               5
ha              25
had             24
hand            3
handle          3
handy           4
happen          2
happy           12
hard            5
hav             3
have            51
he              20
headphone       3
healthy         2
hear            2
heard           4
help            2
here            3
hi              6
high            11
hold            9
home            3
hooah           2
hope            3
horse           3
hotel           5
house           2
how             4
huge            2
hungry          2
husband         5
i               179
id              2
if              17
im              8
in              47
includ          2
inexpensive     2
inside          2
instruction     3
instrument      2
ipod            42
it              280
item            15
itself          2
ive             7
just            15
keep            7
key             2
kid             7
know            4
large           4
last            9
learn           2
least           2
less            4
life            10
light           5
lightweight     2
like            33
line            3
listen          9
little          14
location        2
long            7
look            15
lose            2
lot             18
loud            2
lov             5
love            55
low             4
machine         4
made            4
make            11
man             2
many            5
market          3
mat             2
me              16
memory          5
met             2
mic             7
microphone      8
military        2
mine            2
minute          2
mom             2
money           7
monitor         5
month           4
more            18
most            4
move            2
movie           2
mp              27
much            24
music           22
musical         2
must            3
my              103
nano            13
ne              8
near            3
need            8
negative        2
nev             6
new             6
nice            20
nifty           2
night           2
no              19
noise           2
nokia           3
not             64
note            2
now             7
of              67
offer           2
oh              2
ok              2
old             7
on              39
once            4
one             32
open            4
opinion         2
option          4
or              18
order           4
oth             8
other           2
our             6
out             17
ov              5
over            2
own             9
p               2
package         8
pedomet         3
pen             2
perfect         14
perform         2
performance     3
phone           7
photo           2
pic             2
pick            2
picture         6
piece           2
pillow          3
pink            2
place           4
play            39
pleas           9
plu             2
pocket          2
pod             2
portable        5
present         4
pressure        4
pretty          5
price           31
print           3
probab          5
problem         11
produc          2
product         43
purchas         9
purchase        4
purse           2
put             3
quality         21
quick           4
quite           2
radio           10
rate            2
read            5
real            26
reason          2
receiv          5
reciev          5
recommend       14
record          4
reliable        2
requir          2
result          3
review          3
right           8
rio             3
rock            2
roll            2
room            6
run             9
safe            3
said            2
same            2
satisfi         4
say             11
screen          9
secure          2
see             3
seem            11
sell            2
sent            2
service         14
set             4
shape           5
shave           2
she             16
shipp           7
should          3
show            8
simple          4
since           3
size            17
sleek           2
slight          2
slim            2
small           19
snack           3
snug            2
so              34
soft            2
software        3
solid           4
some            3
someone         4
something       7
son             6
song            11
soooo           2
sound           28
south           2
space           6
special         2
spent           2
staff           2
stand           5
star            2
start           6
stay            4
stereo          2
still           6
storage         3
store           6
strong          2
stuff           2
sturdy          2
such            4
summ            2
suppos          2
sure            4
system          3
take            6
talk            2
tast            2
taste           4
tempo           2
th              9
than            20
thank           8
that            42
the             257
their           4
them            16
there           10
these           14
they            21
theyre          2
thi             136
thin            2
thing           6
think           9
those           2
though          3
thought         2
through         5
tight           2
time            16
tiny            4
to              172
ton             2
too             8
tool            2
top             2
total           2
tough           2
track           2
transf          5
travel          3
try             3
tun             4
tv              4
two             8
understand      3
unit            5
until           2
up              14
upgrad          2
us              16
usb             4
use             57
useful          3
utility         2
value           7
version         2
very            69
video           8
wa              54
want            10
watch           2
way             6
we              13
wear            2
week            2
weight          4
well            18
went            2
were            5
what            18
when            17
which           11
while           7
whistle         2
who             8
why             2
wife            3
will            20
window          2
with            66
without         6
wonderful       6
work            45
worth           6
would           12
wrong           4
xlr             2
year            8
you             53
young           2
your            12
youre           2
yr              2
zen             5
