a               74
aaa             3
able            4
about           30
absolut         2
absolute        3
accurate        7
actual          4
adapt           7
add             3
addition        2
address         2
adult           2
advertis        3
afraid          2
aft             36
again           9
ago             7
agree           2
airport         2
album           3
all             62
allow           3
almost          12
alone           2
along           3
alot            2
already         4
also            14
although        3
alway           6
am              23
amaz            8
amazo           2
amazon          16
amazone         2
amount          3
an              43
and             416
anoth           12
answ            2
any             27
anymore         2
anyone          9
anything        10
anywhere        2
apart           2
apple           13
archo           2
are             52
arm             2
around          9
arriv           6
arrive          3
ask             6
at              51
attention       2
audio           2
available       2
average         3
avoid           3
aware           2
away            6
awesome         4
baby            2
back            19
backpack        3
bad             22
ball            2
band            6
bar             7
basical         2
batterie        9
battery         31
be              55
beautiful       3
because         14
become          2
been            14
before          12
begin           2
believe         4
bell            2
best            14
bett            31
between         2
beware          2
big             6
bike            7
biofeedback     2
birthday        3
bit             3
black           5
blood           5
body            4
book            4
bose            2
boston          2
both            10
bought          48
box             5
brake           2
brand           4
break           4
broke           7
broken          5
brought         2
buck            3
bud             3
built           3
burn            2
business        4
but             83
button          6
buy             72
by              18
ca              10
cable           4
calendar        2
came            8
camera          9
can             40
canot           3
car             4
card            15
care            3
carry           7
case            3
cash            3
caus            2
cd              5
certain         3
chang           4
charg           2
charge          7
cheap           18
check           3
children        2
christma        13
city            2
class           3
clean           9
clear           6
clip            5
close           2
club            3
college         2
color           4
combination     2
come            10
comfortable     5
common          3
compact         9
company         5
compatible      3
complaint       4
complete        6
complicat       2
comput          7
condition       8
conect          2
conector        2
consider        2
constant        2
contact         4
control         5
convenient      2
cool            7
copy            2
cord            5
correct         3
cost            9
could           23
count           2
couple          4
cov             2
cover           2
crash           5
crashe          3
creative        10
credit          2
custom          4
cute            4
cymbal          2
dad             3
damag           2
damage          3
data            2
daught          11
daughter        2
day             22
dead            5
deal            7
defective       3
definate        3
definite        4
delhi           2
deliv           2
deliver         3
delivery        3
dent            2
describ         3
describe        2
description     2
design          5
develop         2
device          15
di              10
diap            2
did             29
didnt           3
die             2
different       8
difficult       3
digg            2
digital         3
direction       2
dirty           2
disappoint      6
disc            4
disk            2
display         5
do              78
doe             43
doesnt          3
dog             5
dominat         2
dont            11
down            5
download        11
drain           3
drink           5
driv            2
drive           9
drum            3
dur             4
durable         3
dvd             10
each            2
ear             3
earbud          2
easi            6
easy            54
eat             3
effect          3
elegant         2
else            7
email           4
end             2
energy          8
enjoy           8
enough          10
entire          2
equipment       2
etc             2
ev              23
even            25
eventual        2
everthing       2
every           13
everything      11
everywhere      5
exact           2
excellent       15
except          3
exercis         2
exercise        13
expect          12
expensive       4
experienc       2
experience      5
extra           6
extreme         2
face            2
fail            6
fall            3
fami            4
fantastic       3
far             10
fast            13
fat             2
fault           2
favorite        6
feature         12
feedback        2
feel            11
fell            3
few             5
figur           2
figure          4
file            8
fill            2
final           3
find            5
fine            11
firmware        2
first           22
fit             7
fitness         2
fix             2
flash           5
flashlight      2
flat            2
flavor          4
flaw            2
floor           2
fm              10
food            2
fool            2
for             228
force           2
forev           6
forget          2
form            3
found           10
four            2
free            7
freeze          4
friend          12
from            57
froze           5
frustrat        2
full            4
fun             2
functionality   2
fundamental     2
future          2
gadget          2
game            2
garage          2
gave            5
gb              16
gen             4
general         3
get             45
gett            6
gift            12
girl            2
give            12
glad            5
go              26
goe             2
good            76
got             29
gotten          3
great           134
green           2
guess           4
guest           2
guitar          6
guy             2
gym             4
h               5
ha              39
had             46
half            4
hand            6
handle          3
handy           4
hang            2
happen          5
happy           18
hard            16
hardware        2
hate            2
hav             3
have            94
he              21
head            3
headphone       8
healthy         2
hear            3
heard           6
help            3
helpful         2
here            4
hi              8
high            13
hold            14
home            4
hooah           2
hope            4
horrible        3
horse           3
hotel           12
hour            9
house           2
how             15
howev           4
hr              2
huge            2
hungry          2
husband         6
hype            2
i               280
id              3
idea            3
if              41
ill             2
im              14
impossible      2
in              106
inaccurate      4
includ          4
inexpensive     2
inferior        4
info            2
information     2
inside          2
install         3
instead         4
instruction     6
instrument      2
interface       2
internet        2
into            6
invest          2
ipod            64
iriv            2
it              576
item            43
itself          3
ive             24
jump            4
junk            8
just            43
kazoo           2
keep            8
key             3
kid             11
kind            2
know            15
l               2
lack            2
lady            2
large           6
last            18
lat             3
late            3
lcd             4
learn           3
least           3
less            6
let             2
level           2
lexar           2
life            15
light           10
lightweight     2
like            51
line            4
list            3
listen          10
little          19
load            6
location        3
lock            3
long            10
look            26
loose           4
lose            2
lost            3
lot             24
loud            2
lov             6
love            57
low             5
machine         6
made            13
mak             2
make            20
man             2
manual          3
manufactur      3
many            9
market          4
mat             2
matt            3
max             2
may             2
maybe           4
mb              4
me              35
mean            3
media           3
meditation      2
memory          10
mention         2
menu            2
met             4
mic             7
microphone      8
microsoft       3
might           4
military        2
mine            7
minute          10
miss            3
mode            2
model           5
mom             2
money           30
monitor         7
monst           2
month           29
more            43
most            5
mouse           2
move            2
movie           3
mp              47
much            33
multiple        2
music           31
musical         2
must            3
my              141
myself          2
nano            16
navigation      2
ne              10
near            3
neck            2
need            11
negative        3
neith           2
nev             25
new             15
next            4
nice            24
nifty           2
night           3
nitru           2
no              41
noise           2
nokia           3
nor             2
not             248
note            2
notebook        2
nothing         9
now             23
o               2
octob           2
of              160
off             8
offer           3
often           3
oh              2
ok              4
old             12
omron           2
on              118
once            8
one             68
onto            3
open            6
operate         2
opinion         2
option          5
or              30
ord             8
order           10
oregon          4
oth             18
other           3
our             7
out             40
ov              12
over            2
overall         3
own             11
p               3
package         9
page            4
paid            3
pain            3
pair            2
palm            2
pap             2
pay             10
pedomet         5
pedometer       2
pen             2
people          4
perfect         16
perform         3
performance     3
perhap          2
personal        2
philip          2
phone           9
photo           4
pic             3
pick            5
picture         7
piece           8
pillow          4
pink            2
place           10
plastic         2
play            87
player          3
pleas           9
plu             3
pocket          2
pod             2
point           2
pool            2
poor            4
pop             2
port            2
portable        7
pound           3
pow             2
present         6
pressure        4
pretty          10
previou         2
pric            3
price           42
print           3
probab          5
problem         23
produc          2
product         91
promis          5
prone           2
proper          3
provide         2
purchas         18
purchase        6
purse           2
put             5
quality         34
quick           7
quite           6
radio           15
random          2
range           2
rate            4
rath            2
rca             2
read            9
real            35
reason          5
reasonable      3
receiv          12
reciev          7
recogniz        2
recomend        3
recommend       23
record          7
refund          6
refuse          2
relative        2
reliable        4
repair          5
replac          4
replace         2
requir          4
reset           2
respond         5
rest            2
restart         2
result          4
return          20
review          10
right           12
rio             5
rock            2
roll            2
room            8
rope            2
run             10
safe            3
said            4
sale            2
same            10
samsung         2
sandisk         5
sansa           2
satisfi         5
sav             2
save            5
saw             3
say             19
scientific      3
scratch         3
scratche        3
screen          21
screw           6
sd              3
second          7
secure          2
see             4
seem            18
seen            4
select          2
sell            6
seller          2
send            5
sense           2
sent            6
service         22
set             8
sett            2
several         5
shape           5
shave           2
she             16
shipp           18
shock           3
short           5
should          12
show            10
shuffle         2
sign            2
simp            2
simple          4
since           6
size            18
sleek           3
slight          2
slim            2
slow            3
small           26
snack           3
snug            2
so              55
soft            2
software        12
sold            3
solid           4
some            12
someone         6
something       9
sometime        3
son             8
song            22
sony            5
soon            2
soooo           3
sound           33
south           2
space           7
spec            3
special         2
spend           7
spent           6
spin            3
st              2
staff           3
stand           5
star            5
start           12
stat            2
stay            17
stereo          2
stick           2
still           17
stink           2
stinky          2
stop            6
stopp           7
storage         3
store           8
string          3
strong          2
stuff           4
stupid          2
sturdy          4
such            9
suck            5
sudden          2
sugar           2
suggest         5
summ            2
support         3
suppos          2
sure            5
switch          2
system          5
tak             2
take            14
talk            3
tape            2
target          2
tast            2
taste           5
tell            4
tempo           2
terrible        7
textbook        2
th              28
than            29
thank           12
that            88
the             491
their           6
them            28
then            14
there           29
therefore       2
these           23
they            46
theyre          3
thi             295
thin            2
thing           6
think           15
third           3
tho             2
those           6
though          7
thought         4
three           9
through         5
thumb           2
tight           3
tighten         5
time            42
tiny            5
tip             2
title           2
to              321
today           4
toilet          4
ton             3
too             22
took            4
tool            2
top             3
toss            2
total           5
touch           2
tough           2
tourist         2
toy             4
track           3
transf          7
transfer        2
trash           2
travel          3
tri             11
try             7
tun             8
turn            8
tv              5
twice           3
two             18
type            2
unable          2
understand      3
unit            9
unless          2
until           9
up              34
update          2
upgrad          2
upgrade         3
upload          2
upset           2
us              31
usb             12
use             78
useful          3
useless         4
utility         2
value           7
vendor          2
version         4
very            100
video           12
vista           2
volume          2
wa              114
wait            2
walk            2
walmart         2
want            18
wasnt           3
waste           14
watch           5
way             16
we              20
wear            4
web             2
website         4
week            15
weight          5
well            26
went            6
were            14
what            37
whatsoev        2
when            35
where           2
which           14
while           12
whistle         2
who             13
whole           3
why             6
wife            4
will            39
window          9
wipe            2
wish            4
with            110
within          7
without         7
wo              9
wonderful       6
word            2
work            102
world           2
worse           4
worst           10
worth           15
would           46
wrong           6
xlr             2
xp              5
ye              3
year            20
yet             2
you             117
young           3
your            28
youre           4
yr              3
zen             8
zune            2
