able           	2
absolutely     	3
actually       	3
adapter        	3
addition       	2
address        	2
again          	7
ago            	5
agree          	2
all            	3
almost         	8
alone          	2
along          	2
already        	4
although       	2
always         	3
amazon         	11
amount         	2
another        	8
anymore        	2
anyone         	4
anything       	9
apart          	2
apple          	9
archos         	2
around         	3
arrive         	3
arrived        	4
ask            	2
asking         	3
average        	2
avoid          	2
aware          	2
away           	6
back           	4
backpack       	2
bad            	18
basically      	2
batteries      	3
battery        	17
been           	9
before         	6
being          	3
believe        	3
better         	16
between        	2
beware         	2
biofeedback    	2
bit            	5
black          	5
body           	4
boston         	2
both           	3
bought         	29
box            	4
break          	3
breaks         	2
broke          	9
broken         	4
bucks          	2
buds           	2
burn           	2
button         	2
buttons        	3
buy            	44
buying         	7
came           	4
camera         	3
cannot         	3
cant           	7
card           	10
cash           	2
causing        	2
changed        	3
charge         	6
charges        	2
charging       	2
cheap          	11
cheaper        	2
check          	3
child          	3
christmas      	5
clear          	2
clubs          	3
company        	3
compatible     	3
complete       	3
completely     	2
complicated    	2
computer       	9
condition      	2
conect         	2
considering    	3
contact        	3
control        	2
correctly      	2
cost           	2
couldnt        	2
couple         	3
crashed        	2
crashes        	3
creative       	4
credit         	3
customer       	6
cute           	2
cuz            	2
daughter       	2
days           	10
dead           	5
defective      	4
definitely     	2
deliver        	2
delivered      	2
deserve        	2
device         	11
did            	14
didnt          	15
died           	12
different      	3
difficult      	3
disappointed   	4
disc           	3
display        	4
doent          	2
does           	12
doesnt         	18
doing          	3
dont           	38
down           	5
download       	5
drink          	4
drive          	3
drives         	3
during         	3
dvd            	4
dvds           	2
each           	2
ear            	3
easily         	2
easy           	4
effort         	2
elliptical     	2
else           	3
email          	2
end            	2
energy         	2
enough         	5
eventually     	2
ever           	16
every          	10
everything     	3
everywhere     	2
exercise       	6
expected       	3
expensive      	5
experience     	4
experienced    	2
f              	2
fail           	3
failed         	2
fall           	2
far            	4
fat            	2
fault          	2
features       	3
feels          	2
few            	4
figure         	3
files          	5
finally        	3
finding        	2
fine           	6
fit            	2
five           	2
flash          	3
flashlight     	2
flawed         	2
fm             	6
fooling        	2
forces         	2
forever        	2
found          	7
four           	2
fragile        	2
free           	3
freezes        	5
froze          	5
full           	2
functionality  	2
games          	2
gave           	3
gb             	9
getting        	5
gift           	4
gives          	2
goes           	2
going          	7
good           	16
got            	17
gotten         	2
great          	8
guess          	2
guitar         	4
had            	26
half           	3
hands          	2
hangs          	2
happen         	2
happy          	6
hard           	13
hardware       	2
has            	17
hate           	2
havent         	2
headphones     	6
heard          	2
heavy          	2
high           	2
hold           	2
holds          	3
horrible       	5
hotel          	6
hours          	9
however        	3
hype           	2
idea           	3
im             	6
impossible     	2
inaccurate     	4
including      	2
inferior       	4
install        	2
instead        	4
instructions   	3
interface      	2
internet       	2
invest         	2
ipod           	22
ipods          	4
iriver         	2
isnt           	3
it             	26
item           	25
items          	7
itself         	2
ive            	17
jump           	3
junk           	12
kept           	2
kid            	2
kids           	2
know           	11
large          	2
last           	6
lasted         	3
late           	2
later          	2
lcd            	4
led            	2
less           	2
let            	3
lexar          	2
life           	5
light          	3
lights         	2
like           	17
list           	2
little         	6
load           	3
loaded         	2
locked         	2
longer         	3
looking        	2
looks          	2
loose          	4
lost           	3
lot            	5
love           	2
m              	2
machine        	2
made           	8
make           	5
makes          	4
manual         	2
many           	4
matt           	2
matter         	2
max            	2
may            	3
maybe          	4
mb             	2
me             	2
means          	2
media          	2
memory         	6
meter          	2
microsoft      	3
might          	3
mine           	6
minutes        	8
missing        	3
mode           	2
model          	5
money          	25
monitor        	2
monster        	2
month          	11
months         	17
more           	30
mouse          	2
mp             	24
much           	9
multiple       	4
music          	11
nano           	3
need           	2
needs          	3
neither        	2
never          	19
new            	9
next           	3
nice           	5
nitrus         	2
no             	28
nor            	4
not            	107
nothing        	8
october        	2
off            	7
often          	3
ok             	2
old            	3
older          	2
once           	5
one            	4
onto           	3
opened         	2
order          	7
ordered        	7
oregon         	2
os             	2
out            	2
overall        	2
overpriced     	2
own            	3
page           	3
paid           	3
pain           	2
pair           	2
palm           	2
paper          	2
pay            	8
pedometer      	2
pedometers     	2
people         	4
perhaps        	2
philips        	2
photos         	2
pick           	3
piece          	6
place          	5
plastic        	2
play           	8
player         	36
players        	3
playing        	3
plays          	3
poor           	3
portable       	2
pounds         	2
power          	3
presents       	2
pretty         	5
previous       	2
price          	11
priced         	3
problem        	4
problems       	8
product        	48
products       	2
promised       	4
prone          	2
properly       	2
proprietary    	2
purchase       	3
purchased      	9
put            	2
quality        	15
quick          	2
quite          	4
radio          	5
range          	2
rca            	2
read           	3
reading        	2
real           	4
really         	6
reason         	3
reasonable     	2
receipt        	2
received       	8
recieved       	2
recognized     	2
recomend       	2
recommend      	11
refund         	5
refunded       	2
reliable       	2
remember       	2
repair         	2
replace        	2
replaced       	2
replacing      	2
requiring      	2
reset          	2
respond        	4
rest           	2
restart        	2
return         	9
returned       	11
returning      	3
review         	2
reviews        	3
right          	3
rio            	2
rope           	2
said           	3
same           	8
samsung        	2
sandisk        	6
save           	4
saw            	2
says           	2
scientific     	2
scratched      	2
scratches      	4
screen         	12
screws         	5
sd             	2
second         	5
seconds        	2
seemed         	2
seems          	4
seen           	3
sell           	3
send           	6
sense          	2
sent           	6
service        	9
set            	4
several        	6
shipped        	3
shipping       	8
shocked        	2
short          	4
should         	9
shuffle        	2
sign           	2
since          	4
slow           	3
small          	7
software       	9
sold           	3
someone        	3
something      	2
sometimes      	2
son            	3
song           	2
songs          	10
sony           	5
sound          	5
specs          	3
spend          	4
spending       	2
spent          	4
st             	2
star           	3
start          	2
started        	3
stated         	2
stay           	13
stiff          	2
still          	12
stinky         	2
stop           	3
stopped        	5
stops          	2
store          	2
strings        	3
stuff          	2
stupid         	2
sturdy         	2
such           	5
sucks          	4
suggest        	4
support        	4
sure           	2
switch         	2
take           	6
takes          	3
taking         	2
tell           	4
terrible       	6
th             	2
thanks         	4
thats          	4
them           	2
therefore      	2
theres         	3
thing          	17
third          	2
tho            	2
those          	4
though         	4
thought        	2
three          	8
thru           	2
tighten        	2
tightened      	3
time           	26
times          	7
tips           	2
today          	3
toilet         	3
too            	17
took           	3
toothbrush     	2
totally        	2
tourist        	2
toy            	4
transfer       	2
trash          	2
tried          	10
try            	2
tuner          	3
turn           	6
turned         	3
twice          	3
u              	3
unable         	2
under          	2
unit           	4
unless         	2
until          	8
upgrade        	2
upset          	2
usb            	8
use            	2
used           	8
useless        	4
user           	2
using          	5
version        	2
very           	38
videos         	3
wasnt          	6
waste          	16
watch          	2
way            	2
wear           	2
web            	2
website        	3
week           	5
weeks          	9
weight         	3
went           	4
were           	8
werent         	2
while          	5
whole          	3
why            	4
windows        	7
wipe           	2
wish           	4
within         	8
wont           	10
work           	3
worked         	11
working        	8
works          	12
worse          	4
worst          	10
worth          	11
wouldnt        	6
wrong          	2
x              	2
xp             	5
yahoo          	3
years          	10
yes            	2
youre          	2
zen            	3
