aaa            	3
able           	5
absolutely     	5
absolutly      	2
accurate       	7
actually       	3
adapter        	6
add            	4
addition       	2
address        	2
adults         	2
advertised     	3
affordable     	3
afraid         	2
again          	10
ago            	8
agree          	3
airport        	2
albums         	3
all            	3
allow          	2
almost         	13
alone          	2
along          	3
alot           	2
already        	5
although       	3
always         	7
amazed         	2
amazing        	7
amazon         	17
amazone        	2
amazons        	2
amount         	3
amp            	2
another        	12
answer         	2
anymore        	2
anyone         	10
anything       	11
anywhere       	3
apart          	2
apple          	13
archos         	2
arm            	3
around         	9
arrive         	3
arrived        	6
ask            	3
asking         	3
attention      	2
audio          	2
available      	2
average        	4
avoid          	3
aware          	2
away           	8
awesome        	5
awsome         	2
baby           	3
back           	4
backpack       	3
bad            	23
ball           	2
band           	5
bar            	5
bars           	3
basically      	2
basis          	2
bass           	2
batteries      	9
battery        	33
beautiful      	3
become         	2
been           	18
before         	12
being          	6
believe        	4
bells          	2
best           	17
better         	32
between        	2
beware         	2
big            	6
bike           	7
biofeedback    	2
birthday       	3
bit            	5
black          	5
blood          	5
body           	5
book           	2
books          	2
bose           	2
boston         	2
both           	9
bother         	2
bought         	53
box            	5
brand          	3
brands         	2
break          	3
breaks         	2
broke          	10
broken         	5
brought        	2
bucks          	3
buds           	2
built          	3
burn           	3
business       	4
button         	3
buttons        	4
buy            	63
buying         	15
cable          	3
came           	11
camera         	10
cannot         	3
cant           	11
car            	4
card           	15
cards          	2
care           	3
carry          	5
carrying       	2
case           	4
cash           	3
causing        	2
cd             	2
cds            	5
certainly      	3
changed        	4
charge         	7
charges        	2
charging       	2
cheap          	12
cheaper        	6
check          	3
child          	3
christmas      	13
city           	2
class          	3
clean          	5
cleaning       	2
clear          	5
clearly        	2
clip           	4
close          	2
clubs          	3
college        	2
color          	4
combination    	2
comes          	4
comfortable    	5
common         	3
compact        	9
company        	7
compatible     	3
complaints     	7
complete       	3
completely     	4
complicated    	2
computer       	12
condition      	9
conect         	2
connector      	2
considering    	3
constantly     	2
contact        	3
control        	3
controls       	3
convenient     	3
cool           	7
copy           	2
cord           	5
correctly      	2
cost           	5
costs          	4
couldnt        	5
couple         	4
cover          	2
crash          	2
crashed        	3
crashes        	3
creative       	10
credit         	3
customer       	6
cute           	4
cuz            	2
cymbals        	3
dad            	4
daily          	2
damage         	3
data           	2
daughter       	11
daughters      	2
days           	11
dead           	5
deal           	7
defective      	4
definately     	3
definitely     	4
delhi          	2
deliver        	2
delivered      	3
delivery       	3
describe       	2
described      	3
description    	2
deserve        	2
design         	3
designed       	2
device         	15
diaper         	2
did            	18
didnt          	18
die            	2
died           	12
different      	8
difficult      	3
digital        	5
directly       	2
dirty          	2
disappointed   	5
disc           	3
display        	5
doent          	2
does           	27
doesnt         	22
dog            	2
dogs           	3
doing          	3
dollars        	2
dominated      	2
dont           	49
down           	6
download       	8
downloaded     	2
drains         	2
drink          	5
drive          	7
drives         	4
dropped        	2
drums          	3
durable        	3
during         	4
dvd            	6
dvds           	5
each           	2
ear            	3
earbuds        	2
easier         	2
easily         	5
easy           	56
eat            	3
effect         	2
effort         	2
elegant        	2
elliptical     	2
else           	7
email          	3
end            	2
energy         	9
enjoy          	6
enjoying       	2
enough         	11
equipment      	4
especially     	2
etc            	2
eventually     	2
ever           	25
everthing      	2
every          	14
everything     	11
everywhere     	5
exactly        	4
excellent      	16
except         	3
exercise       	14
exercising     	2
expect         	2
expected       	10
expensive      	6
experience     	5
experienced    	2
extra          	6
extremely      	2
f              	2
face           	2
fail           	4
failed         	2
fall           	2
family         	4
fantastic      	4
far            	13
fast           	9
faster         	4
fat            	3
fault          	3
favorite       	6
feature        	2
features       	11
feedback       	2
feel           	6
feels          	6
fell           	3
few            	5
figure         	4
files          	7
fill           	2
finally        	3
find           	4
finding        	2
fine           	13
firmware       	2
fit            	3
fitness        	2
fits           	4
five           	2
fixed          	2
flash          	5
flashlight     	2
flat           	2
flavor         	2
flavors        	2
flawed         	2
floor          	3
fm             	11
food           	2
fooling        	2
forces         	2
forever        	6
forget         	2
form           	2
format         	2
found          	11
four           	2
fragile        	2
free           	8
freezes        	5
friend         	4
friendly       	3
friends        	5
froze          	5
full           	4
fun            	2
functionality  	2
fundamentally  	2
future         	2
gadget         	2
games          	2
garage         	2
gave           	5
gb             	19
gen            	4
generally      	2
gets           	2
getting        	6
gift           	12
gifts          	2
gives          	2
glad           	5
goes           	2
going          	11
good           	84
got            	31
gotten         	3
great          	149
green          	2
guess          	4
guest          	2
guitar         	6
gym            	4
had            	54
half           	4
hand           	2
handle         	2
handles        	2
hands          	4
handy          	5
hangs          	2
happen         	4
happy          	21
hard           	18
hardware       	2
has            	48
hate           	2
havent         	8
having         	4
head           	3
headphones     	10
healthy        	2
hear           	3
heard          	6
heavy          	3
help           	2
helpful        	2
here           	4
high           	3
highly         	11
hold           	8
holds          	7
home           	5
hooah          	3
hope           	4
horrible       	5
horse          	2
hotel          	12
hour           	2
hours          	9
house          	2
however        	4
huge           	2
hungry         	2
hurt           	2
husband        	6
hype           	2
id             	3
idea           	3
ill            	2
im             	15
impossible     	2
inaccurate     	4
included       	2
including      	2
inexpensive    	2
inferior       	4
info           	2
information    	2
inside         	3
install        	2
instead        	4
instructions   	6
interface      	2
internet       	2
invest         	2
ipod           	63
ipods          	7
iriver         	2
isnt           	4
issues         	2
it             	58
item           	41
items          	10
itself         	4
ive            	26
jump           	4
junk           	12
keep           	4
keeping        	2
keeps          	2
kept           	2
keys           	2
kid            	3
kids           	8
kind           	2
know           	13
knows          	2
lady           	2
laptop         	2
large          	6
last           	14
lasted         	3
lasts          	2
late           	3
later          	3
lcd            	4
learning       	2
least          	3
led            	2
less           	6
let            	3
lexar          	2
life           	16
light          	8
lights         	2
lightweight    	3
like           	50
likes          	5
line           	4
list           	2
listen         	3
listened       	3
listening      	5
little         	20
load           	4
loaded         	2
location       	4
locked         	2
long           	5
longer         	6
looked         	2
looking        	7
looks          	10
loose          	4
lose           	2
lost           	3
lot            	14
lots           	11
loud           	2
love           	47
loved          	6
loves          	15
low            	4
m              	4
machine        	7
made           	14
major          	2
make           	7
makes          	14
making         	2
manual         	3
manufacturer   	2
many           	9
market         	4
mat            	2
matt           	2
matter         	3
max            	2
may            	3
maybe          	4
mb             	3
me             	5
means          	2
media          	4
meditation     	2
memory         	11
mentioned      	2
met            	2
meter          	2
mic            	5
microphone     	8
microsoft      	3
mics           	2
might          	5
military       	2
million        	2
mine           	8
minutes        	10
missing        	3
mode           	2
model          	7
mom            	2
money          	32
monitor        	7
monster        	2
month          	14
months         	20
more           	49
mouse          	2
move           	2
movies         	3
mp             	53
much           	36
multiple       	4
music          	37
musical        	2
must           	3
myself         	2
nano           	15
navigation     	2
near           	3
neck           	2
need           	10
needed         	4
needs          	7
negative       	3
neither        	2
never          	25
new            	17
next           	4
nice           	26
nifty          	2
night          	3
nitrus         	2
no             	53
nokia          	3
nor            	4
not            	145
note           	2
nothing        	9
notice         	2
now            	2
october        	2
off            	9
offers         	2
often          	3
oh             	2
ok             	4
old            	9
older          	3
omron          	2
on             	2
once           	9
one            	5
ones           	4
onto           	4
open           	2
opened         	3
operate        	2
opinion        	2
option         	3
options        	3
order          	8
ordered        	11
oregon         	4
os             	2
others         	4
otherwise      	2
out            	4
overall        	3
overly         	3
overpriced     	2
own            	9
package        	7
packages       	2
page           	4
paid           	3
pain           	3
pair           	2
palm           	2
paper          	3
pay            	9
pedometer      	5
pedometers     	2
pen            	2
people         	7
per            	3
perfect        	10
perfectly      	8
performance    	3
perhaps        	2
philips        	2
phone          	6
phones         	4
photos         	5
pick           	4
picked         	2
pics           	2
picture        	7
pictures       	3
piece          	9
pillow         	3
pink           	3
place          	9
plastic        	2
play           	10
player         	78
players        	4
playing        	4
plays          	4
please         	2
pleased        	10
plenty         	2
plus           	3
pocket         	2
pod            	2
pool           	2
poor           	3
pop            	2
port           	2
portable       	7
pounds         	2
power          	3
present        	5
presents       	2
pressure       	4
pretty         	10
previous       	2
price          	44
priced         	4
probably       	5
problem        	11
problems       	16
product        	94
products       	2
promised       	5
prone          	2
properly       	3
proprietary    	2
purchase       	7
purchased      	17
purchasing     	2
purse          	2
put            	5
quality        	37
quick          	3
quickly        	4
quit           	2
quite          	7
radio          	16
range          	2
rate           	3
rather         	2
rca            	2
read           	6
reader         	2
reading        	4
real           	5
really         	36
reason         	5
reasonable     	3
receipt        	2
received       	13
recently       	2
recieved       	7
recognized     	2
recomend       	3
recommend      	26
recommended    	2
recorder       	3
recording      	2
refund         	5
refunded       	2
reliable       	4
remember       	2
repair         	3
replace        	2
replaced       	2
replacing      	2
required       	2
requiring      	2
reset          	2
respond        	4
response       	2
rest           	2
restart        	2
results        	4
return         	9
returned       	11
returning      	3
review         	3
reviews        	5
right          	12
rio            	5
rocks          	2
room           	5
rooms          	3
rope           	2
run            	5
running        	4
runs           	2
safe           	3
said           	5
sale           	2
same           	11
samsung        	3
sandisk        	7
sansa          	2
satisfied      	5
save           	4
saw            	3
saying         	2
says           	3
scientific     	3
scratched      	2
scratches      	4
screen         	21
screws         	5
sd             	3
second         	5
seconds        	2
seem           	4
seemed         	3
seems          	12
seen           	4
select         	2
sell           	3
seller         	3
sellers        	2
send           	6
sense          	2
sent           	8
service        	24
services       	2
set            	9
setting        	2
several        	8
shape          	6
shave          	2
shipped        	5
shipping       	13
shocked        	2
short          	4
should         	12
show           	3
shows          	6
shuffle        	2
sign           	2
simple         	4
simply         	2
since          	8
site           	2
size           	19
sleek          	3
slim           	2
slow           	3
small          	26
snack          	3
snugly         	2
so             	2
soft           	2
software       	13
sold           	3
solid          	4
someone        	7
something      	10
sometimes      	3
son            	9
song           	3
songs          	20
sony           	6
soooo          	3
sound          	33
sounds         	7
south          	2
space          	7
speaker        	2
special        	2
specs          	3
spend          	4
spending       	3
spent          	6
sports         	2
st             	2
staff          	3
stand          	5
star           	5
stars          	2
start          	4
started        	5
starting       	3
stated         	2
stay           	17
stays          	2
stereo         	2
stick          	2
stiff          	3
still          	18
stinky         	2
stop           	4
stopped        	6
stops          	2
storage        	5
store          	7
storing        	2
strap          	2
strings        	3
strong         	2
stuff          	4
stupid         	2
sturdy         	4
such           	9
sucks          	4
sugar          	2
suggest        	5
summer         	2
support        	4
supposed       	2
suprisingly    	2
sure           	6
switch         	2
system         	7
take           	10
takes          	5
taking         	2
talking        	2
tape           	2
target         	2
tastes         	5
tasting        	2
tell           	4
terrible       	8
th             	3
thank          	6
thanks         	9
thats          	5
them           	2
therefore      	2
theres         	3
theyre         	3
thin           	3
thing          	29
things         	7
third          	3
this           	2
tho            	2
those          	6
though         	8
thought        	4
three          	9
through        	5
thru           	2
thumbs         	2
tight          	3
tighten        	2
tightened      	3
time           	39
timely         	3
times          	8
tiny           	5
tips           	2
title          	2
tivo           	2
today          	4
toilet         	3
tons           	3
too            	26
took           	4
tool           	2
toothbrush     	3
top            	3
totally        	4
tough          	2
tourist        	2
toy            	4
track          	2
transfer       	8
trash          	2
travel         	4
tried          	13
try            	4
trying         	2
tuner          	6
turn           	6
turned         	3
tv             	6
twice          	4
type           	4
u              	5
unable         	2
under          	2
understand     	3
unit           	9
units          	2
unless         	3
until          	10
up             	3
upgrade        	3
ups            	2
upset          	2
usb            	12
use            	6
used           	17
useful         	3
useless        	4
user           	4
uses           	5
using          	11
utility        	2
v              	2
value          	8
vendor         	2
version        	3
very           	113
video          	9
videos         	5
vista          	2
volume         	2
w              	2
walk           	2
walmart        	2
wanted         	6
wants          	2
wasnt          	7
waste          	16
watch          	5
way            	2
wear           	3
web            	2
website        	4
week           	5
weeks          	11
weight         	7
well           	3
went           	6
were           	13
werent         	2
whatsoever     	2
where          	2
while          	14
whistles       	2
whole          	4
why            	6
wife           	4
windows        	9
wipe           	2
wish           	6
within         	9
without        	7
wonderful      	5
wont           	11
word           	2
work           	3
worked         	19
working        	12
works          	42
world          	2
worse          	4
worst          	10
worth          	17
worthless      	2
wouldnt        	6
wrong          	6
x              	2
xlr            	2
xp             	5
yahoo          	3
years          	13
yes            	3
yet            	4
you            	5
young          	2
youre          	4
yrs            	2
zen            	8
zune           	2
