aaa            	3
able           	5
absolut        	2
absolute       	5
accurate       	7
actual         	4
adapt          	7
add            	4
addition       	2
address        	2
adult          	2
advertis       	3
affordable     	3
afraid         	2
again          	10
ago            	8
agree          	3
airport        	2
album          	4
all            	3
allow          	3
almost         	13
alone          	2
along          	3
alot           	2
already        	5
although       	3
alway          	7
amaz           	9
amazon         	19
amazone        	2
amount         	3
amp            	2
anoth          	12
answ           	2
anymore        	2
anyone         	10
anything       	11
anywhere       	3
apart          	2
apple          	13
archo          	2
arm            	3
around         	9
arriv          	6
arrive         	3
ask            	6
attention      	2
audio          	2
available      	2
average        	4
avoid          	3
aware          	2
away           	8
awesome        	5
awsome         	2
baby           	3
back           	4
backpack       	3
bad            	23
ball           	2
band           	6
bar            	8
basi           	2
basical        	2
bass           	2
batterie       	9
battery        	33
be             	6
beautiful      	3
become         	2
before         	12
beginn         	2
believe        	4
bell           	2
best           	17
bett           	32
between        	2
beware         	2
big            	6
bike           	7
biofeedback    	2
birthday       	3
bit            	5
black          	5
blood          	5
body           	5
book           	4
boost          	2
bose           	2
boston         	2
both           	11
bought         	53
box            	5
brake          	2
brand          	5
break          	6
broke          	10
broken         	5
brought        	2
buck           	3
bud            	3
built          	3
burn           	3
business       	4
button         	7
buy            	79
bye            	2
cable          	4
calendar       	2
camera         	11
cannot         	3
cant           	11
car            	4
card           	17
care           	3
carry          	7
case           	4
cash           	3
caus           	2
cd             	7
cent           	2
certain        	3
chang          	4
charg          	3
charge         	9
cheap          	18
check          	4
child          	3
children       	2
christma       	13
city           	2
class          	3
clean          	10
clear          	7
clip           	5
close          	2
club           	3
college        	2
color          	4
combination    	2
comfortable    	5
common         	3
compact        	9
company        	7
compatible     	3
complaint      	7
complete       	7
complicat      	2
comput         	12
condition      	9
conect         	2
connect        	2
connector      	2
consider       	3
constant       	2
contact        	4
control        	6
convenient     	3
cool           	7
copy           	2
cord           	5
correct        	3
cost           	9
couldnt        	5
count          	2
couple         	4
cov            	2
cover          	2
crash          	5
crashe         	3
creative       	10
credit         	3
custom         	6
cute           	4
cuz            	2
cymbal         	3
dad            	4
dai            	2
damag          	2
damage         	3
data           	2
daught         	11
daughter       	2
day            	12
dead           	5
deal           	8
defective      	4
definate       	3
definite       	4
delhi          	2
deliv          	2
deliver        	3
delivery       	3
dent           	3
describ        	4
describe       	2
description    	2
deserve        	2
design         	6
develop        	2
device         	16
di             	12
diap           	2
didnt          	18
die            	2
different      	8
difficult      	3
digg           	2
digital        	5
direct         	2
direction      	2
dirty          	2
disappoint     	7
disc           	4
disk           	2
display        	5
do             	4
doent          	2
doesnt         	22
dog            	5
dollar         	2
dominat        	2
dont           	49
down           	6
download       	11
drain          	3
drink          	5
driv           	2
drive          	11
dropp          	2
drum           	4
dur            	4
durable        	3
dvd            	11
each           	2
ear            	4
earbud         	2
easi           	7
easy           	56
eat            	3
effect         	3
effective      	2
effort         	2
elegant        	2
elliptical     	2
else           	7
email          	5
end            	3
energy         	9
enjoy          	8
enough         	11
entire         	2
equipment      	4
especial       	2
etc            	2
ev             	25
eventual       	2
everthing      	2
every          	14
everything     	11
everywhere     	5
exact          	4
excellent      	16
except         	3
exercis        	2
exercise       	15
expect         	12
expensive      	6
experienc      	2
experience     	5
extra          	6
extreme        	2
face           	2
fail           	6
fall           	3
fami           	4
fantastic      	4
far            	13
fast           	13
fat            	3
fault          	3
favorite       	6
feature        	13
feedback       	2
feel           	13
fell           	3
few            	5
figur          	2
figure         	4
file           	8
fill           	3
final          	3
find           	6
fine           	13
firmware       	2
fit            	7
fitness        	2
five           	2
fix            	2
flash          	6
flashlight     	2
flat           	2
flavor         	4
flaw           	2
floor          	4
fm             	11
food           	2
fool           	2
force          	3
forev          	6
forget         	2
form           	3
format         	2
found          	11
four           	2
fragile        	2
free           	8
freeze         	5
friend         	12
froze          	5
frustrat       	2
full           	4
fun            	2
functionality  	2
fundamental    	2
future         	2
gadget         	2
game           	3
garage         	2
gb             	19
gen            	4
general        	3
gett           	6
gift           	14
girl           	2
glad           	5
go             	12
good           	85
gotten         	3
great          	150
green          	2
guess          	4
guest          	2
guitar         	7
guy            	2
gym            	4
half           	4
hand           	6
handl          	2
handle         	4
handy          	5
hang           	2
happen         	5
happy          	21
hard           	18
hardware       	2
hate           	2
hav            	4
have           	2
havent         	8
head           	4
headphone      	11
healthy        	2
hear           	3
heard          	6
heavy          	3
help           	4
helpful        	2
here           	5
high           	14
hold           	16
home           	5
hooah          	3
hope           	4
horrible       	5
horse          	3
hotel          	13
hour           	11
house          	2
howev          	4
hr             	2
huge           	2
hungry         	2
hurt           	2
husband        	6
hype           	2
id             	3
idea           	3
ill            	2
im             	15
impossible     	2
inaccurate     	4
includ         	4
inexpensive    	2
inferior       	4
info           	2
information    	2
inside         	3
install        	3
instead        	4
instruction    	7
instrument     	2
interface      	2
internet       	2
invest         	2
ipod           	70
iriv           	2
isnt           	4
issue          	2
it             	58
item           	51
itself         	4
ive            	26
jump           	4
junk           	12
kazoo          	2
keep           	8
kept           	2
key            	3
kid            	11
kind           	3
know           	15
l              	2
lack           	2
lady           	2
laptop         	2
large          	6
last           	19
lat            	4
late           	3
lcd            	4
learn          	3
least          	3
less           	6
let            	3
level          	2
lexar          	2
life           	16
light          	11
lightweight    	3
like           	56
line           	4
list           	3
listen         	11
little         	20
load           	7
location       	4
lock           	3
long           	11
look           	7
loose          	4
lose           	2
lost           	3
lot            	25
loud           	2
lov            	6
love           	62
low            	5
machine        	8
made           	14
major          	2
mak            	2
make           	21
manual         	3
manufactur     	3
many           	9
market         	4
mat            	2
matt           	5
max            	2
may            	3
maybe          	4
mb             	4
me             	5
mean           	3
measurement    	2
media          	4
meditation     	2
memory         	11
mention        	2
menu           	2
mess           	2
met            	4
mic            	7
microphone     	8
microsoft      	3
might          	5
military       	2
million        	2
minute         	10
miss           	3
mode           	2
model          	8
mom            	2
money          	32
monitor        	7
monst          	2
month          	34
more           	49
mouse          	2
move           	2
movie          	3
mp             	54
much           	36
multiple       	4
music          	37
musical        	2
must           	3
myself         	2
nano           	16
navigation     	2
ne             	10
near           	4
neck           	2
need           	11
negative       	3
neith          	2
nev            	25
new            	17
next           	4
nice           	26
nifty          	2
night          	3
nitru          	2
no             	53
noise          	2
nokia          	3
nor            	4
not            	145
note           	2
notebook       	2
nothing        	9
notice         	2
now            	2
o              	2
octob          	2
off            	10
offer          	3
often          	3
oh             	2
ok             	4
old            	13
omron          	2
on             	2
once           	9
one            	9
onto           	4
open           	6
operate        	3
opinion        	2
option         	6
ord            	8
order          	11
oregon         	4
other          	4
otherwise      	2
out            	4
over           	3
overall        	3
overpric       	2
own            	12
package        	9
page           	4
paid           	3
pain           	3
pair           	2
palm           	2
pap            	3
pay            	12
pedomet        	5
pedometer      	2
pen            	2
people         	7
perfect        	18
perform        	3
performance    	3
perhap         	2
personal       	2
philip         	2
phone          	10
photo          	5
pic            	3
pick           	6
picture        	10
piece          	9
pillow         	4
pink           	3
place          	10
plastic        	2
play           	97
player         	4
pleas          	10
please         	2
plenty         	2
plu            	3
pocket         	2
pod            	2
point          	2
pool           	2
poor           	4
pop            	2
port           	2
portable       	7
pound          	3
pow            	3
present        	7
pressure       	4
pretty         	10
previou        	2
pric           	4
price          	44
print          	4
probab         	5
problem        	27
produc         	2
product        	96
promis         	5
prone          	2
proper         	3
proprietary    	2
provide        	2
purchas        	19
purchase       	7
purse          	2
put            	5
quality        	37
quick          	7
quit           	2
quite          	7
radio          	16
random         	2
range          	2
rate           	4
rath           	2
rca            	2
read           	12
real           	41
reason         	5
reasonable     	3
receipt        	2
receiv         	13
recent         	2
recharge       	2
reciev         	7
recogniz       	2
recomend       	3
recommend      	28
record         	7
refund         	7
refuse         	2
regret         	2
relative       	2
reliable       	4
rememb         	2
rep            	2
repair         	5
replac         	4
replace        	2
requir         	4
reset          	3
respond        	6
response       	2
rest           	2
restart        	2
result         	5
return         	23
review         	10
right          	12
rio            	5
rock           	2
roll           	2
room           	8
rope           	2
run            	7
runn           	5
safe           	3
sale           	2
same           	11
samsung        	3
sandisk        	7
sansa          	3
satisfi        	5
sav            	2
save           	5
say            	3
scientific     	3
scratch        	3
scratche       	4
screen         	21
screw          	6
sd             	3
second         	7
secure         	2
seem           	19
select         	2
sell           	6
seller         	2
send           	6
sense          	2
sent           	8
service        	26
set            	9
sett           	2
several        	8
shape          	6
shave          	2
shipp          	18
shock          	3
short          	6
show           	10
shuffle        	2
shutt          	2
sign           	2
simp           	2
simple         	4
since          	8
site           	2
size           	20
sleek          	3
slight         	2
slim           	2
slow           	3
small          	27
snack          	3
snug           	2
so             	2
soft           	2
software       	13
sold           	3
solid          	4
someone        	7
something      	10
sometime       	3
son            	10
song           	23
sony           	6
soon           	2
soooo          	3
sound          	40
south          	2
space          	7
speak          	2
spec           	3
special        	3
spend          	7
spent          	6
spin           	2
sport          	2
st             	2
staff          	3
stand          	5
star           	7
start          	13
stat           	2
stay           	19
stereo         	2
stick          	2
stiff          	3
still          	18
stink          	2
stinky         	2
stop           	6
stopp          	7
stor           	2
storage        	5
store          	8
strap          	2
string         	3
strong         	2
stuff          	4
stupid         	2
sturdy         	4
such           	9
suck           	6
sudden         	2
sugar          	2
suggest        	5
summ           	2
support        	4
suppos         	2
suprising      	2
sure           	6
switch         	2
system         	7
tak            	2
take           	15
talk           	4
tape           	2
target         	2
tast           	3
taste          	5
tell           	4
tempo          	2
terrible       	8
textbook       	2
th             	32
thank          	15
that           	5
them           	2
there          	3
therefore      	2
theyre         	3
thi            	2
thin           	3
thing          	7
third          	3
tho            	2
though         	8
three          	9
through        	5
thru           	2
thumb          	2
tight          	3
tighten        	5
time           	50
tiny           	5
tip            	2
title          	2
tivo           	2
today          	4
toilet         	4
ton            	3
too            	26
took           	4
tool           	3
toothbrush     	3
top            	3
toss           	2
total          	5
touch          	2
tough          	2
tourist        	2
toy            	4
track          	3
transf         	8
transfer       	2
trash          	2
travel         	4
tri            	13
try            	7
tun            	8
turn           	10
tv             	6
twice          	4
type           	4
unable         	2
und            	2
understand     	3
unfortunate    	2
unit           	11
unless         	3
until          	10
up             	5
update         	2
upgrad         	2
upgrade        	3
upload         	2
upset          	2
us             	32
usb            	12
use            	11
useful         	3
useless        	4
utility        	2
value          	8
vendor         	2
version        	4
very           	113
video          	14
vista          	2
volume         	2
wait           	2
walk           	3
walmart        	2
want           	9
wasnt          	7
waste          	16
watch          	5
way            	2
wear           	4
web            	2
website        	4
week           	17
weight         	7
well           	3
werent         	2
what           	2
whatsoev       	2
where          	2
while          	14
whistle        	2
whole          	4
why            	6
wife           	4
window         	9
wipe           	2
wish           	6
within         	9
without        	7
wonderful      	6
wont           	11
word           	2
work           	34
world          	2
worse          	4
worst          	10
worth          	17
worthless      	2
wouldnt        	6
wrong          	6
xlr            	2
xp             	5
yahoo          	3
ye             	3
year           	14
yet            	4
you            	10
young          	3
youre          	4
yr             	3
zen            	8
zune           	2
