</stop>                         270
able                            2
absolute                        3
actual                          4
adapt                           2
addition                        2
address                         2
again                           4
ago                             5
agree                           2
almost                          5
alone                           2
along                           2
already                         2
although                        2
alway                           2
amazon                          8
amount                          2
anoth                           5
anymore                         2
anyone                          3
anything                        10
apart                           2
apple                           7
archo                           2
around                          3
arriv                           4
arrive                          3
ask                             2
average                         2
avoid                           2
aware                           2
away                            7
backpack                        2
bad                             14
bar                             2
basical                         2
batterie                        3
battery                         10
be                              3
before                          5
begin                           2
bett                            8
between                         2
beware                          2
big                             2
biofeedback                     2
bit                             3
black                           3
body                            2
boston                          2
both                            4
bought                          22
box                             4
brand                           2
break                           4
broke                           8
broken                          3
buck                            2
bud                             3
button                          4
buy                             28
calendar                        2
camera                          3
card                            8
cash                            2
caus                            2
cd                              2
chang                           3
charg                           3
charge                          7
cheap                           13
check                           3
child                           3
christma                        3
clean                           2
clear                           2
club                            2
company                         3
compatible                      2
complete                        4
complicat                       2
comput                          8
condition                       2
conect                          3
consider                        3
contact                         4
control                         3
correct                         2
cost                            2
couple                          2
crash                           3
crashe                          3
creative                        4
cute                            2
cuz                             2
daught                          2
day                             10
dead                            5
defective                       4
deliv                           2
deliver                         2
dent                            3
deserve                         2
design                          3
device                          7
di                              7
didnt                           3
different                       3
difficult                       3
disappoint                      6
disc                            3
display                         3
do                              2
doesnt                          6
dog                             2
dont                            6
down                            5
download                        6
drain                           2
drink                           4
drive                           6
dvd                             7
easi                            2
easy                            3
effect                          2
effort                          2
elliptical                      2
else                            2
email                           3
end                             2
enough                          5
entire                          2
ev                              12
eventual                        2
every                           5
everything                      3
everywhere                      2
exercise                        5
expect                          4
expensive                       4
experienc                       2
experience                      4
fail                            4
far                             4
fat                             2
fault                           2
feature                         3
feel                            3
few                             3
figure                          2
file                            3
final                           3
find                            3
fine                            5
fit                             3
five                            2
flash                           4
flashlight                      2
flaw                            2
fm                              2
fool                            2
force                           3
forev                           2
found                           7
four                            2
fragile                         2
free                            3
freeze                          2
friend                          3
froze                           3
full                            2
functionality                   2
game                            2
gb                              9
gett                            5
gift                            4
go                              6
good                            14
gotten                          2
great                           8
guess                           2
guitar                          5
guy                             2
half                            2
hand                            3
hang                            2
happen                          3
happy                           5
hard                            8
hardware                        2
hate                            2
head                            2
headphone                       4
heard                           2
heavy                           2
here                            2
high                            2
hold                            4
horrible                        4
hotel                           5
hour                            8
howev                           3
hr                              2
hype                            2
idea                            2
im                              5
impossible                      2
inaccurate                      4
includ                          2
inferior                        3
install                         2
instead                         3
instruction                     2
interface                       2
internet                        2
invest                          2
ipod                            18
iriv                            2
item                            20
itself                          2
ive                             10
junk                            6
kazoo                           2
kept                            2
kid                             4
know                            9
l                               2
lack                            2
large                           2
last                            7
lat                             3
late                            2
lcd                             2
less                            2
let                             3
lexar                           2
life                            4
light                           6
like                            16
list                            2
little                          6
load                            3
lock                            2
long                            4
look                            2
loose                           4
lost                            3
lot                             6
love                            2
machine                         3
made                            7
make                            8
manual                          2
manufactur                      2
many                            4
matt                            3
max                             2
may                             2
maybe                           2
mb                              3
mean                            2
measurement                     2
media                           2
memory                          6
mess                            2
met                             2
microsoft                       3
might                           2
minute                          5
miss                            2
mode                            2
model                           5
money                           14
monitor                         2
monst                           2
month                           16
more                            17
mouse                           2
mp                              6
much                            4
multiple                        2
music                           11
ne                              2
need                            3
nev                             12
new                             10
next                            2
nice                            3
no                              20
nor                             4
not                             85
notebook                        2
nothing                         5
o                               2
octob                           2
off                             7
often                           3
ok                              2
old                             6
once                            5
onto                            3
open                            2
operate                         2
ord                             4
order                           3
overall                         2
overpric                        2
own                             3
page                            3
paid                            3
pain                            2
pair                            2
palm                            2
pap                             2
pay                             10
pedomet                         2
pedometer                       2
people                          3
perfect                         2
perhap                          2
philip                          2
phone                           2
photo                           2
pick                            4
place                           4
plastic                         2
play                            33
poor                            4
portable                        2
pound                           3
pow                             2
present                         3
pretty                          4
previou                         2
pric                            2
price                           4
problem                         10
product                         34
promis                          4
prone                           2
proper                          2
proprietary                     2
provide                         2
purchas                         9
purchase                        3
put                             2
quality                         10
quick                           3
quite                           3
radio                           2
random                          2
range                           2
rate                            2
read                            3
real                            10
reason                          3
reasonable                      2
receipt                         2
receiv                          8
reciev                          2
recogniz                        2
recommend                       9
record                          3
reliable                        2
rememb                          2
repair                          3
replac                          3
replace                         2
requir                          2
reset                           2
respond                         5
rest                            2
restart                         2
return                          13
review                          5
right                           2
rio                             2
room                            2
rope                            2
run                             2
same                            3
samsung                         2
sandisk                         6
scientific                      2
scratch                         3
scratche                        4
screen                          7
screw                           4
sd                              2
second                          5
seem                            4
sell                            3
send                            5
sense                           2
sent                            6
service                         9
set                             4
several                         5
shipp                           7
shock                           3
short                           5
show                            2
shuffle                         2
sign                            2
since                           4
slow                            2
small                           7
so                              2
software                        5
sold                            3
someone                         2
something                       2
sometime                        2
son                             3
song                            9
sony                            4
sound                           4
spec                            3
spend                           6
spent                           4
spin                            2
st                              2
star                            3
start                           5
stat                            2
stay                            11
stiff                           2
still                           6
stinky                          2
stopp                           3
store                           2
stuff                           2
stupid                          2
sturdy                          2
such                            4
suck                            5
sudden                          2
suggest                         3
support                         4
sure                            2
switch                          2
system                          2
tak                             2
take                            6
talk                            2
tell                            3
terrible                        7
textbook                        2
th                              14
thank                           2
that                            2
there                           3
therefore                       2
third                           2
tho                             2
though                          3
three                           7
thru                            2
tighten                         5
time                            24
tip                             2
today                           3
toilet                          3
too                             8
toothbrush                      2
total                           3
touch                           2
tourist                         2
toy                             4
transfer                        2
trash                           2
tri                             9
try                             4
tun                             3
turn                            7
twice                           3
unable                          2
und                             2
unfortunate                     2
unit                            3
unless                          2
until                           7
upgrade                         2
upload                          2
upset                           2
us                              14
usb                             4
useless                         3
vendor                          2
version                         2
very                            27
video                           2
wasnt                           3
waste                           2
watch                           3
wear                            2
web                             2
website                         2
week                            12
weight                          2
while                           3
whole                           3
why                             3
window                          6
wipe                            2
wish                            4
work                            11
worse                           4
worst                           6
worth                           9
worthless                       2
wrong                           2
xp                              4
ye                              2
year                            7
you                             4
youre                           2
zen                             3
