</stop>                         540
aaa                             2
able                            5
absolut                         2
absolute                        2
accurate                        5
actual                          4
adapt                           6
add                             3
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      3
afraid                          2
again                           5
ago                             6
agree                           3
airport                         2
album                           3
allow                           3
almost                          10
alone                           2
along                           3
alot                            2
already                         3
although                        2
alway                           6
amaz                            8
amazo                           2
amazon                          10
amazone                         2
amount                          2
amp                             2
anoth                           8
answ                            2
anymore                         2
anyone                          9
anything                        11
anywhere                        2
apart                           2
apple                           7
archo                           2
around                          6
arriv                           6
arrive                          3
ask                             3
attention                       2
audio                           2
available                       2
average                         2
avoid                           3
aware                           2
away                            6
awesome                         2
awsome                          2
baby                            3
backpack                        3
bad                             17
ball                            2
band                            6
bar                             6
basi                            2
basical                         2
bass                            2
batterie                        9
battery                         11
be                              6
beautiful                       3
become                          2
before                          10
begin                           2
believe                         2
bell                            2
best                            9
bett                            20
between                         2
beware                          2
big                             6
bike                            7
biofeedback                     2
birthday                        3
bit                             3
black                           3
body                            3
book                            2
boost                           2
bose                            2
boston                          2
both                            11
bought                          40
box                             5
brand                           4
break                           4
broke                           9
broken                          4
brought                         2
buck                            2
bud                             3
built                           3
burn                            2
business                        4
button                          5
buy                             37
bye                             2
cable                           3
calendar                        2
camera                          9
car                             4
card                            10
care                            3
carry                           6
case                            3
cash                            3
caus                            2
cd                              6
cent                            2
certain                         3
chang                           3
charg                           3
charge                          8
cheap                           15
check                           4
child                           3
children                        2
christma                        7
city                            2
class                           2
clean                           8
clear                           5
clip                            4
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     5
common                          3
compact                         8
company                         5
compatible                      2
complaint                       2
complete                        6
complicat                       2
comput                          10
condition                       5
conect                          3
conector                        2
consider                        3
constant                        2
contact                         4
control                         5
convenient                      3
cool                            7
copy                            2
cord                            5
correct                         3
cost                            8
count                           2
couple                          3
cov                             2
cover                           2
crash                           4
crashe                          3
creative                        5
cute                            4
cuz                             2
cymbal                          3
dad                             3
dai                             2
damag                           2
damage                          3
data                            2
daught                          8
daughter                        2
day                             12
dead                            5
deal                            6
defective                       4
definate                        3
definite                        2
delhi                           2
deliv                           2
deliver                         3
delivery                        3
dent                            3
describ                         4
describe                        2
description                     2
deserve                         2
design                          4
develop                         2
device                          10
di                              7
diap                            2
didnt                           3
die                             2
different                       5
difficult                       3
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      6
disc                            3
disk                            2
display                         4
do                              3
doesnt                          6
dog                             5
dollar                          2
dont                            4
down                            4
download                        7
drain                           2
drink                           5
driv                            2
drive                           11
dropp                           2
drum                            4
dur                             2
durable                         3
dvd                             11
easi                            5
easy                            32
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            5
email                           4
end                             2
energy                          3
enjoy                           8
enough                          9
entire                          2
equipment                       2
especial                        2
etc                             2
ev                              19
eventual                        2
everthing                       2
every                           8
everything                      11
everywhere                      5
exact                           2
excellent                       13
except                          3
exercis                         2
exercise                        8
expect                          10
expensive                       5
experienc                       2
experience                      5
extra                           6
extreme                         2
face                            2
fail                            5
fami                            2
fantastic                       4
far                             11
fast                            9
fat                             3
fault                           3
favorite                        4
feature                         10
feedback                        2
feel                            4
few                             4
figur                           2
figure                          2
file                            6
fill                            2
final                           3
find                            4
fine                            9
fit                             6
fitness                         2
five                            2
flash                           2
flashlight                      2
flat                            2
flavor                          4
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           5
forget                          2
form                            3
format                          2
found                           11
four                            2
fragile                         2
free                            6
freeze                          2
friend                          9
froze                           3
full                            3
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              14
gen                             4
general                         3
gett                            5
gift                            10
girl                            2
glad                            5
go                              10
good                            48
gotten                          2
great                           61
green                           2
guess                           4
guest                           2
guitar                          7
guy                             2
gym                             3
half                            3
hand                            6
handl                           2
handle                          4
handy                           5
hang                            2
happen                          5
happy                           12
hard                            12
hardware                        2
hate                            2
hav                             4
have                            2
headphone                       7
healthy                         2
hear                            2
heard                           5
heavy                           3
help                            4
helpful                         2
here                            4
high                            3
hold                            9
home                            4
hooah                           3
hope                            2
horrible                        4
horse                           3
hotel                           10
hour                            9
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         5
hype                            2
id                              3
idea                            2
ill                             2
im                              6
impossible                      2
inaccurate                      4
includ                          3
inexpensive                     2
inferior                        3
info                            2
information                     2
inside                          2
install                         2
instead                         3
instruction                     4
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            37
iriv                            2
isnt                            2
issue                           2
item                            34
itself                          4
ive                             14
junk                            6
kazoo                           2
keep                            7
kept                            2
key                             2
kid                             6
kind                            3
know                            12
l                               2
lack                            2
lady                            2
laptop                          2
large                           6
last                            10
lat                             4
late                            3
lcd                             2
learn                           2
least                           3
less                            6
let                             3
level                           2
lexar                           2
life                            11
light                           8
lightweight                     3
like                            37
line                            3
list                            2
listen                          7
little                          17
load                            4
location                        3
lock                            3
long                            8
look                            6
loose                           4
lose                            2
lost                            3
lot                             19
loud                            2
lov                             4
love                            35
low                             3
m                               2
machine                         7
made                            10
major                           2
mak                             2
make                            17
man                             2
manual                          3
manufactur                      2
many                            9
market                          2
mat                             2
matt                            4
max                             2
may                             2
maybe                           2
mb                              4
mean                            2
measurement                     2
media                           4
meditation                      2
memory                          8
mention                         2
menu                            2
mess                            2
met                             4
mic                             5
microphone                      6
microsoft                       3
might                           4
military                        2
million                         2
minute                          6
miss                            2
mode                            2
model                           6
mom                             2
money                           15
monitor                         5
monst                           2
month                           21
more                            29
mouse                           2
move                            2
movie                           3
mp                              11
much                            14
multiple                        2
music                           25
musical                         2
must                            3
myself                          2
nano                            8
navigation                      2
ne                              8
near                            3
neck                            2
need                            10
negative                        3
nev                             15
new                             12
next                            3
nice                            18
nifty                           2
night                           3
no                              31
noise                           2
nokia                           3
nor                             4
not                             124
note                            2
notebook                        2
nothing                         5
notice                          2
o                               2
octob                           2
off                             8
offer                           2
often                           3
oh                              2
ok                              4
old                             11
omron                           2
once                            7
one                             3
onto                            3
open                            3
operate                         3
opinion                         2
option                          5
ord                             5
order                           7
other                           3
otherwise                       2
over                            2
overall                         2
overpric                        2
own                             9
p                               3
package                         8
page                            4
paid                            3
pain                            3
pair                            2
palm                            2
pap                             2
pay                             10
pedomet                         2
pedometer                       2
pen                             2
people                          6
perfect                         10
perform                         3
performance                     3
perhap                          2
personal                        2
philip                          2
phone                           10
photo                           3
pic                             3
pick                            6
picture                         6
piece                           4
pillow                          4
pink                            3
place                           6
plastic                         2
play                            52
player                          2
pleas                           6
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        7
pound                           3
pow                             2
present                         6
pretty                          7
previou                         2
pric                            3
price                           31
print                           3
probab                          2
problem                         18
produc                          2
product                         56
promis                          5
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         14
purchase                        6
purse                           2
put                             5
quality                         26
quick                           7
quite                           6
radio                           11
random                          2
range                           2
rate                            4
rath                            2
read                            7
real                            22
reason                          4
reasonable                      2
receipt                         2
receiv                          10
recharge                        2
reciev                          7
recogniz                        2
recommend                       13
record                          7
refuse                          2
relative                        2
reliable                        4
rememb                          2
repair                          4
replac                          3
replace                         2
requir                          3
reset                           2
respond                         6
response                        2
rest                            2
restart                         2
result                          3
return                          13
review                          8
right                           10
rio                             3
rock                            2
roll                            2
room                            8
rope                            2
run                             9
safe                            3
same                            5
samsung                         3
sandisk                         7
sansa                           3
satisfi                         3
sav                             2
save                            2
say                             2
scratch                         3
scratche                        4
screen                          12
screw                           4
sd                              2
second                          5
secure                          2
seem                            12
select                          2
sell                            4
seller                          2
send                            5
sense                           2
sent                            8
service                         17
set                             9
sett                            2
several                         5
shape                           5
shave                           2
shipp                           14
shock                           3
short                           5
show                            8
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          3
since                           7
site                            2
size                            14
slight                          2
slim                            2
slow                            2
small                           23
snack                           3
snug                            2
soft                            2
software                        8
sold                            3
solid                           4
someone                         5
something                       9
sometime                        2
son                             6
song                            16
sony                            5
soon                            2
soooo                           3
sound                           19
south                           2
space                           5
speak                           2
spec                            3
special                         3
spend                           5
spent                           6
spin                            3
sport                           2
st                              2
staff                           2
stand                           5
star                            4
start                           10
stat                            2
stay                            15
stereo                          2
stick                           2
stiff                           3
still                           9
stinky                          2
stop                            2
stopp                           4
stor                            2
storage                         5
store                           7
strap                           2
strong                          2
stuff                           4
stupid                          2
sturdy                          3
such                            8
suck                            5
sudden                          2
sugar                           2
suggest                         2
summ                            2
support                         4
suppos                          2
suprising                       2
sure                            5
switch                          2
system                          5
tak                             2
take                            9
talk                            3
tape                            2
target                          2
tast                            3
taste                           4
tell                            3
tempo                           2
terrible                        8
textbook                        2
th                              25
thank                           6
that                            3
there                           3
therefore                       2
theyre                          2
thin                            2
thing                           5
third                           2
tho                             2
though                          5
three                           8
through                         3
thru                            2
thumb                           2
tight                           3
tighten                         5
time                            37
tiny                            5
tip                             2
title                           2
tivo                            2
today                           4
toilet                          3
ton                             2
too                             12
took                            2
tool                            2
toothbrush                      3
top                             3
toss                            2
total                           5
touch                           2
tough                           2
tourist                         2
toy                             4
track                           2
transf                          2
transfer                        2
trash                           2
travel                          4
tri                             10
try                             7
tun                             5
turn                            7
tv                              4
twice                           4
type                            3
unable                          2
und                             2
unfortunate                     2
unit                            4
unless                          2
until                           9
update                          2
upgrad                          2
upgrade                         2
upload                          2
upset                           2
us                              26
usb                             8
use                             4
useful                          2
useless                         3
utility                         2
value                           6
vendor                          2
version                         4
very                            39
video                           9
vista                           2
volume                          2
wait                            2
walk                            3
walmart                         2
want                            7
wasnt                           3
waste                           2
watch                           4
wear                            2
web                             2
website                         3
week                            14
weight                          5
what                            2
whatsoev                        2
where                           2
while                           11
whole                           4
why                             5
wife                            3
window                          6
wipe                            2
wish                            6
within                          2
without                         7
wonderful                       6
word                            2
work                            17
world                           2
worse                           4
worst                           6
worth                           11
worthless                       2
wrong                           6
xlr                             2
xp                              4
ye                              3
year                            10
yet                             4
you                             5
young                           2
youre                           4
yr                              3
zen                             8
zune                            2
