aaa                             2
able                            3
accurate                        5
adapt                           4
add                             3
adult                           2
advertis                        3
affordable                      3
ago                             3
airport                         2
album                           3
allow                           2
almost                          5
alway                           4
amaz                            8
amazon                          2
anoth                           3
anyone                          6
anywhere                        2
apple                           2
around                          3
arriv                           2
attention                       2
awesome                         2
awsome                          2
baby                            3
bad                             5
ball                            2
band                            5
bar                             6
basi                            2
bass                            2
batterie                        6
battery                         3
be                              3
beautiful                       3
before                          5
bell                            2
best                            9
bett                            12
big                             4
bike                            7
birthday                        2
book                            2
bose                            2
both                            7
bought                          19
brand                           2
built                           2
business                        4
buy                             16
bye                             2
cable                           3
camera                          6
car                             3
card                            2
care                            3
carry                           5
case                            3
cd                              4
certain                         3
cheap                           4
christma                        4
class                           2
clean                           6
clear                           3
clip                            4
close                           2
combination                     2
comfortable                     4
common                          2
compact                         8
company                         2
complaint                       2
complete                        2
comput                          2
condition                       3
control                         2
convenient                      3
cool                            7
cord                            5
cost                            6
cover                           2
creative                        2
cute                            2
cymbal                          3
dad                             2
damage                          2
daught                          6
daughter                        2
day                             2
deal                            5
definate                        3
definite                        2
delhi                           2
delivery                        3
describ                         3
describe                        2
description                     2
device                          5
diap                            2
different                       4
digg                            2
digital                         2
direct                          2
dog                             3
dont                            2
download                        3
drive                           5
drum                            4
durable                         2
dvd                             4
easi                            3
easy                            29
eat                             2
effective                       2
elegant                         2
else                            3
energy                          3
enjoy                           7
enough                          4
equipment                       3
especial                        2
ev                              7
every                           4
everything                      8
everywhere                      3
exact                           2
excellent                       13
except                          2
exercise                        4
expect                          6
extra                           5
extreme                         2
face                            2
fantastic                       4
far                             7
fast                            8
favorite                        3
feature                         7
feel                            2
fell                            2
figur                           2
file                            3
fill                            2
find                            3
fine                            5
fit                             3
fitness                         2
flash                           2
flavor                          4
floor                           3
food                            2
forev                           3
forget                          2
form                            2
found                           4
free                            3
friend                          6
full                            2
fun                             2
gadget                          2
gb                              9
gen                             4
general                         2
gift                            6
girl                            2
glad                            5
go                              4
good                            43
great                           57
guess                           2
guitar                          2
gym                             3
hand                            3
handl                           2
handle                          4
handy                           5
happen                          2
happy                           10
hard                            5
hav                             4
have                            2
headphone                       3
healthy                         2
hear                            2
heard                           4
help                            3
here                            2
high                            2
hold                            7
home                            4
hooah                           3
hope                            3
horse                           3
hotel                           5
house                           2
huge                            2
hungry                          2
hurt                            2
husband                         4
id                              2
im                              3
includ                          2
inexpensive                     2
inside                          2
instruction                     2
instrument                      2
ipod                            24
item                            14
itself                          2
ive                             6
keep                            6
key                             2
kid                             2
kind                            2
know                            3
large                           4
last                            5
learn                           2
least                           2
less                            4
life                            7
light                           4
lightweight                     3
like                            27
line                            2
listen                          7
little                          11
location                        2
long                            6
look                            5
lose                            2
lot                             13
loud                            2
lov                             4
love                            34
low                             4
machine                         4
made                            3
make                            9
man                             2
many                            5
mat                             2
media                           2
memory                          4
met                             2
mic                             5
microphone                      6
might                           2
military                        2
million                         2
model                           2
mom                             2
monitor                         3
month                           6
more                            16
move                            2
movie                           2
mp                              5
much                            11
music                           16
musical                         2
must                            3
nano                            8
ne                              6
near                            3
need                            7
negative                        2
nev                             5
new                             6
nice                            15
nifty                           2
night                           2
no                              17
noise                           2
nokia                           3
not                             47
note                            2
oh                              2
ok                              2
old                             5
once                            4
one                             4
open                            4
opinion                         2
option                          4
order                           4
other                           2
over                            2
own                             6
p                               2
package                         7
pay                             2
pedomet                         2
pen                             2
people                          3
perfect                         9
perform                         2
performance                     3
phone                           8
photo                           2
pic                             2
pick                            2
picture                         7
piece                           3
pillow                          3
pink                            3
place                           2
play                            28
pleas                           6
plenty                          2
pocket                          2
pod                             2
portable                        5
present                         3
pretty                          3
price                           27
print                           3
probab                          2
problem                         8
produc                          2
product                         25
purchas                         5
purchase                        3
purse                           2
put                             3
quality                         16
quick                           4
quite                           3
radio                           9
rate                            2
read                            6
real                            12
reason                          2
receiv                          4
reciev                          5
recommend                       9
record                          4
reliable                        2
requir                          2
result                          3
review                          3
right                           8
rio                             2
rock                            2
roll                            2
room                            6
run                             7
safe                            3
same                            2
sansa                           2
satisfi                         2
say                             2
screen                          5
secure                          2
seem                            8
sent                            2
service                         11
set                             5
several                         2
shape                           5
shave                           2
shipp                           7
show                            6
simple                          3
since                           3
size                            15
sleek                           2
slight                          2
slim                            2
small                           18
snack                           3
snug                            2
soft                            2
software                        3
solid                           4
someone                         3
something                       8
son                             3
song                            7
soooo                           2
sound                           15
south                           2
space                           4
speak                           2
special                         3
spent                           2
staff                           2
stand                           5
star                            3
start                           5
stay                            4
stereo                          2
still                           5
stor                            2
storage                         5
store                           5
strap                           2
strong                          2
stuff                           2
sturdy                          2
such                            4
summ                            2
suppos                          2
sure                            3
system                          5
take                            3
talk                            2
tast                            3
taste                           4
tempo                           2
th                              11
thank                           5
theyre                          2
thin                            2
thing                           5
though                          2
through                         3
tight                           2
time                            15
tiny                            4
ton                             2
too                             6
tool                            2
top                             2
total                           2
tough                           2
track                           2
transf                          3
travel                          4
tri                             3
try                             3
tun                             2
tv                              3
type                            3
unit                            3
until                           2
upgrad                          2
us                              12
usb                             4
use                             3
useful                          2
utility                         2
value                           6
version                         2
very                            18
video                           7
walk                            2
want                            7
watch                           2
wear                            2
week                            2
weight                          3
while                           8
why                             2
wife                            2
window                          2
wish                            2
without                         6
wonderful                       6
work                            8
worth                           2
wrong                           4
xlr                             2
year                            3
yet                             3
you                             2
young                           2
youre                           2
yr                              2
zen                             5
