a               40
aaa             2
able            3
about           12
absolute        2
accurate        6
adapt           4
add             4
adult           2
advertis        3
affordable      3
aft             5
again           3
ago             3
album           4
all             30
allow           2
almost          4
also            13
alway           4
am              17
amaz            9
amazon          6
an              23
and             242
anoth           3
any             13
anyone          3
anywhere        3
apple           3
are             22
arm             3
around          5
arriv           2
at              27
attention       2
average         2
awesome         4
awsome          2
baby            3
back            4
bad             5
ball            2
band            5
bar             4
basi            2
bass            2
batterie        5
battery         15
be              18
beautiful       3
because         4
been            7
before          4
bell            2
best            15
bett            14
big             4
bike            6
birthday        2
blood           4
book            4
bose            2
both            6
bought          21
brand           2
built           2
but             33
buy             23
by              9
bye             2
ca              4
cable           3
came            7
camera          8
can             28
car             3
card            6
care            3
carry           6
case            2
cd              5
cheap           5
christma        7
clean           7
clear           5
clip            5
close           2
color           3
come            8
comfortable     2
compact         7
company         4
complaint       7
complete        2
comput          3
condition       5
control         3
convenient      2
cool            7
cord            5
cost            6
could           7
cover           2
creative        6
cymbal          3
dad             3
damage          2
daught          8
daughter        2
day             4
deal            6
definate        2
delhi           2
delivery        3
describ         3
describe        2
description     2
design          2
device          4
did             6
different       4
digg            2
digital         4
direct          2
do              20
doe             17
dog             3
dont            2
download        3
drive           4
drum            4
dvd             4
earbud          2
easi            4
easy            46
eat             2
effective       2
else            3
energy          5
enjoy           6
enough          4
equipment       2
ev              9
even            8
every           4
everything      8
everywhere      2
exact           4
excellent       16
except          2
exercise        7
expect          8
extra           5
extreme         2
fami            3
fantastic       4
far             9
fast            9
favorite        5
feature         8
feel            10
file            3
fill            2
find            3
fine            6
first           7
fit             4
fitness         2
fix             2
flavor          3
fm              5
food            2
for             129
forev           2
forget          2
form            2
found           2
free            5
friend          9
from            24
full            2
fun             2
future          2
gadget          2
garage          2
gb              8
gen             4
general         2
get             17
gift            9
girl            2
give            3
glad            5
go              11
good            59
got             13
great           127
guess           2
guitar          2
gym             4
h               5
ha              27
had             25
hand            3
handl           2
handle          3
handy           3
happen          2
happy           13
hard            5
hav             4
have            51
he              18
head            2
headphone       3
healthy         2
hear            2
heard           4
help            3
here            3
hi              6
high            11
hold            11
home            4
hope            2
horse           3
hotel           5
how             6
huge            2
hungry          2
hurt            2
husband         4
i               178
id              2
if              15
im              9
in              49
includ          2
inexpensive     2
inside          2
instruction     2
instrument      2
ipod            38
it              289
item            15
itself          2
ive             9
just            14
keep            7
key             2
kid             7
kind            2
know            3
large           3
last            7
learn           2
least           2
less            3
life            10
light           5
lightweight     3
like            36
line            3
listen          10
little          14
location        3
long            5
look            16
lose            2
lot             17
loud            2
lov             5
love            54
low             4
machine         5
made            5
make            11
man             2
many            5
me              19
media           2
memory          5
met             2
mic             5
microphone      8
might           2
million         2
minute          2
model           2
mom             2
money           6
monitor         4
month           5
more            17
most            5
move            2
movie           2
mp              28
much            25
music           24
musical         2
must            2
my              102
nano            11
ne              6
near            4
need            7
negative        2
nev             5
new             6
nice            21
nifty           2
no              24
noise           2
nokia           2
not             61
note            2
now             7
of              70
offer           2
oh              2
ok              2
old             7
on              42
once            2
one             34
open            4
opinion         2
option          4
or              18
order           4
oth             10
other           3
our             6
out             17
ov              5
over            2
own             9
p               2
package         8
pay             2
pedomet         2
pen             2
people          3
perfect         13
performance     2
phone           8
photo           3
pic             2
pick            2
picture         8
piece           3
pillow          3
pink            3
place           4
play            44
pleas           9
plenty          2
plu             2
pocket          2
pod             2
portable        4
present         4
pressure        3
pretty          4
price           32
print           4
probab          4
problem         13
produc          2
product         42
purchas         9
purchase        4
purse           2
put             3
quality         19
quick           3
quite           3
radio           10
rate            2
read            6
real            28
reason          2
receiv          4
reciev          2
recommend       15
record          4
reliable        2
requir          2
result          3
review          3
right           7
rio             3
rock            2
roll            2
room            5
run             10
safe            2
said            2
same            3
sansa           2
satisfi         4
say             9
screen          9
secure          2
see             3
seem            7
sell            2
service         13
set             5
several         2
shape           5
shave           2
she             16
shipp           6
should          3
show            8
simple          4
since           4
size            16
slight          2
small           19
snack           3
snug            2
so              37
soft            2
software        4
solid           4
some            3
someone         4
something       8
son             5
song            11
soooo           2
sound           30
south           2
space           4
speak           2
special         3
spent           2
stand           5
star            3
start           6
stay            4
stereo          2
still           5
stor            2
storage         5
store           6
strap           2
strong          2
stuff           2
such            4
summ            2
suppos          2
sure            3
system          5
take            6
tast            2
taste           3
tempo           2
th              12
than            21
thank           8
that            44
the             254
their           4
them            15
there           10
these           11
they            17
theyre          2
thi             141
thin            2
thing           6
think           10
those           2
though          3
through         4
tight           2
time            16
tiny            3
to              168
ton             2
too             8
tool            3
top             2
total           2
tough           2
track           2
transf          6
travel          4
tri             3
tun             4
tv              4
two             10
type            3
understand      2
unit            6
until           2
up              13
upgrad          2
us              17
usb             3
use             57
useful          3
utility         2
value           8
very            68
video           9
wa              52
walk            2
want            10
way             7
we              13
weight          4
well            19
went            2
were            5
what            16
when            17
which           10
while           8
whistle         2
who             7
why             2
wife            2
will            20
window          2
with            70
without         5
wonderful       5
work            44
worth           6
would           10
wrong           4
xlr             2
year            10
yet             3
you             53
young           2
your            14
yr              2
zen             5
