a               45
able            3
about           10
absolute        2
accurate        5
adapt           4
add             3
advertis        3
affordable      3
aft             5
again           2
ago             3
airport         2
album           4
all             29
almost          5
also            11
alway           3
am              14
amaz            9
amazon          6
an              21
and             243
anoth           4
any             15
anyone          6
anywhere        3
apple           4
are             25
arm             3
around          5
arriv           2
at              26
attention       2
average         2
awesome         4
awsome          2
baby            3
back            4
bad             4
band            5
bar             6
basi            2
bass            2
batterie        3
battery         14
be              17
beautiful       2
because         5
been            8
before          6
bell            2
best            17
bett            14
big             4
bike            6
blood           4
book            4
both            7
bought          21
brand           3
business        3
but             33
buy             25
by              9
bye             2
ca              3
cable           3
came            4
camera          8
can             28
car             2
card            6
care            2
carry           6
case            3
cd              5
certain         3
cheap           4
christma        7
class           2
clean           8
clear           5
clip            5
close           2
color           3
combination     2
come            8
comfortable     4
common          2
compact         9
company         3
complaint       6
complete        2
comput          3
condition       6
control         3
convenient      3
cool            7
cord            4
cost            5
could           7
cover           2
creative        6
cute            2
cymbal          3
dad             3
damage          2
daught          9
daughter        2
day             5
deal            5
definate        3
definite        2
delhi           2
delivery        3
describ         3
describe        2
description     2
design          3
device          5
did             6
different       5
digg            2
digital         4
direct          2
do              21
doe             18
dog             3
dominat         2
dont            2
download        3
drive           5
drum            4
durable         2
dvd             4
earbud          2
easi            4
easy            46
eat             2
else            4
energy          7
enjoy           7
enough          5
equipment       3
especial        2
ev              9
even            6
every           4
everything      7
everywhere      3
exact           4
excellent       11
exercise        8
expect          8
extra           4
extreme         2
face            2
fami            3
fantastic       4
far             6
fast            11
favorite        5
feature         10
feel            9
fell            2
file            3
fill            2
find            2
fine            7
first           7
fit             4
fitness         2
fix             2
flash           2
flavor          4
floor           3
fm              5
food            2
for             121
forev           4
found           3
free            5
friend          8
from            24
full            2
fun             2
future          2
gadget          2
garage          2
gave            2
gb              10
gen             4
general         2
get             16
gift            10
girl            2
give            4
glad            4
go              12
good            61
got             12
great           121
guess           2
guitar          2
gym             3
h               5
ha              30
had             24
hand            3
handl           2
handle          4
handy           5
happy           13
hard            4
hav             3
have            53
he              20
head            2
headphone       4
healthy         2
hear            2
heard           4
help            3
here            3
hi              6
high            10
hold            11
home            2
hooah           3
hope            3
horse           3
hotel           6
house           2
how             4
huge            2
hurt            2
husband         5
i               175
id              2
if              16
im              7
in              52
includ          2
inexpensive     2
inside          2
instruction     3
instrument      2
ipod            38
it              289
item            17
itself          2
ive             8
just            14
keep            7
key             2
kid             6
kind            2
know            4
large           4
last            10
learn           2
less            3
life            9
light           4
lightweight     3
like            31
line            2
listen          10
little          12
location        3
long            6
look            15
lose            2
lot             18
loud            2
lov             5
love            56
low             4
machine         3
made            5
make            10
man             2
many            4
market          3
mat             2
me              18
media           2
memory          4
met             2
mic             6
microphone      8
might           2
military        2
million         2
mine            2
minute          2
model           2
mom             2
money           6
monitor         4
month           5
more            18
most            5
move            2
mp              26
much            23
music           23
musical         2
must            3
my              103
nano            13
ne              7
near            4
need            6
negative        2
nev             6
new             6
nice            20
nifty           2
night           2
no              24
noise           2
nokia           3
not             61
note            2
now             6
of              72
offer           2
oh              2
ok              2
old             7
on              45
once            4
one             35
open            4
opinion         2
option          5
or              14
order           4
oth             9
other           3
our             6
out             16
ov              2
over            2
own             9
p               2
package         8
pay             2
pedomet         2
pen             2
people          3
perfect         14
perform         2
performance     2
phone           6
photo           2
pic             2
pick            2
picture         9
piece           3
pillow          3
pink            3
place           3
play            42
pleas           8
plenty          2
plu             2
pocket          2
pod             2
portable        5
present         3
pressure        3
pretty          5
price           29
print           4
probab          4
problem         12
produc          2
product         41
purchas         9
purchase        4
put             3
quality         21
quick           3
quite           2
radio           10
rate            2
read            6
real            28
reason          2
receiv          5
reciev          5
recommend       13
record          4
reliable        2
requir          2
result          4
review          3
right           7
roll            2
room            4
run             9
safe            3
said            2
same            3
sansa           2
satisfi         2
say             11
screen          9
secure          2
see             4
seem            11
sell            2
service         15
set             5
several         2
shape           6
shave           2
she             16
shipp           6
should          2
show            6
simple          3
since           4
size            19
sleek           2
slight          2
slim            2
small           18
snack           3
snug            2
so              33
soft            2
software        4
solid           4
some            2
someone         4
something       6
son             5
song            11
sound           31
south           2
space           6
speak           2
special         3
staff           2
stand           4
star            3
start           6
stay            3
stereo          2
still           6
stor            2
storage         5
store           6
strap           2
strong          2
stuff           2
such            4
summ            2
sure            3
system          3
take            5
talk            2
tast            3
taste           4
tempo           2
th              8
than            20
thank           9
that            46
the             270
their           3
them            15
there           9
these           13
they            17
theyre          2
thi             138
thin            2
thing           7
think           11
those           2
though          4
thought         2
through         5
tight           2
time            15
tiny            4
to              161
ton             2
too             8
tool            3
top             2
tough           2
track           2
transf          6
travel          4
tri             3
try             3
tun             4
tv              5
two             10
type            2
understand      3
unit            5
up              15
upgrad          2
us              13
usb             4
use             52
useful          3
utility         2
value           7
version         2
very            67
video           9
wa              58
walk            2
want            11
watch           2
way             5
we              13
wear            2
week            2
weight          4
well            20
went            2
were            5
what            15
when            18
which           11
while           9
whistle         2
who             7
why             2
wife            3
will            21
window          2
wish            2
with            66
without         4
wonderful       5
work            45
worth           5
would           11
wrong           4
xlr             2
year            9
yet             3
you             53
young           2
your            11
youre           2
yr              2
zen             5
