a               76
aaa             2
able            4
about           28
absolut         2
absolute        4
accurate        5
actual          3
adapt           7
add             3
advertis        3
affordable      3
afraid          2
aft             36
again           8
ago             7
agree           2
airport         2
album           4
all             62
allow           2
almost          13
alone           2
along           3
alot            2
already         4
also            17
although        3
alway           6
am              21
amaz            9
amazon          17
amazone         2
amount          3
an              46
and             416
anoth           12
answ            2
any             28
anymore         2
anyone          10
anything        9
anywhere        3
apart           2
apple           12
archo           2
are             52
arm             3
around          8
arriv           6
arrive          2
ask             5
at              50
attention       2
audio           2
available       2
average         4
avoid           3
aware           2
away            8
awesome         4
awsome          2
baby            3
back            21
backpack        3
bad             20
band            5
bar             8
basi            2
basical         2
bass            2
batterie        6
battery         30
be              52
beautiful       2
because         14
become          2
been            16
before          12
begin           2
believe         4
bell            2
best            17
bett            30
between         2
beware          2
big             6
bike            6
birthday        2
bit             5
black           4
blood           4
body            5
book            4
boost           2
boston          2
both            11
bought          49
box             3
brake           2
brand           4
break           5
broke           10
broken          4
brought         2
buck            3
bud             3
built           2
burn            2
business        3
but             81
button          7
buy             72
by              21
bye             2
ca              9
cable           4
calendar        2
came            8
camera          11
can             44
canot           2
car             3
card            16
care            2
carry           7
case            4
cash            3
caus            2
cd              7
certain         3
chang           4
charg           3
charge          9
cheap           14
check           4
child           3
christma        11
class           3
clean           10
clear           6
clip            5
close           2
club            3
college         2
color           4
combination     2
come            11
comfortable     4
common          3
compact         9
company         6
compatible      3
complaint       6
complete        6
complicat       2
comput          12
condition       8
conect          4
conector        2
consider        3
contact         3
control         6
convenient      3
cool            7
copy            2
cord            4
correct         2
cost            6
could           24
count           2
couple          4
cov             2
cover           2
crash           5
crashe          3
creative        10
custom          4
cute            4
cuz             2
cymbal          3
dad             4
dai             2
damag           2
damage          3
daught          11
daughter        2
day             20
dead            5
deal            6
defective       4
definate        3
definite        4
delhi           2
deliv           2
deliver         3
delivery        3
dent            3
describ         4
describe        2
description     2
deserve         2
design          6
develop         2
device          16
di              11
did             30
didnt           2
die             2
different       7
difficult       3
digg            2
digital         5
direct          2
direction       2
dirty           2
disappoint      7
disc            2
disk            2
display         5
do              70
doe             41
doesnt          6
dog             5
dollar          2
dominat         2
dont            10
down            5
download        11
drain           3
drink           5
drive           11
dropp           2
drum            4
dur             2
durable         3
dvd             8
ear             4
earbud          2
easi            5
easy            50
eat             3
effect          3
effort          2
elliptical      2
else            6
email           5
end             2
energy          9
enjoy           8
enough          10
entire          2
equipment       4
especial        2
etc             2
ev              23
even            24
eventual        2
everthing       2
every           13
everything      10
everywhere      5
exact           4
excellent       11
except          2
exercis         2
exercise        11
expect          11
expensive       6
experience      4
extra           5
extreme         2
face            2
fail            6
fall            3
fami            4
fantastic       4
far             10
fast            13
fat             3
fault           2
favorite        6
feature         13
feedback        2
feel            12
fell            3
few             5
figure          4
file            7
fill            3
final           2
find            5
fine            13
first           22
fit             7
fitness         2
five            2
fix             2
flash           6
flashlight      2
flavor          4
floor           4
fm              11
food            2
fool            2
for             222
force           3
forev           6
format          2
found           6
four            2
fragile         2
free            8
freeze          5
friend          11
from            62
froze           5
frustrat        2
full            4
fun             2
functionality   2
fundamental     2
future          2
gadget          2
garage          2
gave            5
gb              19
gen             4
general         3
get             49
gett            5
gift            14
girl            2
give            12
glad            4
go              26
good            77
got             27
gotten          3
great           129
green           2
guess           3
guitar          7
gym             3
h               5
ha              47
had             44
half            4
hand            6
handl           2
handle          4
handy           5
hang            2
happen          4
happy           18
hard            16
hate            2
hav             3
have            97
he              22
head            4
headphone       11
healthy         2
hear            3
heard           6
heavy           3
help            4
helpful         2
here            5
hi              8
high            12
hold            16
home            3
hooah           3
hope            4
horrible        4
horse           3
hotel           13
hour            11
house           2
how             13
howev           4
hr              2
huge            2
hurt            2
husband         6
hype            2
i               276
id              3
idea            2
if              39
im              12
impossible      2
in              108
inaccurate      3
includ          4
inexpensive     2
inferior        4
info            2
information     2
inside          3
install         3
instead         4
instruction     7
instrument      2
interface       2
into            6
invest          2
ipod            64
iriv            2
isnt            2
issue           2
it              581
item            48
itself          4
ive             22
jump            4
junk            11
just            42
kazoo           2
keep            8
kept            2
key             3
kid             10
kind            3
know            13
l               2
laptop          2
large           6
last            19
lat             4
late            3
lcd             3
learn           3
least           2
less            5
let             3
level           2
lexar           2
life            14
light           10
lightweight     3
like            48
line            3
list            3
listen          11
little          18
load            7
location        4
lock            3
long            9
look            25
loose           4
lose            2
lost            3
lot             23
loud            2
lov             6
love            58
low             5
machine         6
made            13
major           2
mak             2
make            16
man             2
manual          3
manufactur      2
many            7
market          4
mat             2
matt            5
max             2
may             3
maybe           4
mb              4
me              37
mean            3
measurement     2
media           4
meditation      2
memory          10
mention         2
menu            2
mess            2
met             2
mic             6
microphone      8
microsoft       3
might           5
military        2
million         2
mine            7
minute          10
miss            3
mode            2
model           8
mom             2
money           26
monitor         5
monst           2
month           29
more            48
most            6
mouse           2
move            2
movie           2
mp              48
much            32
multiple        4
music           35
musical         2
must            3
my              146
nano            16
navigation      2
ne              8
near            4
neck            2
need            9
negative        3
neith           2
nev             21
new             15
next            4
nice            25
nifty           2
night           2
no              51
noise           2
nokia           3
nor             4
not             240
note            2
notebook        2
nothing         8
notice          2
now             21
o               2
octob           2
of              169
off             10
offer           3
often           2
oh              2
ok              4
old             12
omron           2
on              120
once            9
one             76
onto            4
open            6
operate         3
opinion         2
option          6
or              25
ord             7
order           9
oregon          3
oth             16
other           4
otherwise       2
our             7
out             41
ov              10
over            3
overall         3
own             11
p               3
package         9
page            4
paid            3
pain            2
pair            2
palm            2
pap             3
pay             11
pedomet         4
pedometer       2
pen             2
people          6
perfect         15
perform         3
performance     2
perhap          2
philip          2
phone           8
photo           4
pic             3
pick            6
picture         10
piece           9
pillow          3
pink            3
place           8
play            87
player          4
pleas           8
please          2
plenty          2
plu             3
pocket          2
pod             2
point           2
pool            2
poor            4
portable        7
pound           3
pow             3
present         5
pressure        3
pretty          10
previou         2
pric            4
price           40
print           4
probab          4
problem         25
produc          2
product         90
promis          5
prone           2
proprietary     2
provide         2
purchas         18
purchase        6
put             5
quality         35
quick           5
quit            2
quite           6
radio           15
random          2
range           2
rate            4
rca             2
read            9
real            37
reason          5
reasonable      2
receipt         2
receiv          13
recent          2
recharge        2
reciev          6
recogniz        2
recomend        3
recommend       23
record          7
refund          6
refuse          2
regret          2
relative        2
reliable        4
rememb          2
rep             2
repair          4
replac          3
requir          4
reset           3
respond         5
response        2
restart         2
result          5
return          20
review          8
right           10
rio             2
roll            2
room            6
rope            2
run             11
safe            3
said            5
sale            2
same            11
samsung         3
sandisk         7
sansa           3
satisfi         3
sav             2
save            2
saw             3
say             17
scientific      2
scratch         3
scratche        3
screen          19
screw           5
sd              3
second          5
secure          2
see             5
seem            17
seen            4
select          2
sell            6
send            6
sent            6
service         23
set             9
sett            2
several         7
shape           6
shave           2
she             16
shipp           16
shock           3
short           6
should          9
show            7
shuffle         2
shutt           2
sign            2
simp            2
simple          3
since           8
site            2
size            20
sleek           3
slight          2
slim            2
slow            2
small           24
snack           3
snug            2
so              53
soft            2
software        12
sold            3
solid           4
some            10
someone         7
something       8
sometime        3
son             8
song            23
sony            6
soon            2
soooo           2
sound           36
south           2
space           7
speak           2
spec            3
special         3
spend           6
spent           5
spin            3
sport           2
st              2
staff           3
stand           4
star            6
start           13
stat            2
stay            15
stereo          2
stick           2
stiff           3
still           16
stink           2
stinky          2
stop            6
stopp           6
stor            2
storage         5
store           8
strap           2
string          3
strong          2
stuff           3
stupid          2
sturdy          3
such            8
suck            6
sudden          2
sugar           2
suggest         4
summ            2
support         4
suprising       2
sure            5
switch          2
system          5
tak             2
take            14
talk            4
tape            2
target          2
tast            3
taste           5
tell            3
tempo           2
terrible        5
textbook        2
th              27
than            30
thank           13
that            89
the             506
their           6
them            27
then            15
there           26
therefore       2
these           21
they            43
theyre          3
thi             300
thin            3
thing           7
think           17
third           2
tho             2
those           6
though          7
thought         3
three           9
through         5
thru            2
thumb           2
tight           3
tighten         4
time            46
tiny            5
tip             2
title           2
tivo            2
to              311
today           4
toilet          3
ton             3
too             24
took            4
tool            3
toothbrush      3
top             3
toss            2
total           3
touch           2
tough           2
tourist         2
toy             3
track           3
transf          8
transfer        2
trash           2
travel          4
tri             11
try             7
tun             8
turn            10
tv              6
twice           2
two             23
type            3
unable          2
und             2
understand      3
unfortunate     2
unit            10
unless          2
until           9
up              36
upgrad          2
upgrade         3
upload          2
upset           2
us              27
usb             12
use             78
useful          3
useless         4
utility         2
value           7
vendor          2
version         4
very            104
video           13
wa              121
wait            2
walk            3
walmart         2
want            19
wasnt           2
waste           14
watch           3
way             13
we              20
wear            3
web             2
website         3
week            17
weight          7
well            28
went            5
were            14
what            31
whatsoev        2
when            36
where           2
which           15
while           14
whistle         2
who             12
whole           4
why             6
wife            4
will            40
window          8
wipe            2
wish            6
with            109
within          8
without         4
wo              10
wonderful       5
word            2
work            96
world           2
worse           3
worst           8
worth           15
worthless       2
would           47
wrong           6
xlr             2
xp              5
yahoo           3
ye              3
year            25
yet             3
you             105
young           3
your            24
youre           4
yr              3
zen             8
zune            2
