</stop>                         540
aaa                             3
able                            5
absolut                         2
absolute                        2
accurate                        5
actual                          4
adapt                           6
add                             4
addition                        2
adult                           2
affordable                      3
afraid                          2
again                           3
ago                             5
agree                           3
album                           4
allow                           2
almost                          11
alone                           2
along                           3
already                         5
although                        3
alway                           7
amaz                            9
amazo                           2
amazon                          7
amount                          3
amp                             2
anoth                           8
answ                            2
anymore                         2
anyone                          10
anything                        9
anywhere                        3
apart                           2
apple                           7
arm                             2
around                          7
arriv                           6
arrive                          2
ask                             4
attention                       2
audio                           2
average                         2
avoid                           3
aware                           2
away                            4
awesome                         2
awsome                          2
backpack                        3
bad                             16
ball                            2
band                            4
bar                             8
basi                            2
basical                         2
batterie                        9
battery                         13
be                              6
beautiful                       3
become                          2
before                          11
begin                           2
believe                         2
bell                            2
best                            11
bett                            25
between                         2
beware                          2
big                             3
bike                            7
biofeedback                     2
birthday                        3
bit                             3
black                           5
body                            3
boost                           2
bose                            2
boston                          2
both                            9
bought                          38
box                             5
brand                           5
break                           6
broke                           10
broken                          4
brought                         2
buck                            2
bud                             2
built                           2
business                        4
button                          7
buy                             38
bye                             2
cable                           4
camera                          10
car                             4
card                            13
care                            3
carry                           7
case                            4
cash                            3
caus                            2
cd                              6
cent                            2
certain                         3
chang                           3
charg                           3
charge                          9
cheap                           15
check                           4
child                           3
children                        2
christma                        6
class                           3
clean                           8
clear                           6
clip                            4
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     4
common                          2
compact                         7
company                         5
compatible                      3
complaint                       4
complete                        7
complicat                       2
comput                          9
condition                       6
conect                          3
conector                        2
consider                        2
constant                        2
contact                         3
control                         6
convenient                      3
cool                            5
copy                            2
cord                            5
correct                         3
cost                            9
couple                          4
cov                             2
cover                           2
crash                           5
crashe                          3
creative                        5
cute                            3
cuz                             2
cymbal                          2
dad                             4
damage                          2
daught                          7
daughter                        2
day                             11
dead                            5
deal                            7
defective                       4
definate                        3
definite                        2
deliv                           2
deliver                         2
delivery                        2
dent                            3
describ                         3
describe                        2
deserve                         2
design                          3
device                          10
di                              8
diap                            2
didnt                           3
different                       8
difficult                       2
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      6
disk                            2
display                         5
do                              3
doesnt                          5
dog                             5
dollar                          2
dont                            5
down                            4
download                        9
drain                           3
drink                           5
driv                            2
drive                           10
dropp                           2
drum                            4
dur                             2
durable                         3
dvd                             9
easi                            6
easy                            36
eat                             2
effect                          3
effective                       2
elegant                         2
elliptical                      2
else                            7
email                           3
end                             3
energy                          3
enjoy                           6
enough                          7
entire                          2
equipment                       2
especial                        2
ev                              21
eventual                        2
everthing                       2
every                           6
everything                      10
everywhere                      4
exact                           2
excellent                       12
except                          2
exercis                         2
exercise                        10
expect                          7
expensive                       6
experienc                       2
experience                      4
extra                           6
extreme                         2
face                            2
fail                            6
fantastic                       4
far                             13
fast                            6
fat                             2
fault                           2
favorite                        4
feature                         11
feedback                        2
feel                            4
few                             3
figur                           2
figure                          3
file                            7
fill                            2
final                           2
find                            6
fine                            9
fit                             6
fitness                         2
five                            2
flavor                          2
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           5
forget                          2
form                            3
format                          2
found                           11
four                            2
fragile                         2
free                            6
freeze                          3
friend                          11
froze                           4
full                            4
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              14
gen                             4
general                         2
gett                            6
gift                            9
girl                            2
glad                            3
go                              11
good                            52
gotten                          2
great                           61
green                           2
guess                           4
guest                           2
guitar                          7
guy                             2
gym                             3
half                            4
hand                            5
handl                           2
handle                          4
handy                           5
happen                          5
happy                           13
hard                            12
hardware                        2
hav                             3
have                            2
headphone                       9
hear                            2
heard                           4
heavy                           3
help                            4
here                            5
high                            5
hold                            8
home                            4
hooah                           3
hope                            2
horrible                        4
horse                           3
hotel                           10
hour                            11
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         4
hype                            2
id                              3
idea                            3
ill                             2
im                              9
impossible                      2
inaccurate                      3
includ                          3
inferior                        3
info                            2
information                     2
inside                          3
install                         3
instead                         4
instruction                     5
instrument                      2
invest                          2
ipod                            39
iriv                            2
isnt                            2
issue                           2
item                            32
itself                          4
ive                             16
junk                            7
kazoo                           2
keep                            6
kept                            2
kid                             5
kind                            3
know                            15
l                               2
lack                            2
laptop                          2
large                           6
last                            13
lat                             3
late                            3
lcd                             2
learn                           3
least                           3
less                            6
let                             3
level                           2
lexar                           2
life                            10
light                           8
lightweight                     3
like                            35
line                            4
list                            3
listen                          6
little                          15
load                            3
location                        4
lock                            3
long                            10
look                            5
loose                           4
lose                            2
lost                            2
lot                             20
loud                            2
lov                             5
love                            36
m                               2
machine                         8
made                            12
major                           2
mak                             2
make                            15
man                             2
manual                          2
manufactur                      2
many                            9
market                          2
mat                             2
matt                            4
max                             2
may                             3
maybe                           4
mb                              3
mean                            2
measurement                     2
media                           4
meditation                      2
memory                          8
mention                         2
mess                            2
met                             4
mic                             5
microphone                      5
microsoft                       3
might                           5
military                        2
million                         2
minute                          8
miss                            2
model                           7
mom                             2
money                           16
monitor                         5
monst                           2
month                           18
more                            34
mouse                           2
move                            2
movie                           2
mp                              13
much                            15
multiple                        2
music                           25
musical                         2
must                            2
myself                          2
nano                            9
ne                              8
near                            2
neck                            2
need                            11
negative                        3
nev                             15
new                             13
next                            4
nice                            16
nifty                           2
night                           3
no                              29
nor                             4
not                             131
notebook                        2
nothing                         6
notice                          2
o                               2
octob                           2
off                             8
offer                           2
often                           2
oh                              2
ok                              4
old                             12
omron                           2
once                            6
one                             4
onto                            4
open                            3
operate                         2
option                          6
ord                             8
order                           6
other                           2
otherwise                       2
over                            2
overall                         3
overpric                        2
own                             6
p                               4
package                         7
page                            4
paid                            2
pain                            3
pair                            2
palm                            2
pap                             3
pay                             9
pedomet                         2
pen                             2
people                          7
perfect                         9
perform                         3
performance                     2
perhap                          2
personal                        2
philip                          2
phone                           9
photo                           5
pic                             2
pick                            5
picture                         8
piece                           5
pillow                          4
pink                            3
place                           7
plastic                         2
play                            51
player                          2
pleas                           5
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
pool                            2
poor                            4
pop                             2
port                            2
portable                        7
pound                           2
pow                             2
present                         5
pretty                          7
previou                         2
pric                            3
price                           31
print                           3
probab                          4
problem                         19
product                         64
prone                           2
proper                          3
provide                         2
purchas                         9
purchase                        5
purse                           2
put                             5
quality                         22
quick                           7
quite                           6
radio                           11
range                           2
rate                            4
rath                            2
read                            8
real                            24
reason                          5
receipt                         2
receiv                          9
recharge                        2
reciev                          7
recogniz                        2
recommend                       11
record                          6
refuse                          2
reliable                        3
rememb                          2
repair                          4
replac                          2
replace                         2
requir                          4
reset                           3
respond                         6
response                        2
result                          4
return                          14
review                          8
right                           11
rio                             5
rock                            2
roll                            2
room                            7
rope                            2
run                             9
same                            7
samsung                         3
sandisk                         7
sansa                           3
satisfi                         4
save                            2
say                             2
scientific                      2
scratche                        4
screen                          11
screw                           4
sd                              3
second                          6
secure                          2
seem                            13
select                          2
sell                            2
send                            6
sense                           2
sent                            7
service                         20
set                             6
sett                            2
several                         6
shape                           5
shave                           2
shipp                           12
shock                           2
short                           6
show                            10
shutt                           2
sign                            2
simp                            2
simple                          4
since                           8
site                            2
size                            13
slight                          2
slim                            2
slow                            2
small                           25
snack                           2
software                        10
sold                            3
solid                           4
someone                         4
something                       9
sometime                        3
son                             7
song                            18
sony                            5
soon                            2
soooo                           3
sound                           17
south                           2
space                           5
speak                           2
spec                            2
special                         3
spend                           5
spent                           6
spin                            3
sport                           2
st                              2
staff                           3
stand                           5
star                            6
start                           12
stat                            2
stay                            14
stereo                          2
stick                           2
stiff                           3
still                           11
stinky                          2
stop                            3
stopp                           4
stor                            2
storage                         5
store                           8
strap                           2
strong                          2
stuff                           3
stupid                          2
sturdy                          4
such                            9
suck                            5
sudden                          2
suggest                         2
summ                            2
support                         3
suprising                       2
sure                            6
switch                          2
system                          5
tak                             2
take                            10
talk                            4
tape                            2
target                          2
tast                            3
taste                           4
tell                            4
tempo                           2
terrible                        8
textbook                        2
th                              24
thank                           5
that                            3
there                           2
therefore                       2
thin                            3
thing                           4
third                           3
tho                             2
though                          7
three                           8
through                         5
thru                            2
tight                           3
tighten                         5
time                            36
tiny                            4
tip                             2
title                           2
tivo                            2
today                           4
toilet                          2
ton                             3
too                             11
took                            2
tool                            3
toothbrush                      3
top                             3
total                           5
touch                           2
tough                           2
tourist                         2
toy                             4
track                           2
transf                          4
transfer                        2
trash                           2
travel                          3
tri                             10
try                             7
tun                             5
turn                            8
tv                              4
twice                           4
type                            4
unable                          2
und                             2
unfortunate                     2
unit                            7
unless                          3
until                           9
update                          2
upgrad                          2
upgrade                         3
upload                          2
upset                           2
us                              23
usb                             10
use                             4
useful                          3
useless                         4
utility                         2
value                           6
vendor                          2
version                         3
very                            36
video                           12
vista                           2
volume                          2
walk                            3
want                            7
wasnt                           2
waste                           3
watch                           3
wear                            4
web                             2
website                         4
week                            14
weight                          6
what                            2
whatsoev                        2
where                           2
while                           13
whole                           2
why                             6
wife                            3
window                          6
wipe                            2
wish                            4
within                          2
without                         5
wonderful                       5
word                            2
work                            16
world                           2
worse                           2
worst                           5
worth                           12
worthless                       2
wrong                           5
xlr                             2
xp                              5
ye                              3
year                            9
yet                             4
you                             4
young                           2
youre                           3
zen                             8
zune                            2
