aaa                             2
able                            3
accurate                        5
adapt                           4
add                             4
adult                           2
affordable                      3
ago                             3
album                           4
allow                           2
almost                          5
alway                           4
amaz                            9
amazon                          4
anyone                          6
anywhere                        3
apple                           2
arm                             2
around                          4
arriv                           2
attention                       2
awesome                         2
awsome                          2
bad                             4
ball                            2
band                            3
bar                             6
basi                            2
batterie                        6
battery                         3
be                              3
beautiful                       3
before                          5
bell                            2
best                            11
bett                            14
bike                            7
birthday                        2
bose                            2
both                            5
bought                          18
brand                           3
built                           2
business                        4
buy                             15
bye                             2
cable                           3
camera                          7
car                             3
card                            4
care                            3
carry                           6
case                            3
cd                              4
certain                         3
cheap                           5
christma                        2
class                           2
clean                           6
clear                           4
clip                            4
close                           2
combination                     2
comfortable                     3
common                          2
compact                         7
company                         2
complaint                       4
complete                        2
comput                          2
condition                       4
control                         3
convenient                      3
cool                            5
cord                            5
cost                            6
cover                           2
creative                        2
cymbal                          2
dad                             3
daught                          6
daughter                        2
day                             2
deal                            6
definate                        3
definite                        2
delivery                        2
describ                         2
describe                        2
device                          5
diap                            2
different                       5
digg                            2
digital                         3
direct                          2
dog                             3
dont                            2
download                        3
drive                           5
drum                            4
durable                         2
dvd                             3
easi                            4
easy                            32
effective                       2
elegant                         2
else                            4
energy                          3
enjoy                           5
enough                          3
equipment                       3
especial                        2
ev                              8
every                           4
everything                      7
everywhere                      2
exact                           2
excellent                       12
exercise                        5
expect                          3
extra                           5
extreme                         2
face                            2
fantastic                       4
far                             9
fast                            5
favorite                        3
feature                         8
feel                            2
fell                            2
figur                           2
file                            3
fill                            2
find                            3
fine                            4
fit                             3
fitness                         2
flash                           2
flavor                          2
floor                           3
food                            2
forev                           3
forget                          2
form                            2
found                           4
free                            3
friend                          9
full                            2
fun                             2
gadget                          2
gb                              10
gen                             4
general                         2
gift                            6
girl                            2
glad                            3
go                              5
good                            45
great                           60
guess                           2
guitar                          2
gym                             3
hand                            2
handl                           2
handle                          4
handy                           5
happen                          2
happy                           10
hard                            5
hav                             3
have                            2
headphone                       4
heard                           3
help                            3
here                            3
high                            3
hold                            7
home                            3
hooah                           3
hope                            2
horse                           3
hotel                           5
house                           2
huge                            2
hungry                          2
hurt                            2
husband                         3
id                              2
im                              5
inside                          2
instruction                     3
instrument                      2
ipod                            22
item                            11
itself                          2
ive                             5
keep                            5
kid                             2
kind                            2
know                            4
large                           4
last                            8
learn                           2
least                           2
less                            4
life                            6
light                           4
lightweight                     3
like                            26
line                            3
listen                          5
little                          9
location                        3
long                            6
look                            3
lose                            2
lot                             14
loud                            2
lov                             4
love                            35
low                             2
machine                         5
made                            5
make                            9
man                             2
many                            5
mat                             2
media                           2
memory                          5
met                             2
mic                             5
microphone                      5
might                           2
military                        2
million                         2
model                           2
mom                             2
money                           3
monitor                         3
month                           6
more                            18
move                            2
mp                              6
much                            14
music                           17
musical                         2
must                            2
nano                            8
ne                              7
near                            2
need                            9
negative                        2
nev                             5
new                             5
nice                            13
nifty                           2
night                           2
no                              12
not                             45
oh                              2
ok                              2
old                             6
once                            3
one                             3
option                          5
order                           3
other                           2
own                             3
p                               3
package                         6
pay                             2
pedomet                         3
pen                             2
people                          3
perfect                         7
perform                         2
performance                     2
phone                           7
photo                           3
picture                         9
piece                           3
pillow                          3
pink                            3
place                           2
play                            26
pleas                           5
plenty                          2
pocket                          2
pod                             2
portable                        5
present                         3
pretty                          3
price                           27
print                           3
probab                          4
problem                         8
product                         29
purchas                         3
purchase                        4
purse                           2
put                             3
quality                         13
quick                           4
quite                           3
radio                           9
rate                            2
read                            6
real                            14
reason                          2
receiv                          5
reciev                          5
recommend                       9
record                          3
requir                          2
result                          3
review                          3
right                           8
rio                             3
rock                            2
roll                            2
room                            5
run                             7
same                            3
sansa                           2
satisfi                         3
say                             2
screen                          5
secure                          2
seem                            8
sent                            2
service                         11
set                             2
several                         2
shape                           5
shave                           2
shipp                           7
show                            8
simple                          4
since                           4
size                            14
sleek                           2
slight                          2
slim                            2
small                           19
snack                           2
software                        4
solid                           4
someone                         4
something                       7
son                             4
song                            9
soooo                           2
sound                           14
south                           2
space                           5
speak                           2
special                         3
spent                           2
staff                           2
stand                           5
star                            3
start                           5
stay                            3
stereo                          2
still                           6
stor                            2
storage                         5
store                           6
strap                           2
strong                          2
stuff                           2
sturdy                          2
such                            4
summ                            2
sure                            4
system                          5
take                            3
talk                            2
tast                            3
taste                           3
tempo                           2
th                              11
thank                           4
thin                            2
thing                           4
though                          3
through                         5
tight                           2
time                            11
tiny                            3
ton                             2
too                             3
tool                            3
top                             2
total                           2
tough                           2
track                           2
transf                          5
travel                          3
tri                             3
try                             3
tun                             2
tv                              3
type                            3
unit                            3
until                           2
up                              2
upgrad                          2
us                              11
usb                             4
use                             3
useful                          3
utility                         2
value                           6
version                         2
very                            18
video                           8
walk                            2
want                            7
watch                           2
wear                            2
week                            2
weight                          3
while                           9
why                             2
wife                            2
window                          2
wish                            2
without                         4
wonderful                       5
work                            7
worth                           2
wrong                           4
xlr                             2
year                            2
yet                             3
you                             2
zen                             5
