aaa             2
able            3
absolute        2
accurate        7
add             4
adult           2
advertis        2
affordable      3
again           3
ago             2
airport         2
album           3
allow           2
almost          4
alway           3
amaz            8
amazon          6
anoth           3
anyone          5
anywhere        3
apple           3
arm             3
around          6
arriv           2
attention       2
average         2
awesome         5
awsome          2
baby            3
bad             4
ball            2
band            4
bar             5
basi            2
bass            2
batterie        6
battery         16
be              2
beautiful       3
before          5
best            15
bett            12
big             4
bike            4
birthday        2
blood           5
book            3
both            7
bought          19
brand           3
built           2
business        4
buy             22
bye             2
ca              4
cable           3
camera          8
car             3
card            6
care            3
carry           6
case            3
cd              4
certain         3
cheap           5
christma        7
class           2
clean           6
clear           5
clip            4
close           2
color           3
combination     2
comfortable     4
common          2
compact         8
company         4
complaint       3
complaints      3
complete        2
comput          2
condition       5
control         3
convenient      3
cool            7
cord            5
cost            6
creative        4
cute            2
cymbal          2
dad             2
daught          9
daughter        2
deal            6
definate        3
definite        2
delhi           2
delivery        2
describ         3
describe        2
design          3
device          5
diap            2
different       5
digg            2
digital         4
direct          2
dog             3
dont            2
drive           4
durable         2
dvd             3
easi            4
easy            47
eat             2
effective       2
elegant         2
else            4
energy          5
enjoy           7
enough          5
equipment       3
especial        2
ev              6
every           4
everything      7
everywhere      2
exact           4
excellent       14
except          2
exercise        8
expect          5
expected        2
extra           5
extreme         2
face            2
fami            3
fantastic       3
far             9
fast            10
favorite        5
feature         9
feel            9
figur           2
file            3
fill            2
find            3
fine            6
fit             4
fitness         2
flash           2
flavor          4
floor           3
fm              5
food            2
forev           3
form            2
found           3
free            5
friend          9
full            2
gadget          2
gb              10
gen             4
gift            9
girl            2
glad            5
go              4
good            60
great           132
guitar          2
gym             4
hand            3
handl           2
handle          4
handy           5
happy           15
hard            3
hav             4
have            2
headphone       3
healthy         2
hear            2
heard           2
help            3
here            3
high            11
hold            10
home            4
hooah           3
hope            3
horse           3
hotel           6
house           2
hungry          2
hurt            2
husband         5
id              2
im              9
includ          2
instruction     3
instrument      2
ipod            41
it              32
item            14
itself          2
ive             9
keep            7
key             2
kid             5
kind            2
know            4
large           4
last            9
learn           2
least           2
less            4
life            11
light           4
lightweight     3
like            35
line            3
listen          9
little          12
location        3
long            7
look            5
lose            2
lot             19
loud            2
lov             5
love            54
low             4
machine         5
made            4
make            12
many            4
market          2
mat             2
me              3
media           2
memory          5
met             2
mic             7
microphone      8
might           2
military        2
million         2
model           2
mom             2
money           7
monitor         5
month           5
more            15
movie           2
mp              26
much            25
music           23
musical         2
must            3
nano            12
ne              7
near            3
need            7
negative        2
nev             6
new             6
nice            20
nifty           2
no              24
noise           2
nokia           3
not             55
note            2
old             5
once            4
one             4
open            4
opinion         2
option          4
order           4
other           2
out             2
over            2
own             8
p               3
package         6
pay             2
pedomet         3
people          3
perfect         12
perfectly       4
perform         2
performance     3
phone           6
photo           3
pic             2
picture         8
piece           3
pillow          3
pink            3
place           2
play            39
player          4
pleas           9
plenty          2
pod             2
portable        5
present         4
pressure        4
pretty          5
price           31
print           3
probab          5
problem         12
produc          2
product         41
purchas         9
purchase        4
purse           2
put             2
quality         21
quick           4
quite           3
radio           10
rate            2
read            4
real            28
reason          2
receiv          4
reciev          5
recommend       15
record          4
reliable        2
result          3
review          2
right           7
rio             3
roll            2
room            6
run             8
runing          2
safe            3
same            3
sansa           2
satisfi         3
say             2
screen          9
secure          2
seem            10
sent            2
service         15
set             4
several         2
shape           6
shave           2
shipp           7
show            6
simple          3
since           4
size            19
sleek           2
slight          2
slim            2
small           16
snack           2
snug            2
soft            2
software        3
solid           4
someone         3
something       7
son             5
song            8
soooo           2
sound           33
south           2
space           6
speak           2
special         2
spent           2
staff           2
stand           5
star            3
start           4
stay            4
stereo          2
still           5
stor            2
storage         3
store           6
strong          2
sturdy          2
such            4
summ            2
suppos          2
sure            3
system          5
take            6
talk            2
tast            2
taste           4
tempo           2
th              12
thank           7
thanks          3
theyre          2
thing           5
though          4
through         5
tight           2
time            16
tiny            4
ton             2
too             8
tool            3
total           2
track           2
transf          6
travel          4
tri             3
try             3
tun             3
tv              4
type            3
understand      2
unit            4
until           2
up              3
upgrad          2
us              14
usb             4
use             8
useful          3
value           8
version         2
very            67
video           9
want            7
watch           2
wear            2
week            2
weight          4
well            2
while           9
why             2
wife            3
window          2
wish            2
without         6
wonderful       4
work            8
worth           6
wrong           2
xlr             2
year            3
yet             3
you             5
young           2
youre           2
yr              2
zen             3
