</stop>                         540
aaa                             3
able                            5
absolut                         2
absolute                        2
accurate                        5
actual                          4
adapt                           3
add                             4
addition                        2
address                         2
adult                           2
advertis                        2
affordable                      3
afraid                          2
again                           5
ago                             5
agree                           3
airport                         2
album                           3
allow                           3
almost                          10
alone                           2
along                           2
alot                            2
already                         4
although                        2
alway                           6
amaz                            8
amazo                           2
amazon                          8
amazone                         2
amount                          3
amp                             2
anoth                           10
answ                            2
anymore                         2
anyone                          9
anything                        10
anywhere                        3
apart                           2
apple                           8
archo                           2
around                          6
arriv                           6
arrive                          2
ask                             4
attention                       2
audio                           2
available                       2
average                         2
avoid                           3
aware                           2
away                            6
awesome                         2
awsome                          2
baby                            3
backpack                        3
bad                             16
ball                            2
band                            5
bar                             7
basi                            2
basical                         2
bass                            2
batterie                        8
battery                         11
be                              4
beautiful                       3
become                          2
before                          11
begin                           2
believe                         2
bell                            2
best                            13
bett                            23
between                         2
beware                          2
big                             6
bike                            4
biofeedback                     2
birthday                        3
bit                             4
black                           5
body                            2
boost                           2
bose                            2
boston                          2
both                            11
bought                          34
box                             5
brand                           4
break                           6
broke                           10
broken                          5
brought                         2
buck                            2
bud                             2
built                           3
business                        4
button                          7
buy                             42
bye                             2
cable                           4
calendar                        2
camera                          8
car                             4
card                            12
care                            3
carry                           7
case                            4
cash                            2
caus                            2
cd                              6
cent                            2
certain                         3
chang                           4
charg                           3
charge                          9
cheap                           16
check                           4
child                           3
children                        2
christma                        7
city                            2
class                           3
clean                           8
clear                           7
clip                            4
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     5
common                          3
compact                         6
company                         5
compatible                      3
complaint                       3
complete                        7
complicat                       2
comput                          11
condition                       3
conect                          3
conector                        2
consider                        3
constant                        2
contact                         4
control                         6
convenient                      3
cool                            7
copy                            2
cord                            5
correct                         3
cost                            9
count                           2
couple                          3
cov                             2
cover                           2
crash                           3
crashe                          2
creative                        5
cute                            4
cuz                             2
cymbal                          2
dad                             3
dai                             2
damag                           2
damage                          2
data                            2
daught                          9
daughter                        2
day                             11
dead                            5
deal                            7
defective                       3
definate                        3
definite                        2
delhi                           2
deliv                           2
deliver                         2
delivery                        2
dent                            3
describ                         4
describe                        2
deserve                         2
design                          4
develop                         2
device                          11
di                              5
diap                            2
didnt                           3
die                             2
different                       8
difficult                       3
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      5
disc                            2
disk                            2
display                         5
do                              4
doesnt                          5
dog                             4
dollar                          2
dont                            3
down                            2
download                        8
drain                           3
drink                           5
driv                            2
drive                           10
dropp                           2
drum                            4
durable                         3
dvd                             10
ear                             2
easi                            6
easy                            31
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            7
email                           4
end                             3
energy                          2
enjoy                           8
enough                          8
entire                          2
equipment                       2
especial                        2
etc                             2
ev                              18
eventual                        2
everthing                       2
every                           8
everything                      10
everywhere                      4
exact                           2
excellent                       14
except                          3
exercis                         2
exercise                        11
expect                          8
expensive                       5
experienc                       2
experience                      4
extra                           6
extreme                         2
face                            2
fail                            4
fantastic                       3
far                             13
fast                            8
fat                             3
fault                           3
favorite                        4
feature                         10
feedback                        2
feel                            6
few                             5
figur                           2
figure                          4
file                            8
fill                            2
final                           3
find                            6
fine                            9
fit                             6
fitness                         2
five                            2
flash                           3
flashlight                      2
flat                            2
flavor                          4
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           4
forget                          2
form                            2
format                          2
found                           10
four                            2
fragile                         2
free                            5
freeze                          3
friend                          12
froze                           5
full                            4
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              15
gen                             4
general                         2
gett                            4
gift                            10
girl                            2
glad                            5
go                              10
good                            46
gotten                          3
great                           62
green                           2
guess                           2
guest                           2
guitar                          5
guy                             2
gym                             4
half                            4
hand                            6
handl                           2
handle                          4
handy                           5
hang                            2
happen                          4
happy                           14
hard                            11
hardware                        2
hav                             4
have                            2
headphone                       9
healthy                         2
hear                            3
heard                           4
heavy                           2
help                            4
helpful                         2
here                            5
high                            3
hold                            11
home                            5
hooah                           3
hope                            2
horrible                        5
horse                           3
hotel                           11
hour                            11
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         4
hype                            2
id                              2
idea                            3
ill                             2
im                              8
impossible                      2
inaccurate                      3
includ                          4
inferior                        4
info                            2
information                     2
inside                          2
install                         3
instead                         3
instruction                     6
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            40
iriv                            2
isnt                            2
issue                           2
item                            29
itself                          4
ive                             14
junk                            7
kazoo                           2
keep                            8
kept                            2
key                             2
kid                             6
kind                            3
know                            15
l                               2
lack                            2
lady                            2
laptop                          2
large                           5
last                            11
lat                             4
late                            3
learn                           3
least                           3
less                            6
let                             3
level                           2
lexar                           2
life                            9
light                           8
lightweight                     3
like                            35
line                            4
list                            3
listen                          7
little                          16
load                            5
location                        3
lock                            2
long                            9
look                            7
loose                           4
lose                            2
lost                            2
lot                             19
loud                            2
lov                             6
love                            32
low                             3
m                               2
machine                         8
made                            13
major                           2
mak                             2
make                            15
man                             2
manual                          2
manufactur                      2
many                            8
market                          3
mat                             2
matt                            5
max                             2
may                             3
maybe                           3
mb                              4
mean                            2
measurement                     2
media                           2
meditation                      2
memory                          7
mention                         2
menu                            2
mess                            2
met                             4
mic                             5
microphone                      6
microsoft                       3
might                           5
military                        2
million                         2
minute                          5
miss                            2
mode                            2
model                           7
mom                             2
money                           20
monitor                         5
monst                           2
month                           16
more                            32
mouse                           2
move                            2
movie                           3
mp                              13
much                            16
music                           26
musical                         2
must                            3
myself                          2
nano                            8
navigation                      2
ne                              9
near                            3
neck                            2
need                            10
negative                        3
nev                             18
new                             10
next                            4
nice                            19
nifty                           2
night                           2
no                              28
noise                           2
nokia                           3
nor                             4
not                             125
note                            2
notebook                        2
nothing                         6
notice                          2
o                               2
octob                           2
off                             5
offer                           2
often                           3
oh                              2
ok                              3
old                             11
omron                           2
once                            7
one                             4
onto                            4
open                            4
operate                         3
opinion                         2
option                          4
ord                             8
order                           8
other                           3
otherwise                       2
over                            3
overall                         2
overpric                        2
own                             8
p                               4
package                         7
page                            3
paid                            3
pain                            3
pair                            2
palm                            2
pap                             3
pay                             10
pedomet                         3
pen                             2
people                          7
perfect                         12
perform                         3
performance                     3
perhap                          2
personal                        2
philip                          2
phone                           8
photo                           5
pic                             3
pick                            5
picture                         7
piece                           5
pillow                          4
pink                            3
place                           5
plastic                         2
play                            51
player                          2
pleas                           7
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        7
pound                           2
pow                             2
present                         7
pretty                          8
previou                         2
pric                            3
price                           31
print                           3
probab                          3
problem                         17
produc                          2
product                         60
promis                          5
prone                           2
proper                          2
proprietary                     2
provide                         2
purchas                         15
purchase                        5
purse                           2
put                             4
quality                         25
quick                           7
quite                           7
radio                           10
random                          2
range                           2
rate                            4
rath                            2
read                            8
real                            23
reason                          5
receipt                         2
receiv                          9
recharge                        2
reciev                          7
recogniz                        2
recomend                        2
recommend                       13
record                          6
refund                          2
refuse                          2
relative                        2
reliable                        3
rememb                          2
repair                          3
replace                         2
requir                          3
reset                           3
respond                         5
response                        2
rest                            2
restart                         2
result                          4
return                          13
review                          7
right                           11
rio                             5
rock                            2
roll                            2
room                            8
rope                            2
run                             9
safe                            3
same                            7
samsung                         3
sandisk                         7
sansa                           3
satisfi                         4
sav                             2
save                            2
say                             3
scratch                         3
scratche                        4
screen                          12
screw                           4
sd                              3
second                          4
secure                          2
seem                            13
select                          2
sell                            5
seller                          2
send                            5
sense                           2
sent                            8
service                         19
set                             8
sett                            2
several                         6
shape                           6
shave                           2
shipp                           14
shock                           3
short                           6
show                            8
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          3
since                           8
site                            2
size                            16
slight                          2
slim                            2
slow                            3
small                           17
snack                           2
snug                            2
so                              2
soft                            2
software                        9
sold                            3
solid                           4
someone                         4
something                       9
sometime                        3
son                             8
song                            18
sony                            6
soon                            2
soooo                           2
sound                           20
south                           2
space                           5
speak                           2
spec                            3
special                         2
spend                           3
spent                           5
spin                            3
sport                           2
st                              2
staff                           3
stand                           5
star                            5
start                           11
stat                            2
stay                            14
stereo                          2
stick                           2
stiff                           3
still                           10
stinky                          2
stop                            3
stopp                           4
stor                            2
storage                         3
store                           8
strap                           2
strong                          2
stuff                           3
stupid                          2
sturdy                          4
such                            8
suck                            4
sudden                          2
sugar                           2
suggest                         2
summ                            2
support                         4
suppos                          2
suprising                       2
sure                            4
switch                          2
system                          5
tak                             2
take                            11
talk                            4
tape                            2
target                          2
tast                            2
taste                           5
tell                            4
tempo                           2
terrible                        8
textbook                        2
th                              22
thank                           6
that                            3
there                           2
therefore                       2
theyre                          3
thin                            2
thing                           5
third                           3
tho                             2
though                          6
three                           9
through                         5
thru                            2
thumb                           2
tight                           3
tighten                         5
time                            36
tiny                            5
tip                             2
title                           2
tivo                            2
today                           3
toilet                          2
ton                             3
too                             14
took                            2
tool                            3
toothbrush                      3
top                             2
toss                            2
total                           5
touch                           2
tough                           2
tourist                         2
toy                             3
track                           3
transf                          3
transfer                        2
trash                           2
travel                          4
tri                             10
try                             7
tun                             6
turn                            8
tv                              4
twice                           4
type                            4
unable                          2
und                             2
understand                      2
unfortunate                     2
unit                            7
unless                          3
until                           10
update                          2
upgrad                          2
upgrade                         3
upload                          2
upset                           2
us                              26
usb                             9
use                             5
useful                          3
useless                         3
utility                         2
value                           6
vendor                          2
version                         4
very                            35
video                           11
vista                           2
volume                          2
wait                            2
walk                            2
walmart                         2
want                            7
wasnt                           3
waste                           3
watch                           3
wear                            4
web                             2
website                         4
week                            15
weight                          7
what                            2
whatsoev                        2
where                           2
while                           14
whole                           4
why                             6
wife                            4
window                          7
wipe                            2
wish                            6
without                         7
wonderful                       4
word                            2
work                            19
world                           2
worse                           4
worst                           6
worth                           13
worthless                       2
wrong                           4
xlr                             2
xp                              5
ye                              3
year                            8
yet                             4
you                             4
young                           3
youre                           4
yr                              3
zen                             4
zune                            2
