*               270
</stop>         270
able            2
absolute        3
actual          3
adapt           2
addition        2
address         2
again           6
ago             5
agree           2
all             3
almost          7
alone           2
along           2
already         4
although        2
alway           3
amazon          10
anoth           7
anyone          4
anything        9
apart           2
apple           8
archo           2
around          3
arriv           3
arrive          3
ask             5
average         2
away            6
back            4
backpack        2
bad             15
bar             2
batterie        2
battery         17
be              2
before          5
believe         2
bett            14
better          2
between         2
big             2
biofeedback     2
bit             5
black           5
body            4
boston          2
both            4
bought          26
box             4
brand           2
break           6
broke           6
broken          4
buck            2
bud             3
burn            2
button          6
buy             47
ca              6
calendar        2
camera          3
canot           3
card            11
cash            2
caus            2
cd              2
chang           2
charg           3
charge          5
cheap           12
check           3
child           3
christma        5
clean           2
clear           2
club            2
company         3
compatible      3
complete        4
complicat       2
comput          8
condition       2
conect          3
consider        3
contact         4
control         3
cost            3
couple          2
crash           3
crashe          2
creative        3
credit          2
custom          6
cute            2
cuz             2
daught          2
day             9
dead            4
defective       4
definite        2
deliver         2
dent            3
deserve         2
design          2
device          10
di              10
didnt           3
different       3
difficult       3
disappoint      6
disc            4
display         3
do              3
doe             2
doesnt          5
dog             2
dont            6
down            5
download        8
drain           2
drink           4
drive           6
dur             3
dvd             7
each            2
ear             3
easi            2
easy            4
effect          2
effort          2
elliptical      2
else            3
email           3
end             2
energy          2
enough          5
entire          2
ev              15
eventual        2
every           10
everything      3
exercise        6
expect          3
expensive       4
experience      3
fail            4
fall            3
far             3
fat             2
fault           2
feature         2
feel            2
few             4
figure          3
file            5
final           3
find            2
fine            6
fit             3
five            2
flash           4
flashlight      2
flaw            2
fm              5
force           3
forev           2
found           7
four            2
free            3
freeze          4
friend          3
froze           5
full            2
functionality   2
game            2
gb              9
gett            4
gift            4
go              6
good            16
gotten          2
great           6
guitar          5
half            2
hand            2
hang            2
happen          3
happy           5
hard            12
hardware        2
hate            2
head            2
headphone       6
heard           2
heavy           2
here            2
high            2
hold            5
horrible        5
hotel           5
hour            10
hr              2
idea            3
im              5
impossible      2
inaccurate      4
includ          2
inferior        4
install         2
instead         4
instruction     4
interface       2
internet        2
invest          2
ipod            27
iriv            2
it              23
item            29
itself          2
ive             15
jump            3
junk            11
kazoo           2
kept            2
kid             4
know            9
lack            2
large           2
last            9
lat             3
lcd             4
let             3
lexar           2
life            5
light           4
like            15
list            3
little          6
load            6
lock            2
long            4
loose           4
lost            3
lot             5
machine         3
made            9
make            8
manual          2
many            3
matt            4
may             2
maybe           3
mb              3
me              2
mean            2
measurement     2
media           2
memory          6
mess            2
met             2
microsoft       3
might           3
minute          6
miss            2
mode            2
model           5
money           24
monitor         2
monst           2
month           26
more            27
mouse           2
mp              21
much            7
multiple        3
music           10
nano            3
ne              2
need            2
nev             15
new             10
next            3
nice            4
no              23
nor             4
not             178
notebook        2
nothing         8
off             9
often           3
old             6
once            4
one             3
onto            2
open            2
operate         2
ord             5
order           6
oregon          3
out             2
overall         2
overpric        2
own             2
page            2
paid            3
pain            2
pair            2
pap             2
pay             9
pedomet         2
pedometer       2
people          4
perfect         2
perhap          2
philip          2
phone           2
photo           2
pick            3
piece           5
place           6
plastic         2
play            41
player          7
pound           3
pow             2
present         3
pretty          5
previou         2
pric            2
price           10
problem         9
product         42
promis          4
prone           2
proper          2
proprietary     2
provide         2
purchas         9
purchase        3
put             2
quality         12
quick           3
quite           4
radio           5
random          2
rate            2
rca             2
read            6
real            7
reason          2
reasonable      2
receipt         2
receiv          6
reciev          2
recogniz        2
recomend        2
recommend       11
record          3
refund          7
rememb          2
repair          3
replac          4
replace         2
requir          2
reset           3
respond         5
rest            2
restart         2
return          22
review          4
right           4
rio             2
rope            2
run             2
same            7
sandisk         6
save            4
scientific      2
scratch         3
scratche        4
screen          12
screw           6
sd              2
second          5
seem            4
sell            4
send            6
sense           2
sent            6
service         7
set             3
several         6
shipp           6
shock           3
short           6
show            2
shuffle         2
sign            2
since           4
slow            3
small           7
so              2
software        9
sold            2
someone         3
something       2
sometime        2
son             2
song            12
sony            3
sound           6
spec            3
spend           5
spent           3
spin            2
st              2
star            3
start           7
stay            12
stiff           2
still           12
stop            5
stopp           6
store           2
string          3
stuff           2
stupid          2
sturdy          2
such            4
suck            3
sudden          2
suggest         4
support         3
sure            2
switch          2
system          2
tak             2
take            9
talk            2
tell            4
terrible        7
textbook        2
th              20
thank           4
that            4
them            2
there           3
therefore       2
third           2
tho             2
though          4
three           7
tighten         5
time            26
tip             2
today           3
toilet          3
too             15
took            3
toothbrush      2
total           3
tourist         2
toy             4
transf          2
transfer        2
trash           2
tri             9
try             2
tun             2
turn            8
twice           3
unable          2
unfortunate     2
unit            4
unless          2
until           5
upgrade         2
upload          2
upset           2
us              14
usb             8
use             2
useless         4
vendor          2
version         2
very            35
video           4
wasnt           2
waste           16
watch           3
way             2
wear            2
website         3
week            13
weight          3
while           5
whole           3
why             3
window          6
wipe            2
wish            4
within          8
wo              7
work            20
worse           4
worst           9
worth           8
wrong           2
xp              4
yahoo           3
ye              2
year            9
you             4
zen             3
