aaa             2
able            2
absolute        2
accurate        7
adapt           4
add             4
advertis        3
affordable      3
again           3
ago             3
airport         2
album           3
allow           2
almost          4
alway           3
amaz            8
amazon          5
anoth           3
anyone          6
anywhere        3
apple           4
arm             3
around          5
arriv           2
attention       2
average         2
awesome         5
awsome          2
baby            3
bad             5
band            5
bar             5
basi            2
bass            2
batterie        6
battery         15
be              2
beautiful       2
before          5
bell            2
best            16
bett            12
big             3
bike            7
birthday        2
blood           4
book            4
bose            2
both            7
bought          23
brand           3
business        4
buy             23
bye             2
ca              4
cable           3
camera          6
car             2
card            4
care            2
carry           5
case            3
cd              4
certain         3
cheap           4
christma        8
class           2
clean           7
clear           4
clip            3
close           2
color           3
combination     2
comfortable     4
common          2
compact         7
company         4
complaint       4
complaints      3
complete        2
comput          2
condition       6
control         3
convenient      3
cool            4
cord            4
cost            6
cover           2
creative        3
cute            2
cymbal          3
dad             3
damage          2
daught          8
daughter        2
day             2
deal            5
definate        2
definite        2
delhi           2
delivery        3
describ         2
describe        2
description     2
design          3
device          2
diap            2
different       3
digg            2
digital         4
direct          2
dog             3
dominat         2
download        3
drive           4
drum            4
durable         2
dvd             4
easi            4
easy            45
eat             2
effective       2
elegant         2
else            4
energy          7
enjoy           5
enough          6
equipment       3
especial        2
ev              7
every           2
everything      5
everywhere      3
exact           4
excellent       15
except          2
exercise        8
expect          6
expected        2
extra           5
extreme         2
face            2
fami            3
fantastic       4
far             9
fast            10
favorite        4
feature         10
feel            9
fell            2
figur           2
fill            2
find            2
fine            5
fit             3
fitness         2
flash           2
flavor          4
floor           3
fm              4
food            2
forev           3
forget          2
form            2
found           4
free            4
friend          9
fun             2
future          2
garage          2
gb              10
gen             4
general         2
gift            8
girl            2
glad            3
go              5
good            64
great           126
guess           2
guitar          2
gym             4
hand            3
handl           2
handle          4
handy           4
happen          2
happy           13
hard            5
hav             3
have            2
head            2
headphone       4
healthy         2
hear            2
heard           3
help            2
here            3
high            12
hold            10
home            4
hooah           3
hope            2
horse           3
hotel           6
huge            2
hungry          2
hurt            2
husband         4
id              2
im              8
includ          2
inexpensive     2
inside          2
instruction     2
instrument      2
ipod            37
it              29
item            17
itself          2
ive             8
keep            6
key             2
kid             5
kind            2
know            2
large           4
last            10
least           2
less            4
life            10
light           5
lightweight     3
like            32
line            3
listen          9
little          11
location        3
long            7
look            5
lot             17
lov             4
love            57
low             4
machine         5
made            5
make            10
many            5
market          3
mat             2
me              2
media           2
memory          4
met             2
mic             4
microphone      7
military        2
million         2
model           2
mom             2
money           7
monitor         5
month           6
more            18
move            2
movie           2
mp              26
much            26
music           20
musical         2
must            2
nano            11
ne              7
near            4
need            9
nev             6
new             5
nice            20
nifty           2
night           2
no              25
noise           2
nokia           3
not             61
note            2
oh              2
ok              2
old             7
once            4
one             4
open            4
opinion         2
option          5
order           4
other           2
out             2
over            2
own             9
p               2
package         4
pay             2
pedomet         3
pen             2
people          3
perfect         11
perfectly       3
performance     3
phone           8
photo           3
pic             2
pick            2
picture         9
piece           2
pillow          3
pink            3
place           4
play            36
player          4
pleas           10
plenty          2
pod             2
portable        4
present         3
pressure        4
pretty          5
price           27
print           3
probab          5
problem         12
product         40
purchas         7
purchase        4
put             3
quality         19
quick           4
quite           2
radio           9
read            6
real            28
reason          2
receiv          4
reciev          4
recommend       15
record          2
reliable        2
requir          2
result          3
review          3
right           6
rio             3
rock            2
roll            2
room            6
run             6
safe            3
same            3
sansa           2
satisfi         3
screen          7
seem            11
sent            2
service         16
set             5
several         2
shape           6
shave           2
shipp           6
show            8
simple          4
since           3
size            15
sleek           2
slight          2
slim            2
small           17
snack           3
snug            2
soft            2
software        4
solid           3
someone         3
something       5
son             6
song            10
soooo           2
sound           31
south           2
space           6
speak           2
special         3
spent           2
staff           2
stand           4
star            3
start           5
stay            3
still           5
storage         5
store           6
strap           2
stuff           2
sturdy          2
such            3
suppos          2
sure            4
system          5
take            6
talk            2
tast            3
taste           3
tempo           2
th              10
thank           7
thanks          3
theyre          2
thin            2
thing           7
though          4
through         5
tight           2
time            15
tiny            4
ton             2
too             8
tool            3
tough           2
track           2
transf          5
travel          4
tri             3
try             2
tun             3
tv              5
type            3
understand      2
unit            5
up              3
upgrad          2
us              15
usb             3
use             8
useful          2
value           7
version         2
very            71
video           9
walk            2
want            6
watch           2
wear            2
weight          4
well            2
while           6
wife            3
wish            2
without         6
wonderful       6
work            10
worth           5
wrong           4
xlr             2
year            3
yet             3
you             4
young           2
youre           2
yr              2
zen             4
