*,apple         2
*,baby          2
*,battery       2
*,best          5
*,blood         2
*,bought        14
*,buy           2
*,easy          3
*,excellent     6
*,fantastic     3
*,feel          2
*,good          5
*,great         30
*,ipod          7
*,item          2
*,ive           3
*,like          2
*,love          12
*,microphone    2
*,mp            6
*,nice          2
*,nifty         2
*,not           3
*,own           2
*,perfect       2
*,play          5
*,product       4
*,purchas       4
*,real          4
*,rio           2
*,rock          2
*,seem          2
*,son           3
*,thank         2
*,tri           2
*,very          11
*,want          2
absolute,no     2
accurate,</stop> 2
again,</stop>   2
apple,dominat   2
arm,band        2
around,ne       2
average,ipod    2
awesome,</stop> 3
battery,last    2
battery,life    10
best,ipod       2
best,tast       2
bett,expect     2
blood,pressure  4
book,lot        2
bought,gift     2
buy,</stop>     2
buy,again       2
buy,anoth       3
buy,understand  2
ca,not          4
camera,</stop>  2
christma,love   4
color,screen    2
compact,size    2
company,not     2
complaints,</stop> 3
condition,</stop> 2
creative,zen    3
design,easy     2
digital,camera  2
dominat,mp      2
easy,accurate   3
easy,control    2
easy,great      4
easy,transf     3
easy,use        3
energy,bar      4
enough,military 2
exact,describ   2
excellent,product 2
exercise,bike   2
exercise,equipment 2
expected,</stop> 2
fami,love       2
fast,accurate   2
fast,service    2
feature,excellent 2
feel,great      2
feel,like       2
feel,very       2
fm,radio        2
fm,tun          2
future,</stop>  2
garage,band     2
good,battery    2
good,condition  2
good,price      5
good,product    2
good,service    3
good,sound      2
good,thing      2
good,very       2
great,</stop>   8
great,business  2
great,deal      2
great,easy      3
great,feature   2
great,high      3
great,im        2
great,item      4
great,not       2
great,price     4
great,product   13
great,shape     2
great,size      3
great,sound     8
great,value     5
happy,</stop>   2
head,phone      2
high,recommend  9
hold,lot        2
husband,love    2
im,glad         3
ipod,</stop>    2
ipod,great      3
ipod,little     2
ipod,nano       3
ipod,very       2
ipod,video      2
it,</stop>      29
item,</stop>    2
ive,us          3
kid,love        3
last,forev      2
life,</stop>    2
life,great      3
like,it         4
like,product    3
listen,music    3
lot,</stop>     3
lot,feature     2
love,</stop>    2
love,great      2
love,ipod       2
love,it         7
love,listen     2
love,love       3
love,sound      2
love,take       2
love,too        2
make,easi       2
make,feel       2
market,buy      2
me,</stop>      2
money,</stop>   4
monitor,easy    2
mp,market       2
mp,play         16
mp,player       2
much,average    2
much,bett       3
much,less       2
much,more       4
music,</stop>   2
music,great     2
nano,great      2
near,future     2
new,headphone   2
nice,clean      2
no,complaint    3
no,complaints   3
no,problem      4
not,good        3
not,heard       2
not,like        2
not,problem     3
not,us          2
not,wrong       2
out,</stop>     2
own,ipod        3
perfect,condition 2
perfectly,</stop> 3
place,stay      2
play,great      3
play,very       5
play,work       2
player,</stop>  3
pleas,it        2
pleas,item      2
pressure,monitor 4
pretty,good     2
price,</stop>   5
probab,buy      2
problem,</stop> 3
problem,unit    2
product,</stop> 5
product,exact   2
product,great   2
product,lot     2
product,very    3
real,good       2
real,great      5
real,like       6
recommend,it    5
recommend,like  2
screen,</stop>  2
seem,great      2
service,</stop> 3
size,easy       2
small,light     2
son,christma    2
sound,great     6
sound,nice      2
sound,quality   7
space,perfect   2
take,care       2
thank,you       2
thanks,</stop>  3
thing,small     2
though,not      2
time,great      2
too,great       2
too,much        2
transf,song     2
tv,show         2
understand,</stop> 2
unit,</stop>    2
up,</stop>      2
us,friend       2
use,</stop>     4
very,compact    2
very,durable    2
very,easy       6
very,fast       2
very,good       11
very,handy      2
very,happy      8
very,much       3
very,nice       3
very,pleas      8
very,safe       2
very,simple     2
very,small      2
very,well       2
video,ipod      2
well,</stop>    2
worth,money     2
you,</stop>     3
