</stop>                         540
aaa                             3
able                            4
absolut                         2
absolute                        2
accurate                        5
actual                          3
adapt                           6
add                             4
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      3
afraid                          2
again                           5
ago                             6
agree                           3
airport                         2
album                           3
allow                           3
almost                          9
alone                           2
along                           3
alot                            2
already                         5
although                        3
alway                           6
amaz                            8
amazo                           2
amazon                          11
amazone                         2
amount                          3
amp                             2
anoth                           10
answ                            2
anymore                         2
anyone                          10
anything                        10
anywhere                        3
apart                           2
apple                           6
archo                           2
around                          6
arriv                           5
arrive                          3
ask                             3
attention                       2
audio                           2
available                       2
average                         2
avoid                           2
aware                           2
away                            5
awesome                         2
awsome                          2
baby                            3
backpack                        3
bad                             15
ball                            2
band                            6
bar                             7
basi                            2
basical                         2
bass                            2
batterie                        8
battery                         13
be                              4
beautiful                       2
become                          2
before                          10
begin                           2
believe                         3
bell                            2
best                            12
bett                            22
between                         2
beware                          2
big                             5
bike                            7
biofeedback                     2
birthday                        3
bit                             3
black                           5
body                            2
book                            2
boost                           2
bose                            2
boston                          2
both                            11
bought                          39
box                             4
brand                           5
break                           6
broke                           7
broken                          4
brought                         2
buck                            2
bud                             3
built                           2
business                        4
button                          7
buy                             40
bye                             2
cable                           4
calendar                        2
camera                          7
car                             3
card                            13
care                            2
carry                           6
case                            4
cash                            3
caus                            2
cd                              6
cent                            2
certain                         3
chang                           3
charg                           3
charge                          6
cheap                           14
check                           4
child                           3
children                        2
christma                        7
city                            2
class                           3
clean                           9
clear                           6
clip                            3
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     5
common                          3
compact                         5
company                         5
compatible                      3
complaint                       4
complete                        6
complicat                       2
comput                          10
condition                       6
conect                          3
conector                        2
consider                        3
constant                        2
contact                         4
control                         6
convenient                      3
cool                            4
copy                            2
cord                            4
correct                         2
cost                            9
count                           2
couple                          3
cov                             2
cover                           2
crash                           4
crashe                          2
creative                        2
cute                            4
cuz                             2
cymbal                          3
dad                             4
dai                             2
damag                           2
damage                          3
data                            2
daught                          10
daughter                        2
day                             11
dead                            4
deal                            6
defective                       4
definate                        2
definite                        2
delhi                           2
deliv                           2
deliver                         3
delivery                        3
dent                            3
describ                         3
describe                        2
description                     2
deserve                         2
design                          3
develop                         2
device                          9
di                              5
diap                            2
didnt                           3
die                             2
different                       6
difficult                       3
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      6
disc                            2
disk                            2
display                         4
do                              4
doesnt                          5
dog                             5
dollar                          2
dont                            4
down                            4
download                        9
drain                           3
drink                           4
driv                            2
drive                           10
dropp                           2
drum                            4
dur                             2
durable                         3
dvd                             11
easi                            6
easy                            34
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            7
email                           4
end                             3
energy                          3
enjoy                           6
enough                          9
entire                          2
equipment                       2
especial                        2
etc                             2
ev                              20
eventual                        2
everthing                       2
every                           7
everything                      8
everywhere                      4
exact                           2
excellent                       13
except                          2
exercis                         2
exercise                        9
expect                          9
expensive                       5
experienc                       2
experience                      4
extra                           6
extreme                         2
face                            2
fail                            5
fami                            2
fantastic                       4
far                             12
fast                            7
fat                             3
fault                           3
favorite                        5
feature                         10
feedback                        2
feel                            4
few                             5
figur                           2
figure                          4
file                            6
fill                            2
final                           3
find                            4
fine                            9
fit                             6
fitness                         2
five                            2
flash                           2
flashlight                      2
flat                            2
flavor                          4
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           5
forget                          2
form                            3
format                          2
found                           11
four                            2
fragile                         2
free                            7
freeze                          2
friend                          12
froze                           5
full                            3
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              15
gen                             4
general                         3
gett                            5
gift                            12
girl                            2
glad                            3
go                              11
good                            53
gotten                          2
great                           65
green                           2
guess                           3
guest                           2
guitar                          7
guy                             2
gym                             4
half                            3
hand                            5
handl                           2
handle                          4
handy                           4
hang                            2
happen                          5
happy                           13
hard                            13
hardware                        2
hate                            2
hav                             3
have                            2
headphone                       10
healthy                         2
hear                            3
heard                           5
heavy                           3
help                            3
helpful                         2
here                            5
high                            5
hold                            11
home                            5
hooah                           3
hope                            3
horrible                        5
horse                           3
hotel                           9
hour                            11
house                           2
howev                           2
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         3
hype                            2
id                              3
idea                            3
ill                             2
im                              8
impossible                      2
inaccurate                      4
includ                          4
inexpensive                     2
inferior                        4
info                            2
information                     2
inside                          3
install                         3
instead                         4
instruction                     4
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            41
iriv                            2
isnt                            2
issue                           2
item                            33
itself                          4
ive                             13
junk                            6
kazoo                           2
keep                            7
kept                            2
key                             2
kid                             6
kind                            2
know                            11
l                               2
lack                            2
lady                            2
laptop                          2
large                           6
last                            13
lat                             4
late                            2
lcd                             2
learn                           2
least                           3
less                            4
let                             3
level                           2
lexar                           2
life                            10
light                           7
lightweight                     3
like                            37
line                            4
list                            3
listen                          7
little                          17
load                            3
location                        4
lock                            3
long                            9
look                            6
loose                           4
lose                            2
lost                            3
lot                             17
loud                            2
lov                             5
love                            33
low                             3
m                               2
machine                         8
made                            14
major                           2
mak                             2
make                            12
man                             2
manual                          3
manufactur                      2
many                            8
mat                             2
matt                            5
max                             2
may                             2
maybe                           3
mb                              4
mean                            2
measurement                     2
media                           4
meditation                      2
memory                          8
mention                         2
menu                            2
mess                            2
met                             4
mic                             4
microphone                      7
microsoft                       3
might                           4
military                        2
million                         2
minute                          7
miss                            2
mode                            2
model                           7
mom                             2
money                           18
monitor                         5
monst                           2
month                           23
more                            34
mouse                           2
move                            2
movie                           3
mp                              13
much                            17
music                           24
musical                         2
must                            2
myself                          2
nano                            8
navigation                      2
ne                              9
near                            2
neck                            2
need                            11
negative                        3
nev                             16
new                             12
next                            4
nice                            20
nifty                           2
night                           3
no                              27
noise                           2
nokia                           3
nor                             4
not                             123
note                            2
notebook                        2
nothing                         7
notice                          2
o                               2
octob                           2
off                             8
offer                           2
often                           3
oh                              2
ok                              2
old                             13
omron                           2
once                            6
one                             4
onto                            3
open                            4
operate                         3
opinion                         2
option                          6
ord                             6
order                           8
other                           3
otherwise                       2
over                            3
overall                         3
overpric                        2
own                             8
p                               3
package                         5
page                            3
paid                            3
pain                            3
pair                            2
palm                            2
pap                             3
pay                             9
pedomet                         3
pedometer                       2
pen                             2
people                          7
perfect                         11
perform                         2
performance                     3
perhap                          2
personal                        2
philip                          2
phone                           10
photo                           5
pic                             2
pick                            5
picture                         9
piece                           4
pillow                          4
pink                            3
place                           8
plastic                         2
play                            53
player                          2
pleas                           6
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        5
pound                           3
pow                             2
present                         6
pretty                          8
previou                         2
pric                            3
price                           28
print                           3
probab                          3
problem                         15
produc                          2
product                         57
promis                          5
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         16
purchase                        5
purse                           2
put                             5
quality                         25
quick                           7
quite                           6
radio                           11
random                          2
range                           2
rate                            3
rath                            2
read                            8
real                            22
reason                          4
receipt                         2
receiv                          8
recharge                        2
reciev                          6
recogniz                        2
recommend                       12
record                          5
refuse                          2
relative                        2
reliable                        3
rememb                          2
repair                          4
replac                          2
replace                         2
requir                          4
reset                           3
respond                         6
response                        2
rest                            2
restart                         2
result                          4
return                          13
review                          5
right                           10
rio                             5
rock                            2
roll                            2
room                            7
rope                            2
run                             8
safe                            3
same                            6
samsung                         2
sandisk                         7
sansa                           2
satisfi                         4
sav                             2
save                            2
say                             2
scratch                         3
scratche                        4
screen                          13
screw                           4
sd                              3
second                          5
secure                          2
seem                            11
select                          2
sell                            5
seller                          2
send                            6
sense                           2
sent                            8
service                         19
set                             8
sett                            2
several                         6
shape                           6
shave                           2
shipp                           12
shock                           3
short                           6
show                            10
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          4
since                           7
site                            2
size                            12
slight                          2
slim                            2
slow                            3
small                           22
snack                           3
snug                            2
soft                            2
software                        11
sold                            2
solid                           3
someone                         4
something                       7
sometime                        3
son                             6
song                            20
sony                            4
soon                            2
soooo                           3
sound                           20
south                           2
space                           5
speak                           2
spec                            3
special                         3
spend                           4
spent                           5
spin                            3
sport                           2
st                              2
staff                           3
stand                           4
star                            6
start                           12
stat                            2
stay                            12
stereo                          2
stick                           2
stiff                           3
still                           12
stinky                          2
stop                            2
stopp                           4
stor                            2
storage                         5
store                           8
strap                           2
strong                          2
stuff                           4
stupid                          2
sturdy                          4
such                            7
suck                            3
sudden                          2
sugar                           2
suggest                         2
summ                            2
support                         3
suppos                          2
suprising                       2
sure                            6
switch                          2
system                          5
tak                             2
take                            11
talk                            4
tape                            2
target                          2
tast                            3
taste                           4
tell                            4
tempo                           2
terrible                        8
textbook                        2
th                              24
thank                           6
that                            3
there                           3
therefore                       2
theyre                          3
thin                            3
thing                           5
third                           2
tho                             2
though                          6
three                           8
through                         5
thru                            2
thumb                           2
tight                           3
tighten                         5
time                            34
tiny                            5
tip                             2
title                           2
tivo                            2
today                           3
ton                             3
too                             13
took                            2
tool                            3
toothbrush                      2
top                             2
toss                            2
total                           4
touch                           2
tough                           2
tourist                         2
toy                             4
track                           3
transf                          3
transfer                        2
trash                           2
travel                          4
tri                             12
try                             4
tun                             5
turn                            6
tv                              4
twice                           4
type                            4
unable                          2
und                             2
unfortunate                     2
unit                            5
unless                          3
until                           6
update                          2
upgrad                          2
upgrade                         3
upload                          2
upset                           2
us                              27
usb                             9
use                             5
useful                          2
useless                         4
utility                         2
value                           7
vendor                          2
version                         4
very                            36
video                           11
vista                           2
volume                          2
wait                            2
walk                            3
walmart                         2
want                            6
wasnt                           2
waste                           3
watch                           3
wear                            4
web                             2
website                         4
week                            12
weight                          7
what                            2
whatsoev                        2
where                           2
while                           11
whole                           4
why                             4
wife                            4
window                          5
wipe                            2
wish                            6
within                          2
without                         7
wonderful                       6
word                            2
work                            19
world                           2
worse                           4
worst                           5
worth                           11
worthless                       2
wrong                           6
xlr                             2
xp                              4
ye                              2
year                            10
yet                             4
you                             4
young                           3
youre                           3
yr                              3
zen                             7
zune                            2
