*,absolute      2
*,apple         4
*,baby          2
*,bad           2
*,battery       3
*,best          5
*,bett          2
*,blood         2
*,bought        30
*,buy           5
*,cheap         3
*,creative      2
*,day           2
*,each          2
*,easy          4
*,excellent     6
*,fantastic     3
*,far           2
*,feel          2
*,good          6
*,great         31
*,hard          2
*,headphone     2
*,ipod          11
*,item          9
*,ive           8
*,last          2
*,like          2
*,little        2
*,love          12
*,machine       2
*,made          2
*,microphone    2
*,mp            13
*,much          2
*,nice          2
*,nifty         2
*,not           31
*,open          2
*,order         2
*,own           3
*,people        2
*,perfect       2
*,piece         2
*,pillow        2
*,play          11
*,pretty        2
*,product       10
*,purchas       7
*,real          5
*,receiv        3
*,recommend     2
*,return        3
*,rio           2
*,rock          2
*,seem          3
*,software      3
*,son           3
*,th            3
*,thank         2
*,time          2
*,tri           4
*,us            2
*,very          16
*,want          2
*,work          4
*,worst         8
absolute,no     3
accurate,</stop> 2
again,</stop>   4
ago,quite       2
all,</stop>     3
almost,month    2
amazon,</stop>  2
amazon,made     2
apple,dominat   2
apple,store     2
apple,website   2
arm,band        2
around,ne       2
ask,money       2
average,ipod    2
away,</stop>    2
awesome,</stop> 3
back,</stop>    4
bad,battery     2
bad,product     3
battery,drain   2
battery,hour    2
battery,last    3
battery,life    12
best,ipod       2
best,tast       2
bett,expect     2
bett,mp         2
better,</stop>  2
bit,more        2
blood,pressure  4
body,fat        2
book,lot        2
bought,gift     2
bought,ipod     3
bought,product  2
bought,three    3
burn,</stop>    2
buy,</stop>     5
buy,again       2
buy,amazon      2
buy,anoth       3
buy,it          4
buy,item        2
buy,new         4
buy,player      2
buy,product     2
buy,set         2
buy,understand  2
ca,not          10
camera,</stop>  2
canot,tighten   2
card,</stop>    2
cheap,price     2
christma,love   4
christma,present 2
color,screen    2
compact,size    2
company,not     2
complaints,</stop> 3
condition,</stop> 2
creative,zen    4
credit,card     2
custom,service  5
definite,not    2
design,easy     2
device,not      3
di,not          2
di,within       3
digital,camera  3
disc,</stop>    2
doe,not         2
dominat,mp      2
dont,buy        2
down,</stop>    2
download,song   2
dur,exercise    2
each,time       2
ear,bud         3
easy,accurate   3
easy,control    2
easy,great      4
easy,transf     3
easy,use        3
energy,bar      4
energy,drink    2
enough,military 2
equipment,</stop> 2
ev,bought       2
ever,</stop>    2
every,time      3
every,way       2
exact,describ   2
excellent,product 2
exercise,bike   2
exercise,equipment 3
expected,</stop> 2
fall,apart      2
fami,love       2
fast,accurate   2
fast,service    2
feature,excellent 2
feel,great      2
feel,like       3
feel,very       2
fell,off        2
fine,</stop>    2
firmware,update 2
flash,card      2
flash,drive     2
fm,not          2
fm,radio        4
fm,tun          2
freeze,not      2
future,</stop>  2
garage,band     2
gb,ipod         2
gb,model        2
good,</stop>    2
good,battery    3
good,condition  2
good,instruction 2
good,price      5
good,product    3
good,service    4
good,sound      2
good,thing      2
good,very       2
great,</stop>   9
great,business  2
great,deal      2
great,easy      3
great,feature   2
great,high      3
great,im        2
great,item      4
great,not       2
great,price     4
great,product   13
great,screen    2
great,shape     2
great,size      4
great,sound     8
great,value     5
happy,</stop>   3
happy,product   2
hard,drive      4
head,phone      3
high,recommend  9
hold,lot        2
hold,song       2
hotel,ev        2
husband,love    2
im,glad         3
im,very         2
instruction,not 2
ipod,</stop>    6
ipod,great      3
ipod,hold       2
ipod,little     2
ipod,nano       4
ipod,th         2
ipod,very       2
ipod,video      2
it,</stop>      52
item,</stop>    4
item,ev         2
item,not        5
item,usb        2
ive,ev          2
ive,nev         2
ive,play        2
ive,us          4
jump,drive      2
jump,rope       2
junk,</stop>    3
junk,junk       2
kid,love        3
last,forev      2
last,week       2
last,year       2
lcd,screen      2
life,</stop>    2
life,great      3
light,fine      2
like,it         4
like,new        2
like,product    4
listen,music    3
load,fine       2
load,very       2
long,time       2
lot,</stop>     3
lot,feature     2
love,</stop>    2
love,great      2
love,ipod       2
love,it         8
love,listen     2
love,love       3
love,sound      2
love,take       2
love,too        2
low,price       2
make,easi       2
make,feel       2
make,good       2
market,buy      2
me,</stop>      4
memory,not      2
minutes,</stop> 2
money,</stop>   11
money,spend     2
monitor,easy    2
month,ago       3
month,before    2
month,lat       2
month,screen    2
more,</stop>    5
more,expensive  3
more,ipod       3
mp,market       2
mp,play         26
mp,player       6
much,</stop>    2
much,average    2
much,bett       6
much,less       2
much,more       4
multiple,time   2
music,</stop>   2
music,great     2
music,store     2
nano,</stop>    2
nano,great      2
nano,ipod       2
near,future     2
nev,buy         2
nev,work        3
new,headphone   3
nice,clean      2
nice,hard       2
no,complaint    3
no,complaints   3
no,damage       2
no,long         2
no,matt         3
no,problem      4
no,reason       2
no,sign         2
not,allow       2
not,anything    2
not,arrive      2
not,believe     2
not,buy         19
not,charge      3
not,compatible  2
not,easy        2
not,good        6
not,happy       3
not,heard       2
not,install     2
not,know        3
not,like        4
not,not         2
not,play        4
not,problem     3
not,promis      2
not,radio       2
not,read        3
not,receiv      2
not,recogniz    2
not,recomend    2
not,recommend   8
not,stay        4
not,sure        2
not,tighten     2
not,turn        3
not,us          3
not,very        4
not,waste       6
not,worth       6
not,wrong       2
nothing,</stop> 2
now,</stop>     2
off,no          2
on,</stop>      2
once,while      2
one,</stop>     3
open,package    2
order,item      2
oregon,scientific 3
out,</stop>     4
own,ipod        3
pay,more        2
pedomet,great   2
perfect,condition 2
perfectly,</stop> 3
piece,junk      3
place,stay      2
play,great      3
play,guitar     2
play,month      2
play,music      2
play,not        4
play,real       3
play,very       5
play,work       3
player,</stop>  7
player,not      2
pleas,it        2
pleas,item      2
pressure,monitor 4
pretty,good     2
price,</stop>   9
probab,buy      2
problem,</stop> 4
problem,unit    2
product,</stop> 7
product,exact   2
product,great   2
product,lot     2
product,not     5
product,order   2
product,terrible 2
product,very    3
purchase,</stop> 2
quality,</stop> 4
quality,ev      2
quit,work       2
radio,fm        3
rca,kazoo       2
read,card       2
read,review     2
real,good       2
real,great      5
real,like       6
reasonable,price 2
receiv,item     2
recomend,</stop> 2
recommend,</stop> 3
recommend,anyone 2
recommend,it    5
recommend,like  2
recommend,product 2
refund,</stop>  4
refund,money    2
replac,it       2
return,amazon   2
return,it       5
return,not      2
review,product  2
same,price      2
same,th         2
save,money      3
scientific,pedomet 2
screen,</stop>  2
screen,black    2
screen,di       2
screw,canot     2
seem,great      2
seem,like       2
service,</stop> 4
several,time    2
size,</stop>    2
size,easy       2
sleek,great     2
small,light     2
so,</stop>      2
software,not    2
someone,not     2
son,christma    2
song,no         2
sound,great     6
sound,nice      2
sound,quality   9
space,perfect   2
spend,much      2
stay,away       3
still,not       5
stop,work       3
stopp,work      3
string,wo       2
suggest,buy     2
system,</stop>  2
take,care       2
take,forev      2
th,buy          2
th,cheap        2
th,not          2
thank,amazon    2
thank,you       3
thanks,</stop>  4
that,it         2
them,</stop>    2
thing,small     2
this,</stop>    2
though,not      2
time,great      2
time,not        2
time,us         3
toilet,monst    2
too,great       2
too,large       2
too,much        4
too,small       2
took,week       2
transf,file     2
transf,song     2
tuner,</stop>   2
turn,off        2
tv,show         2
understand,</stop> 2
unit,</stop>    2
unit,very       2
up,</stop>      3
us,friend       2
usb,device      2
use,</stop>     5
very,bad        2
very,compact    2
very,disappoint 4
very,durable    2
very,easy       7
very,fast       3
very,good       14
very,handy      2
very,happy      8
very,much       3
very,nice       4
very,not        2
very,pleas      8
very,safe       2
very,simple     2
very,small      3
very,well       2
video,ipod      2
waste,money     11
waste,time      2
watch,video     2
way,</stop>     2
week,</stop>    2
well,</stop>    3
window,media    2
within,month    3
within,week     4
wo,not          7
work,</stop>    2
work,day        2
work,di         2
work,fine       3
work,month      2
worst,hotel     2
worst,item      2
worth,money     2
yahoo,music     2
year,ago        2
years,</stop>   2
you,</stop>     4
