a               41
aaa             2
able            3
about           12
absolute        2
accurate        7
add             4
adult           2
advertis        2
affordable      3
aft             5
again           3
ago             2
airport         2
album           3
all             30
allow           2
almost          4
also            11
alway           3
am              18
amaz            8
amazon          6
an              18
and             243
anoth           4
any             11
anyone          5
anywhere        3
apple           3
are             27
arm             3
around          6
arriv           2
at              28
attention       2
average         2
awesome         5
awsome          2
baby            3
back            3
bad             4
ball            2
band            4
bar             5
basi            2
bass            2
batterie        6
battery         16
be              17
beautiful       3
because         5
been            9
before          5
best            15
bett            13
big             4
bike            4
birthday        2
blood           5
book            3
both            7
bought          19
brand           3
built           2
business        4
but             30
buy             22
by              8
bye             2
ca              4
cable           3
came            7
camera          8
can             26
car             3
card            6
care            3
carry           6
case            3
cd              5
certain         3
cheap           5
christma        7
class           2
clean           7
clear           5
clip            4
close           2
color           3
combination     2
come            6
comfortable     4
common          2
compact         8
company         4
complaint       6
complete        2
comput          3
condition       5
control         3
convenient      3
cool            7
cord            5
cost            6
could           5
creative        4
cute            2
cymbal          2
dad             2
daught          9
daughter        2
day             4
deal            7
definate        3
definite        2
delhi           2
delivery        2
describ         3
describe        2
design          3
device          5
diap            2
did             5
different       5
digg            2
digital         4
direct          2
do              21
doe             15
dog             3
dont            2
drive           4
durable         2
dvd             3
earbud          2
easi            5
easy            47
eat             2
effective       2
elegant         2
else            4
energy          5
enjoy           7
enough          5
equipment       3
especial        2
ev              7
even            8
every           4
everything      7
everywhere      2
exact           4
excellent       14
except          2
exercise        8
expect          7
extra           5
extreme         2
face            2
fami            3
fantastic       3
far             9
fast            10
favorite        5
feature         9
feel            9
figur           2
file            3
fill            2
find            3
fine            6
first           6
fit             4
fitness         2
flash           2
flavor          4
floor           3
fm              5
food            2
for             129
forev           4
form            2
found           3
free            5
friend          9
from            18
full            2
gadget          2
gave            2
gb              10
gen             4
get             13
gift            9
girl            2
give            4
glad            5
go              11
good            60
got             13
great           132
guitar          2
gym             4
h               5
ha              28
had             22
hand            3
handl           2
handle          4
handy           5
happy           15
hard            3
hav             4
have            52
he              17
headphone       3
healthy         2
hear            2
heard           2
help            3
here            3
hi              5
high            11
hold            10
home            4
hooah           3
hope            3
horse           3
hotel           6
house           2
how             6
hungry          2
hurt            2
husband         5
i               176
id              2
if              15
im              9
in              51
includ          2
instruction     3
instrument      2
ipod            41
it              298
item            14
itself          2
ive             9
just            14
keep            7
key             2
kid             6
kind            2
know            4
large           4
last            9
learn           2
least           2
less            4
life            11
light           4
lightweight     3
like            35
line            3
listen          9
little          12
location        3
long            7
look            15
lose            2
lot             19
loud            2
lov             5
love            54
low             4
machine         5
made            4
make            12
many            4
market          2
mat             2
me              17
media           2
memory          5
met             2
mic             7
microphone      8
might           2
military        2
million         2
mine            2
model           2
mom             2
money           7
monitor         5
month           5
more            15
most            5
movie           2
mp              26
much            25
music           23
musical         2
must            3
my              98
nano            12
ne              8
near            3
need            6
negative        2
nev             6
new             6
nice            20
nifty           2
no              24
noise           2
nokia           3
not             55
note            2
now             7
of              68
offer           2
old             5
on              41
once            4
one             33
open            4
opinion         2
option          4
or              18
order           4
oth             9
other           3
our             5
out             16
ov              5
over            2
own             8
p               2
package         6
pay             2
pedomet         3
people          3
perfect         16
perform         2
performance     3
phone           6
photo           3
pic             2
picture         8
piece           3
pillow          3
pink            3
place           2
play            42
pleas           9
plenty          2
plu             2
pod             2
portable        5
present         4
pressure        4
pretty          5
price           31
print           4
probab          5
problem         13
produc          2
product         41
purchas         9
purchase        4
purse           2
put             2
quality         21
quick           4
quite           3
radio           10
rate            2
read            4
real            28
reason          2
receiv          4
reciev          5
recommend       16
record          4
reliable        2
result          4
review          2
right           7
rio             3
roll            2
room            6
run             10
safe            3
said            2
same            3
sansa           2
satisfi         4
say             11
screen          9
secure          2
see             5
seem            10
sell            2
sent            2
service         15
set             4
several         2
shape           6
shave           2
she             16
shipp           7
should          3
show            6
simple          3
since           4
size            19
sleek           2
slight          2
slim            2
small           16
snack           2
snug            2
so              34
soft            2
software        3
solid           4
some            3
someone         3
something       7
son             5
song            9
soooo           2
sound           33
south           2
space           6
speak           2
special         2
spent           2
staff           2
stand           5
star            3
start           4
stay            4
stereo          2
still           5
stor            2
storage         3
store           6
strong          2
sturdy          2
such            4
summ            2
suppos          2
sure            3
system          5
take            6
talk            2
tast            2
taste           4
tempo           2
th              12
than            18
thank           10
that            47
the             257
their           4
them            14
there           10
these           13
they            20
theyre          2
thi             139
thing           5
think           8
though          4
through         5
tight           2
time            16
tiny            4
to              167
ton             2
too             8
tool            3
total           2
track           2
transf          6
travel          4
tri             3
try             3
tun             4
tv              4
two             8
type            3
understand      2
unit            5
until           2
up              14
upgrad          2
us              15
usb             4
use             57
useful          3
value           8
version         2
very            67
video           9
wa              52
want            9
watch           2
way             6
we              11
wear            2
week            2
weight          4
well            19
went            2
were            3
what            18
when            15
which           9
while           9
who             7
why             2
wife            3
will            18
window          2
wish            2
with            70
without         6
wonderful       4
work            46
worth           6
would           13
wrong           2
xlr             2
year            9
yet             3
you             53
young           2
your            13
youre           2
yr              2
zen             3
