a               72
aaa             3
able            5
about           30
absolut         2
absolute        5
accurate        7
actual          4
adapt           4
add             4
addition        2
address         2
adult           2
advertis        2
affordable      3
aft             35
again           10
ago             7
agree           3
airport         2
album           3
all             66
allow           3
almost          12
alone           2
along           2
alot            2
already         4
also            16
although        2
alway           6
am              26
amaz            8
amazo           2
amazon          14
amazone         2
amount          3
amp             2
an              42
and             414
anoth           11
answ            2
any             25
anymore         2
anyone          9
anything        10
anywhere        3
apart           2
apple           12
archo           2
are             52
arm             3
around          8
arriv           6
arrive          2
ask             6
at              52
attention       2
audio           2
available       2
average         4
avoid           3
away            8
awesome         5
awsome          2
baby            3
back            21
backpack        3
bad             21
ball            2
band            5
bar             7
basi            2
basical         2
bass            2
batterie        8
battery         31
be              53
beautiful       3
because         15
become          2
been            17
before          11
begin           2
believe         4
best            15
bett            27
between         2
beware          2
big             6
bike            4
biofeedback     2
birthday        3
bit             4
black           5
blood           5
body            4
book            3
boost           2
both            11
bought          44
box             5
brand           4
break           6
broke           10
broken          5
brought         2
buck            3
built           3
burn            3
business        4
but             79
button          7
buy             74
by              20
bye             2
ca              10
cable           4
calendar        2
came            11
camera          10
can             43
canot           3
car             4
card            14
care            3
carry           7
case            4
cash            2
cd              7
cent            2
certain         3
chang           4
charg           3
charge          9
cheap           18
check           4
child           3
children        2
christma        12
city            2
class           3
clean           9
clear           7
clip            4
close           2
club            3
college         2
color           4
combination     2
come            9
comfortable     5
common          3
compact         8
company         7
compatible      3
complaint       6
complete        7
complicat       2
comput          12
condition       7
conect          4
conector        2
consider        3
constant        2
contact         4
control         6
convenient      3
cool            7
cord            5
correct         3
cost            9
could           22
count           2
couple          3
cov             2
crash           3
crashe          2
creative        8
credit          2
custom          6
cute            4
cuz             2
cymbal          2
dad             3
dai             2
damag           2
damage          2
data            2
daught          11
daughter        2
day             22
dead            5
deal            8
defective       3
definate        3
definite        4
delhi           2
deliver         2
delivery        2
dent            3
describ         4
describe        2
deserve         2
design          6
develop         2
device          15
di              10
diap            2
did             30
didnt           3
die             2
different       8
difficult       3
digg            2
digital         4
direct          2
direction       2
dirty           2
disappoint      6
disc            4
display         5
do              76
doe             39
doesnt          5
dog             4
dont            10
down            4
download        8
drain           3
drink           5
driv            2
drive           10
dropp           2
dur             3
durable         3
dvd             10
each            2
ear             2
earbud          2
easi            7
easy            49
eat             3
effective       2
effort          2
elegant         2
elliptical      2
else            7
email           5
end             3
energy          7
enjoy           8
enough          10
entire          2
equipment       4
especial        2
etc             2
ev              21
even            28
eventual        2
everthing       2
every           13
everything      10
everywhere      4
exact           4
excellent       14
except          3
exercis         2
exercise        14
expect          10
expensive       5
experienc       2
experience      4
extra           6
extreme         2
face            2
fail            4
fall            3
fami            3
fantastic       3
far             13
fast            10
fat             3
fault           3
favorite        6
feature         12
feedback        2
feel            12
few             5
figur           2
figure          4
file            8
fill            3
final           3
find            6
fine            11
firmware        2
first           20
fit             6
fitness         2
five            2
flash           5
flashlight      2
flat            2
flavor          4
flaw            2
floor           4
fm              9
food            2
for             230
force           3
forev           5
form            2
format          2
found           10
four            2
fragile         2
free            7
freeze          5
friend          12
from            53
froze           5
full            4
functionality   2
fundamental     2
gadget          2
game            3
gave            5
gb              19
gen             4
get             44
gett            4
gift            12
girl            2
give            13
glad            5
go              24
goe             2
good            72
got             28
gotten          3
great           141
green           2
guess           2
guest           2
guitar          5
guy             2
gym             4
h               5
ha              44
had             46
half            4
hand            6
handl           2
handle          4
handy           5
hang            2
happen          4
happy           21
hard            15
hardware        2
hav             4
have            103
he              19
head            3
headphone       10
healthy         2
hear            3
heard           4
heavy           2
help            4
helpful         2
here            5
hi              6
high            12
hold            15
home            5
hooah           3
hope            4
horrible        5
horse           3
hotel           13
hour            11
house           2
how             16
howev           4
hungry          2
hurt            2
husband         6
hype            2
i               278
id              2
idea            3
if              38
ill             2
im              14
impossible      2
in              107
inaccurate      3
includ          4
inferior        4
info            2
information     2
inside          2
install         3
instead         3
instruction     6
instrument      2
interface       2
internet        2
into            5
invest          2
ipod            64
iriv            2
isnt            2
it              589
item            41
itself          4
ive             23
jump            4
junk            12
just            36
kazoo           2
keep            8
kept            2
key             3
kid             10
kind            3
know            15
l               2
lack            2
lady            2
large           5
last            15
lat             4
late            3
lcd             3
learn           3
least           3
less            6
let             3
level           2
lexar           2
life            14
light           10
lightweight     3
like            51
line            4
list            3
listen          10
little          18
load            5
location        3
lock            2
long            11
look            23
loose           4
lose            2
lost            2
lot             24
loud            2
lov             6
love            56
low             5
machine         8
made            13
major           2
mak             2
make            21
manual          2
manufactur      3
many            8
market          3
mat             2
matt            5
max             2
may             3
maybe           3
mb              4
me              35
mean            2
measurement     2
media           2
meditation      2
memory          9
mention         2
menu            2
mess            2
met             4
mic             7
microphone      8
microsoft       3
might           5
military        2
million         2
mine            7
minute          6
miss            3
mode            2
model           8
mom             2
money           31
monitor         7
monst           2
month           28
more            43
most            6
mouse           2
movie           3
mp              46
much            33
multiple        3
music           35
musical         2
must            3
my              139
myself          2
nano            15
navigation      2
ne              10
near            3
neck            2
need            9
negative        3
nev             23
new             15
next            4
nice            23
nifty           2
night           2
nitru           2
no              50
noise           2
nokia           3
nor             4
not             236
note            2
notebook        2
nothing         8
notice          2
now             22
o               2
octob           2
of              165
off             7
offer           3
often           3
ok              3
old             11
on              116
once            9
one             73
onto            4
open            6
operate         3
opinion         2
option          4
or              27
ord             8
order           11
oregon          3
oth             19
other           4
otherwise       2
our             5
out             44
ov              12
over            3
overall         2
overpric        2
own             11
p               3
package         7
page            3
paid            3
pain            3
palm            2
pap             3
pay             12
pedomet         5
people          7
perfect         18
perform         3
performance     3
perhap          2
personal        2
phone           8
photo           5
pic             3
pick            5
picture         9
piece           9
pillow          4
pink            3
place           7
plastic         2
play            85
player          4
pleas           9
please          2
plenty          2
plu             2
pod             2
point           2
pool            2
poor            4
pop             2
portable        7
pound           2
pow             3
present         7
pressure        4
pretty          10
previou         2
pric            2
price           42
print           4
probab          5
problem         23
produc          2
product         86
promis          5
proper          2
proprietary     2
provide         2
purchas         17
purchase        7
purse           2
put             4
quality         35
quick           7
quit            2
quite           7
radio           14
random          2
range           2
rate            4
rath            2
rca             2
read            10
real            38
reason          5
reasonable      2
receipt         2
receiv          11
recent          2
recharge        2
reciev          7
recogniz        2
recomend        2
recommend       24
record          6
refund          5
refuse          2
regret          2
relative        2
reliable        3
rememb          2
rep             2
repair          4
replac          3
replace         2
requir          3
reset           3
respond         5
response        2
rest            2
restart         2
result          5
return          20
review          9
right           11
rio             5
roll            2
room            8
rope            2
run             11
safe            3
said            5
sale            2
same            11
samsung         3
sandisk         7
sansa           3
satisfi         5
sav             2
save            5
saw             3
say             20
scientific      3
scratch         3
scratche        4
screen          20
screw           6
sd              3
second          6
secure          2
see             6
seem            17
seen            3
sell            6
seller          2
send            5
sense           2
sent            8
service         24
set             8
sett            2
several         8
shape           6
shave           2
she             16
shipp           18
shock           3
short           6
should          12
show            8
shuffle         2
shutt           2
sign            2
simp            2
simple          3
since           8
site            2
size            20
sleek           3
slight          2
slim            2
slow            3
small           21
snack           2
snug            2
so              53
soft            2
software        11
sold            3
solid           4
some            11
someone         6
something       9
son             8
song            21
sony            6
soon            2
soooo           2
sound           38
south           2
space           7
speak           2
spec            3
special         2
spend           5
spent           5
spin            3
sport           2
st              2
staff           3
stand           5
star            6
start           11
stat            2
stay            18
stereo          2
stiff           3
still           16
stink           2
stinky          2
stop            6
stopp           6
stor            2
storage         3
store           8
string          3
strong          2
stuff           3
stupid          2
sturdy          4
such            8
suck            5
sugar           2
suggest         5
summ            2
support         4
suppos          2
suprising       2
sure            4
system          7
tak             2
take            13
talk            4
tape            2
target          2
tast            2
taste           5
tell            4
tempo           2
terrible        8
textbook        2
th              28
than            28
thank           15
that            89
the             497
their           7
them            25
then            15
there           25
these           23
they            44
theyre          3
thi             301
thin            2
thing           5
think           14
third           3
tho             2
those           5
though          8
thought         3
three           9
through         5
thru            2
thumb           2
tight           3
tighten         5
time            47
tiny            5
title           2
to              326
today           3
toilet          4
ton             3
too             23
took            4
tool            3
toothbrush      3
top             2
toss            2
total           5
tourist         2
toy             3
track           3
transf          8
trash           2
travel          4
tri             12
try             7
tun             7
turn            10
tv              4
twice           4
two             22
type            4
und             2
understand      2
unfortunate     2
unit            10
unless          3
until           10
up              34
update          2
upgrad          2
upgrade         3
upload          2
upset           2
us              29
usb             11
use             83
useful          3
useless         3
value           8
vendor          2
version         4
very            99
video           13
vista           2
volume          2
wa              114
wait            2
walk            2
walmart         2
want            17
wasnt           3
waste           16
watch           5
way             14
we              15
wear            4
web             2
website         4
week            17
weight          7
well            23
went            6
were            11
what            37
when            33
where           2
which           14
while           14
who             13
whole           4
why             6
wife            4
will            36
window          8
wipe            2
wish            6
with            110
within          8
without         7
wo              10
wonderful       4
word            2
work            97
worse           4
worst           10
worth           17
worthless       2
would           49
wrong           4
xlr             2
xp              5
yahoo           3
ye              3
year            23
yet             4
you             115
young           3
your            31
youre           4
yr              3
zen             4
zune            2
