</stop>                         270
able                            2
absolute                        3
actual                          2
adapt                           2
addition                        2
address                         2
again                           2
ago                             5
agree                           2
almost                          7
alone                           2
along                           2
already                         4
although                        2
alway                           3
amazon                          7
amount                          2
anoth                           7
anymore                         2
anyone                          4
anything                        8
apart                           2
apple                           7
archo                           2
around                          3
arriv                           2
arrive                          3
ask                             3
average                         2
avoid                           2
aware                           2
away                            7
backpack                        2
bad                             13
bar                             2
basical                         2
batterie                        3
battery                         11
be                              3
before                          5
begin                           2
bett                            11
between                         2
beware                          2
big                             2
biofeedback                     2
bit                             3
black                           5
body                            2
boston                          2
both                            2
bought                          22
box                             3
brand                           2
break                           6
broke                           9
broken                          4
buck                            2
bud                             3
button                          3
buy                             31
calendar                        2
camera                          2
canot                           2
card                            9
cash                            2
caus                            2
cd                              2
chang                           3
charg                           3
charge                          8
cheap                           13
check                           3
child                           2
clean                           2
clear                           2
club                            2
company                         3
compatible                      3
complete                        4
complicat                       2
comput                          9
condition                       2
conect                          3
consider                        3
contact                         4
control                         2
correct                         2
cost                            3
couple                          3
crash                           4
crashe                          3
creative                        3
cute                            2
cuz                             2
daught                          2
day                             9
dead                            5
defective                       3
deliv                           2
deliver                         2
dent                            3
deserve                         2
design                          2
device                          8
di                              7
didnt                           3
different                       3
difficult                       3
disappoint                      6
disc                            2
display                         4
do                              3
doesnt                          6
dog                             2
dont                            6
down                            5
download                        7
drain                           2
drink                           4
drive                           6
dvd                             5
easi                            2
easy                            4
effect                          2
effort                          2
elliptical                      2
else                            3
email                           3
end                             2
enough                          5
entire                          2
ev                              9
eventual                        2
every                           5
everything                      3
everywhere                      2
exercise                        6
expect                          4
expensive                       5
experienc                       2
experience                      4
fail                            4
far                             4
fat                             2
fault                           2
feature                         2
feel                            3
few                             4
figure                          3
file                            4
final                           3
find                            3
fine                            5
fit                             3
five                            2
flash                           3
flashlight                      2
flaw                            2
fm                              3
fool                            2
force                           3
forev                           2
found                           7
four                            2
fragile                         2
free                            2
freeze                          3
friend                          2
froze                           4
full                            2
functionality                   2
game                            2
gb                              8
gett                            5
gift                            4
go                              6
good                            15
gotten                          2
great                           8
guess                           2
guitar                          3
guy                             2
half                            3
hand                            2
hang                            2
happen                          3
happy                           5
hard                            9
hardware                        2
hate                            2
head                            2
headphone                       5
heard                           2
heavy                           2
here                            2
high                            2
hold                            5
horrible                        5
hotel                           6
hour                            10
howev                           2
hr                              2
hype                            2
idea                            2
im                              6
impossible                      2
inaccurate                      4
includ                          2
inferior                        3
install                         2
instead                         4
interface                       2
internet                        2
invest                          2
ipod                            21
iriv                            2
item                            22
itself                          2
ive                             10
junk                            7
kazoo                           2
kept                            2
kid                             4
know                            9
l                               2
lack                            2
large                           2
last                            6
lat                             3
late                            2
lcd                             2
less                            2
let                             3
lexar                           2
life                            5
light                           4
like                            17
list                            2
little                          4
load                            2
lock                            2
long                            4
look                            2
loose                           3
lost                            3
lot                             6
love                            2
machine                         2
made                            8
make                            7
manual                          2
manufactur                      2
many                            4
matt                            4
max                             2
may                             3
maybe                           4
mb                              3
mean                            2
measurement                     2
media                           2
memory                          5
mess                            2
met                             2
microsoft                       2
might                           2
minute                          6
miss                            2
mode                            2
model                           3
money                           16
monitor                         2
monst                           2
month                           18
more                            22
mouse                           2
mp                              7
much                            4
multiple                        2
music                           11
ne                              2
need                            3
nev                             12
new                             8
next                            3
nice                            4
no                              17
nor                             3
not                             88
notebook                        2
nothing                         5
o                               2
octob                           2
off                             7
often                           3
ok                              2
old                             6
once                            5
onto                            3
open                            2
operate                         2
ord                             7
order                           4
overall                         2
overpric                        2
own                             3
page                            3
paid                            2
pain                            2
pair                            2
palm                            2
pap                             2
pay                             8
pedomet                         2
pedometer                       2
people                          3
perfect                         2
perhap                          2
philip                          2
phone                           2
photo                           2
pick                            3
piece                           2
place                           6
plastic                         2
play                            34
poor                            4
portable                        2
pound                           3
pow                             2
present                         3
pretty                          4
previou                         2
pric                            2
price                           3
problem                         11
product                         36
promis                          4
prone                           2
proper                          2
proprietary                     2
provide                         2
purchas                         8
purchase                        3
put                             2
quality                         11
quick                           3
quite                           4
radio                           2
random                          2
range                           2
rate                            2
read                            4
real                            7
reason                          3
reasonable                      2
receipt                         2
receiv                          8
reciev                          2
recogniz                        2
recommend                       10
record                          2
reliable                        2
rememb                          2
repair                          3
replac                          2
replace                         2
requir                          2
reset                           2
respond                         3
rest                            2
restart                         2
return                          13
review                          6
right                           4
rio                             2
room                            2
rope                            2
run                             2
same                            5
samsung                         2
sandisk                         6
scientific                      2
scratch                         3
scratche                        3
screen                          8
screw                           5
sd                              2
second                          5
seem                            4
sell                            4
send                            4
sense                           2
sent                            5
service                         10
set                             4
several                         5
shipp                           6
shock                           3
short                           6
show                            2
shuffle                         2
sign                            2
since                           3
slow                            3
small                           7
so                              2
software                        6
sold                            2
someone                         3
something                       2
sometime                        2
son                             3
song                            9
sony                            5
sound                           4
spec                            3
spend                           5
spent                           3
spin                            2
st                              2
star                            3
start                           5
stat                            2
stay                            10
stiff                           2
still                           6
stinky                          2
stopp                           2
store                           2
stuff                           2
stupid                          2
sturdy                          2
such                            4
suck                            5
sudden                          2
suggest                         2
support                         4
sure                            2
switch                          2
system                          2
tak                             2
take                            8
talk                            2
tell                            3
terrible                        7
textbook                        2
th                              15
thank                           2
that                            2
there                           3
therefore                       2
third                           2
tho                             2
though                          4
three                           8
thru                            2
tighten                         4
time                            25
tip                             2
today                           3
toilet                          3
too                             9
took                            2
toothbrush                      2
total                           3
touch                           2
tourist                         2
toy                             3
transfer                        2
trash                           2
tri                             8
try                             3
tun                             2
turn                            7
twice                           3
unable                          2
und                             2
unfortunate                     2
unit                            5
unless                          2
until                           8
upgrade                         2
upload                          2
upset                           2
us                              14
usb                             6
useless                         4
vendor                          2
version                         2
very                            27
video                           3
wasnt                           3
waste                           3
watch                           2
wear                            2
web                             2
website                         3
week                            10
weight                          3
while                           5
whole                           3
why                             4
window                          5
wipe                            2
wish                            4
work                            11
worse                           4
worst                           8
worth                           11
worthless                       2
wrong                           2
xp                              4
ye                              2
year                            7
you                             4
youre                           2
zen                             2
