aaa                             2
able                            2
accurate                        5
adapt                           4
add                             4
adult                           2
advertis                        3
affordable                      3
ago                             3
airport                         2
album                           4
allow                           2
almost                          5
alway                           4
amaz                            7
amazon                          4
anoth                           3
anyone                          5
anywhere                        3
apple                           2
arm                             2
around                          4
arriv                           2
attention                       2
awesome                         2
awsome                          2
baby                            3
bad                             4
ball                            2
band                            4
bar                             6
basi                            2
bass                            2
batterie                        6
battery                         2
be                              3
beautiful                       2
before                          6
bell                            2
best                            12
bett                            13
big                             4
bike                            6
birthday                        2
book                            2
bose                            2
both                            7
bought                          17
brand                           3
built                           2
business                        4
buy                             16
bye                             2
cable                           2
camera                          4
car                             2
card                            4
care                            3
carry                           5
case                            3
cd                              4
certain                         3
cheap                           4
christma                        4
class                           2
clean                           7
clear                           5
clip                            5
close                           2
combination                     2
comfortable                     3
common                          2
compact                         7
company                         2
complaint                       4
complete                        2
comput                          2
condition                       3
control                         3
convenient                      3
cool                            5
cord                            4
cost                            5
cover                           2
creative                        2
cute                            2
cymbal                          3
dad                             3
damage                          2
daught                          6
daughter                        2
day                             2
deal                            5
definate                        3
definite                        2
delhi                           2
delivery                        3
describ                         3
describe                        2
description                     2
device                          5
diap                            2
different                       4
digg                            2
digital                         3
direct                          2
dog                             3
dont                            2
download                        3
drive                           4
drum                            4
durable                         2
dvd                             3
easi                            4
easy                            31
eat                             2
effective                       2
elegant                         2
else                            3
energy                          3
enjoy                           7
enough                          4
equipment                       3
especial                        2
ev                              7
every                           4
everything                      8
everywhere                      3
exact                           2
excellent                       11
except                          2
exercise                        3
expect                          4
extra                           5
extreme                         2
face                            2
fantastic                       4
far                             9
fast                            5
favorite                        2
feature                         7
feel                            3
fell                            2
figur                           2
file                            3
fill                            2
find                            3
fine                            4
fit                             4
fitness                         2
flash                           2
flavor                          4
floor                           3
food                            2
forev                           3
forget                          2
form                            2
found                           4
free                            3
friend                          7
full                            2
fun                             2
gadget                          2
gb                              9
gen                             4
general                         2
gift                            7
girl                            2
glad                            5
go                              5
good                            41
great                           54
guess                           2
guitar                          2
gym                             3
hand                            2
handl                           2
handle                          3
handy                           5
happen                          2
happy                           12
hard                            5
hav                             4
have                            2
headphone                       4
healthy                         2
hear                            2
heard                           4
help                            3
here                            3
high                            2
hold                            8
home                            4
hooah                           3
hope                            3
horse                           3
hotel                           5
house                           2
huge                            2
hungry                          2
hurt                            2
husband                         3
id                              2
im                              5
includ                          2
inexpensive                     2
inside                          2
instruction                     3
instrument                      2
ipod                            19
item                            13
itself                          2
ive                             6
keep                            7
key                             2
kind                            2
know                            4
large                           2
last                            8
learn                           2
least                           2
less                            2
life                            5
light                           4
lightweight                     3
like                            24
line                            3
listen                          6
little                          11
location                        3
long                            5
look                            5
lose                            2
lot                             15
loud                            2
lov                             4
love                            34
low                             4
machine                         5
made                            5
make                            5
man                             2
many                            5
mat                             2
media                           2
memory                          4
met                             2
mic                             5
microphone                      6
might                           2
military                        2
million                         2
model                           2
mom                             2
money                           3
monitor                         3
month                           6
more                            17
move                            2
movie                           2
mp                              5
much                            14
music                           17
musical                         2
must                            3
nano                            9
ne                              7
near                            2
need                            9
negative                        2
nev                             6
new                             5
nice                            15
nifty                           2
night                           2
no                              14
noise                           2
nokia                           3
not                             47
note                            2
oh                              2
ok                              2
old                             7
once                            4
one                             3
open                            4
opinion                         2
option                          5
order                           4
other                           2
over                            2
own                             4
p                               3
package                         7
pay                             2
pedomet                         3
pen                             2
people                          3
perfect                         10
perform                         2
performance                     3
phone                           8
photo                           3
pic                             2
pick                            2
picture                         9
piece                           3
pillow                          3
pink                            3
place                           3
play                            26
pleas                           5
plenty                          2
pocket                          2
pod                             2
portable                        4
present                         4
pretty                          3
price                           23
print                           2
probab                          3
problem                         8
produc                          2
product                         29
purchas                         7
purchase                        3
purse                           2
put                             3
quality                         14
quick                           2
quite                           3
radio                           8
rate                            2
read                            5
real                            11
reason                          2
receiv                          4
reciev                          5
recommend                       7
record                          4
reliable                        2
requir                          2
result                          3
review                          3
right                           6
rio                             3
rock                            2
roll                            2
room                            5
run                             7
safe                            3
same                            3
sansa                           2
satisfi                         3
say                             2
screen                          6
secure                          2
seem                            7
sent                            2
service                         11
set                             5
several                         2
shape                           4
shave                           2
shipp                           6
show                            7
simple                          4
since                           4
size                            14
sleek                           2
slight                          2
slim                            2
small                           14
snack                           3
snug                            2
soft                            2
software                        3
solid                           3
someone                         4
something                       8
son                             4
song                            9
soooo                           2
sound                           16
south                           2
space                           4
speak                           2
special                         2
spent                           2
staff                           2
stand                           5
star                            3
start                           6
stay                            3
stereo                          2
still                           6
stor                            2
storage                         5
store                           6
strap                           2
strong                          2
stuff                           2
sturdy                          2
such                            2
summ                            2
suppos                          2
sure                            4
system                          4
take                            3
talk                            2
tast                            3
taste                           4
tempo                           2
th                              11
thank                           4
theyre                          2
thin                            2
thing                           5
though                          2
through                         5
tight                           2
time                            15
tiny                            2
ton                             2
too                             5
tool                            3
top                             2
total                           2
tough                           2
track                           2
transf                          4
travel                          2
tri                             3
try                             3
tun                             3
tv                              3
type                            3
until                           2
upgrad                          2
us                              14
usb                             2
use                             4
useful                          3
utility                         2
value                           5
version                         2
very                            17
video                           8
walk                            2
want                            8
watch                           2
wear                            2
week                            2
weight                          4
while                           8
why                             2
wife                            3
window                          2
wish                            2
without                         6
wonderful                       6
work                            9
worth                           2
wrong                           3
xlr                             2
year                            3
yet                             3
you                             2
young                           2
youre                           2
yr                              2
zen                             5
