aaa                             2
able                            3
accurate                        4
adapt                           4
add                             4
adult                           2
advertis                        3
affordable                      3
ago                             3
airport                         2
album                           4
allow                           2
almost                          4
alway                           4
amaz                            9
amazon                          4
anoth                           2
anyone                          3
anywhere                        3
apple                           3
around                          5
arriv                           2
attention                       2
awesome                         2
awsome                          2
baby                            3
bad                             5
ball                            2
band                            5
bar                             4
basi                            2
bass                            2
batterie                        5
battery                         3
be                              3
beautiful                       3
before                          4
bell                            2
best                            11
bett                            11
big                             4
bike                            6
birthday                        2
book                            2
bose                            2
both                            6
bought                          19
brand                           2
built                           2
business                        3
buy                             17
bye                             2
cable                           3
camera                          6
car                             3
card                            4
care                            3
carry                           6
case                            2
cd                              4
certain                         3
cheap                           5
christma                        3
class                           2
clean                           6
clear                           5
clip                            5
close                           2
combination                     2
comfortable                     2
common                          2
compact                         5
company                         2
complaint                       4
complete                        2
comput                          2
condition                       3
control                         3
convenient                      2
cool                            7
cord                            5
cost                            6
cover                           2
creative                        2
cute                            2
cymbal                          3
dad                             3
damage                          2
daught                          6
daughter                        2
day                             2
deal                            5
definate                        2
definite                        2
delhi                           2
delivery                        3
describ                         3
describe                        2
description                     2
design                          2
device                          4
diap                            2
different                       4
digg                            2
digital                         2
direct                          2
dog                             3
dont                            2
download                        3
drive                           4
drum                            4
durable                         2
dvd                             4
easi                            3
easy                            29
eat                             2
effective                       2
elegant                         2
else                            3
energy                          3
enjoy                           6
enough                          4
equipment                       2
especial                        2
ev                              8
every                           4
everything                      8
everywhere                      2
exact                           2
excellent                       13
except                          2
exercise                        7
expect                          6
extra                           5
extreme                         2
face                            2
fantastic                       4
far                             9
fast                            5
favorite                        3
feature                         6
feel                            3
fell                            2
figur                           2
file                            3
fill                            2
find                            3
fine                            4
fit                             4
fitness                         2
flash                           2
flavor                          3
floor                           3
food                            2
forev                           3
forget                          2
form                            2
found                           2
free                            3
friend                          9
full                            2
fun                             2
gadget                          2
gb                              8
gen                             4
general                         2
gift                            6
girl                            2
glad                            5
go                              5
good                            39
great                           56
guess                           2
guitar                          2
gym                             4
hand                            3
handl                           2
handle                          3
handy                           3
happen                          2
happy                           9
hard                            5
hav                             4
have                            2
headphone                       3
healthy                         2
hear                            2
heard                           4
help                            3
here                            3
high                            3
hold                            8
home                            4
hooah                           3
hope                            2
horse                           3
hotel                           5
house                           2
huge                            2
hungry                          2
hurt                            2
husband                         2
id                              2
im                              5
includ                          2
inexpensive                     2
inside                          2
instruction                     2
instrument                      2
ipod                            22
item                            11
itself                          2
ive                             6
keep                            7
key                             2
kid                             2
kind                            2
know                            3
large                           3
last                            7
learn                           2
least                           2
less                            3
life                            5
light                           5
lightweight                     3
like                            25
line                            3
listen                          7
little                          12
location                        3
long                            5
look                            4
lose                            2
lot                             14
loud                            2
lov                             5
love                            34
low                             4
machine                         5
made                            5
make                            9
man                             2
many                            5
mat                             2
media                           2
memory                          5
met                             2
mic                             3
microphone                      6
might                           2
military                        2
million                         2
model                           2
mom                             2
money                           3
monitor                         2
month                           5
more                            17
move                            2
movie                           2
mp                              6
much                            13
music                           17
musical                         2
must                            2
nano                            9
ne                              5
near                            2
need                            8
negative                        2
nev                             5
new                             4
nice                            17
nifty                           2
night                           2
no                              14
noise                           2
nokia                           2
not                             44
note                            2
oh                              2
ok                              2
old                             7
once                            2
one                             4
open                            4
opinion                         2
option                          4
order                           4
other                           2
over                            2
own                             6
p                               3
package                         7
pay                             2
pedomet                         2
pen                             2
people                          3
perfect                         9
perform                         2
performance                     2
phone                           8
photo                           3
pic                             2
pick                            2
picture                         8
piece                           3
pillow                          3
pink                            3
place                           2
play                            28
pleas                           7
plenty                          2
pocket                          2
pod                             2
portable                        4
present                         4
pretty                          2
price                           27
print                           3
probab                          4
problem                         8
produc                          2
product                         27
purchas                         7
purchase                        4
purse                           2
put                             3
quality                         17
quick                           3
quite                           3
radio                           8
rate                            2
read                            6
real                            16
reason                          2
receiv                          4
reciev                          2
recommend                       8
record                          4
reliable                        2
requir                          2
result                          3
review                          3
right                           7
rio                             3
rock                            2
roll                            2
room                            5
run                             8
safe                            2
same                            3
sansa                           2
satisfi                         3
say                             2
screen                          5
secure                          2
seem                            5
sent                            2
service                         11
set                             5
several                         2
shape                           5
shave                           2
shipp                           6
show                            8
simple                          4
since                           4
size                            16
sleek                           2
slight                          2
slim                            2
small                           17
snack                           3
snug                            2
soft                            2
software                        4
solid                           4
someone                         4
something                       8
son                             3
song                            10
soooo                           2
sound                           15
south                           2
space                           4
speak                           2
special                         3
spent                           2
staff                           2
stand                           5
star                            3
start                           6
stay                            4
stereo                          2
still                           5
stor                            2
storage                         5
store                           6
strap                           2
strong                          2
stuff                           2
sturdy                          2
such                            4
summ                            2
suppos                          2
sure                            3
system                          5
take                            4
talk                            2
tast                            2
taste                           3
tempo                           2
th                              12
thank                           6
theyre                          2
thin                            2
thing                           4
though                          3
through                         4
tight                           2
time                            14
tiny                            3
ton                             2
too                             4
tool                            3
top                             2
total                           2
tough                           2
track                           2
transf                          4
travel                          4
tri                             3
try                             3
tun                             3
tv                              2
type                            3
understand                      2
unit                            3
until                           2
upgrad                          2
us                              14
usb                             3
use                             4
useful                          3
utility                         2
value                           6
version                         2
very                            20
video                           7
walk                            2
want                            7
watch                           2
wear                            2
week                            2
weight                          4
while                           8
why                             2
wife                            2
window                          2
wish                            2
without                         5
wonderful                       5
work                            9
worth                           2
wrong                           4
xlr                             2
year                            3
yet                             3
you                             2
young                           2
youre                           2
yr                              2
zen                             5
