</stop>                         540
aaa                             3
able                            4
absolut                         2
absolute                        2
accurate                        4
actual                          4
adapt                           6
add                             4
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      3
afraid                          2
again                           5
ago                             6
agree                           2
airport                         2
album                           4
allow                           3
almost                          9
alone                           2
along                           3
alot                            2
already                         5
although                        3
alway                           6
amaz                            9
amazo                           2
amazon                          9
amazone                         2
amount                          3
amp                             2
anoth                           10
answ                            2
anymore                         2
anyone                          6
anything                        10
anywhere                        3
apart                           2
apple                           8
archo                           2
around                          8
arriv                           6
arrive                          3
ask                             3
attention                       2
audio                           2
available                       2
avoid                           3
aware                           2
away                            5
awesome                         2
awsome                          2
baby                            3
backpack                        3
bad                             16
ball                            2
band                            6
bar                             6
basi                            2
basical                         2
bass                            2
batterie                        8
battery                         11
be                              6
beautiful                       3
become                          2
before                          8
begin                           2
believe                         2
bell                            2
best                            11
bett                            20
between                         2
beware                          2
big                             6
bike                            6
biofeedback                     2
birthday                        3
bit                             2
black                           5
body                            3
book                            2
boost                           2
bose                            2
boston                          2
both                            10
bought                          39
box                             5
brand                           4
break                           6
broke                           9
broken                          5
brought                         2
buck                            2
bud                             3
built                           3
business                        3
button                          7
buy                             40
bye                             2
cable                           4
calendar                        2
camera                          8
car                             4
card                            11
care                            3
carry                           7
case                            3
cash                            3
caus                            2
cd                              6
cent                            2
certain                         3
chang                           4
charg                           3
charge                          8
cheap                           12
check                           3
child                           3
children                        2
christma                        6
city                            2
class                           2
clean                           8
clear                           6
clip                            5
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     3
common                          3
compact                         5
company                         4
compatible                      2
complaint                       4
complete                        7
complicat                       2
comput                          9
condition                       5
conect                          3
conector                        2
consider                        3
constant                        2
contact                         3
control                         5
convenient                      2
cool                            7
copy                            2
cord                            5
correct                         2
cost                            9
count                           2
couple                          3
cov                             2
cover                           2
crash                           5
crashe                          2
creative                        5
cute                            3
cuz                             2
cymbal                          3
dad                             4
dai                             2
damag                           2
damage                          3
data                            2
daught                          7
daughter                        2
day                             10
dead                            4
deal                            6
defective                       3
definate                        2
definite                        2
delhi                           2
deliv                           2
deliver                         3
delivery                        3
dent                            3
describ                         4
describe                        2
description                     2
deserve                         2
design                          5
develop                         2
device                          9
di                              7
diap                            2
didnt                           2
die                             2
different                       7
difficult                       2
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      5
disc                            2
disk                            2
display                         4
do                              4
doesnt                          6
dog                             5
dollar                          2
dont                            4
down                            4
download                        8
drain                           2
drink                           5
driv                            2
drive                           9
dropp                           2
drum                            4
dur                             2
durable                         3
dvd                             11
easi                            5
easy                            33
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            6
email                           3
end                             3
energy                          3
enjoy                           7
enough                          7
entire                          2
equipment                       3
especial                        2
etc                             2
ev                              20
eventual                        2
everthing                       2
every                           8
everything                      10
everywhere                      4
exact                           2
excellent                       13
except                          3
exercis                         2
exercise                        11
expect                          10
expensive                       6
experienc                       2
experience                      4
extra                           5
extreme                         2
face                            2
fail                            6
fami                            2
fantastic                       4
far                             13
fast                            6
fat                             2
fault                           3
favorite                        4
feature                         9
feedback                        2
feel                            5
few                             4
figur                           2
figure                          4
file                            8
fill                            2
final                           3
find                            6
fine                            7
fit                             7
fitness                         2
five                            2
flash                           3
flashlight                      2
flat                            2
flavor                          3
flaw                            2
floor                           2
food                            2
fool                            2
force                           3
forev                           3
forget                          2
form                            3
format                          2
found                           7
four                            2
fragile                         2
free                            6
freeze                          3
friend                          12
froze                           4
full                            2
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              13
gen                             4
general                         3
gett                            6
gift                            10
girl                            2
glad                            5
go                              11
good                            46
gotten                          3
great                           59
green                           2
guess                           4
guest                           2
guitar                          7
guy                             2
gym                             4
half                            4
hand                            6
handl                           2
handle                          3
handy                           3
hang                            2
happen                          5
happy                           12
hard                            14
hardware                        2
hate                            2
hav                             4
have                            2
headphone                       9
healthy                         2
hear                            3
heard                           6
heavy                           3
help                            4
helpful                         2
here                            5
high                            5
hold                            10
home                            5
hooah                           3
horrible                        5
horse                           3
hotel                           8
hour                            6
house                           2
howev                           3
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         2
hype                            2
id                              3
idea                            3
ill                             2
im                              8
impossible                      2
inaccurate                      3
includ                          4
inexpensive                     2
inferior                        4
info                            2
information                     2
inside                          3
install                         3
instead                         4
instruction                     5
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            37
iriv                            2
isnt                            2
issue                           2
item                            28
itself                          3
ive                             12
junk                            6
kazoo                           2
keep                            8
kept                            2
key                             2
kid                             4
kind                            3
know                            13
l                               2
lack                            2
lady                            2
laptop                          2
large                           5
last                            13
lat                             4
late                            2
lcd                             2
learn                           3
least                           3
less                            5
let                             3
level                           2
lexar                           2
life                            10
light                           10
lightweight                     3
like                            36
line                            4
list                            2
listen                          8
little                          17
load                            4
location                        4
lock                            2
long                            6
look                            6
loose                           4
lose                            2
lost                            3
lot                             18
loud                            2
lov                             6
love                            35
low                             3
m                               2
machine                         7
made                            13
major                           2
mak                             2
make                            16
man                             2
manual                          2
manufactur                      2
many                            8
market                          2
mat                             2
matt                            5
max                             2
may                             3
maybe                           4
mb                              4
mean                            2
measurement                     2
media                           4
meditation                      2
memory                          9
mention                         2
menu                            2
mess                            2
met                             4
mic                             3
microphone                      6
microsoft                       3
might                           5
military                        2
million                         2
minute                          8
miss                            2
mode                            2
model                           7
mom                             2
money                           18
monitor                         4
monst                           2
month                           21
more                            33
mouse                           2
move                            2
movie                           3
mp                              13
much                            16
multiple                        2
music                           27
musical                         2
must                            2
myself                          2
nano                            8
navigation                      2
ne                              7
near                            2
neck                            2
need                            11
negative                        3
nev                             14
new                             10
next                            2
nice                            20
nifty                           2
night                           2
no                              29
noise                           2
nokia                           2
nor                             3
not                             124
note                            2
notebook                        2
nothing                         6
notice                          2
o                               2
octob                           2
off                             8
offer                           2
often                           3
oh                              2
ok                              4
old                             12
omron                           2
once                            7
one                             4
onto                            4
open                            5
operate                         3
opinion                         2
option                          5
ord                             8
order                           8
other                           3
otherwise                       2
over                            3
overall                         3
overpric                        2
own                             9
p                               3
package                         7
page                            2
paid                            3
pain                            3
pair                            2
palm                            2
pap                             3
pay                             10
pedomet                         3
pedometer                       2
pen                             2
people                          6
perfect                         11
perform                         2
performance                     2
perhap                          2
personal                        2
philip                          2
phone                           10
photo                           4
pic                             3
pick                            6
picture                         7
piece                           5
pillow                          4
pink                            3
place                           8
plastic                         2
play                            54
pleas                           7
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        5
pound                           3
pow                             2
present                         7
pretty                          7
previou                         2
pric                            2
price                           32
print                           3
probab                          4
problem                         19
produc                          2
product                         59
promis                          4
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         15
purchase                        5
purse                           2
put                             4
quality                         26
quick                           6
quite                           7
radio                           10
random                          2
range                           2
rate                            4
rath                            2
read                            8
real                            26
reason                          5
receipt                         2
receiv                          10
recharge                        2
reciev                          3
recogniz                        2
recommend                       11
record                          7
refuse                          2
relative                        2
reliable                        4
rememb                          2
repair                          4
replac                          3
replace                         2
requir                          4
reset                           3
respond                         6
response                        2
rest                            2
restart                         2
result                          4
return                          13
review                          7
right                           11
rio                             5
rock                            2
roll                            2
room                            7
rope                            2
run                             10
safe                            2
same                            8
samsung                         2
sandisk                         4
sansa                           3
satisfi                         4
sav                             2
save                            2
say                             3
scientific                      2
scratch                         2
scratche                        4
screen                          13
screw                           3
sd                              3
second                          5
secure                          2
seem                            11
select                          2
sell                            5
seller                          2
send                            5
sense                           2
sent                            6
service                         17
set                             8
sett                            2
several                         5
shape                           5
shave                           2
shipp                           12
shock                           2
short                           4
show                            10
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          4
since                           8
site                            2
size                            15
sleek                           2
slight                          2
slim                            2
slow                            3
small                           21
snack                           3
snug                            2
soft                            2
software                        11
sold                            2
solid                           4
someone                         5
something                       10
sometime                        3
son                             6
song                            19
sony                            6
soon                            2
soooo                           3
sound                           19
south                           2
space                           5
speak                           2
spec                            3
special                         3
spend                           5
spent                           5
spin                            3
sport                           2
st                              2
staff                           3
stand                           5
star                            6
start                           13
stat                            2
stay                            15
stereo                          2
stick                           2
stiff                           3
still                           9
stinky                          2
stop                            3
stopp                           4
stor                            2
storage                         5
store                           8
strap                           2
strong                          2
stuff                           4
stupid                          2
sturdy                          2
such                            9
suck                            5
sudden                          2
sugar                           2
suggest                         2
summ                            2
support                         4
suppos                          2
suprising                       2
sure                            5
switch                          2
system                          5
tak                             2
take                            11
talk                            3
tape                            2
target                          2
tast                            2
taste                           4
tell                            4
tempo                           2
terrible                        7
textbook                        2
th                              25
thank                           6
that                            3
there                           3
therefore                       2
theyre                          3
thin                            3
thing                           4
third                           3
tho                             2
though                          7
three                           7
through                         4
thru                            2
thumb                           2
tight                           3
tighten                         4
time                            37
tiny                            4
tip                             2
title                           2
tivo                            2
today                           4
toilet                          2
ton                             3
too                             11
took                            2
tool                            3
toothbrush                      3
top                             3
toss                            2
total                           4
touch                           2
tough                           2
tourist                         2
toy                             3
track                           3
transf                          3
transfer                        2
trash                           2
travel                          4
tri                             11
try                             5
tun                             6
turn                            7
tv                              3
twice                           4
type                            4
unable                          2
und                             2
understand                      2
unfortunate                     2
unit                            6
unless                          3
until                           9
update                          2
upgrad                          2
upgrade                         2
upload                          2
upset                           2
us                              24
usb                             9
use                             5
useful                          3
useless                         4
utility                         2
value                           6
vendor                          2
version                         3
very                            40
video                           11
vista                           2
volume                          2
wait                            2
walk                            3
walmart                         2
want                            7
wasnt                           3
waste                           2
watch                           2
wear                            3
web                             2
website                         4
week                            13
weight                          7
what                            2
whatsoev                        2
where                           2
while                           13
whole                           3
why                             5
wife                            3
window                          6
wipe                            2
wish                            4
without                         6
wonderful                       5
word                            2
work                            14
world                           2
worse                           3
worst                           5
worth                           12
worthless                       2
wrong                           6
xlr                             2
xp                              5
ye                              2
year                            8
yet                             4
you                             5
young                           2
youre                           3
yr                              3
zen                             8
zune                            2
