*               270
</stop>         270
able            2
absolute        2
actual          4
adapt           2
addition        2
address         2
again           6
ago             5
all             2
almost          7
alone           2
along           2
already         4
although        2
alway           3
amazon          11
amount          2
anoth           8
anymore         2
anyone          3
anything        9
apart           2
apple           9
archo           2
around          3
arriv           4
arrive          3
ask             5
avoid           2
aware           2
away            5
back            3
backpack        2
bad             18
bar             2
basical         2
batterie        3
battery         16
be              3
before          6
begin           2
believe         3
bett            14
better          2
between         2
beware          2
big             2
biofeedback     2
bit             3
black           5
body            3
boston          2
both            3
bought          26
box             4
brand           2
break           4
broke           6
broken          4
buck            2
bud             3
burn            2
button          5
buy             48
ca              6
calendar        2
camera          3
canot           3
card            9
cash            2
caus            2
cd              2
chang           3
charg           2
charge          6
cheap           13
check           2
christma        5
clean           2
clear           2
club            2
company         2
compatible      3
complete        5
complicat       2
comput          6
consider        2
contact         4
control         2
correct         2
cost            3
couple          3
crash           4
crashe          3
creative        4
credit          2
custom          4
cute            2
daught          2
day             10
dead            5
defective       3
definite        2
deliv           2
deliver         2
dent            2
design          2
device          10
di              10
didnt           3
different       3
difficult       3
disappoint      5
disc            4
display         4
do              3
doe             2
doesnt          3
dog             2
dont            9
down            4
download        8
drain           2
drink           4
drive           4
dur             3
dvd             7
each            2
ear             3
easi            2
easy            4
effect          2
else            3
email           2
energy          2
enough          4
entire          2
ev              14
eventual        2
every           9
everything      3
everywhere      2
exercise        4
expect          4
expensive       3
experienc       2
experience      4
fail            5
fall            3
far             2
feature         2
feel            3
few             4
figure          3
file            5
final           3
find            3
fine            5
fit             3
flash           3
flashlight      2
flaw            2
fm              6
fool            2
force           2
forev           2
found           6
four            2
free            2
freeze          4
friend          3
froze           5
full            2
functionality   2
game            2
gb              9
gett            5
gift            3
go              7
good            13
gotten          2
great           9
guess           2
guitar          5
guy             2
half            3
hand            3
hang            2
happen          3
happy           6
hard            11
hardware        2
hate            2
head            2
headphone       4
heard           2
high            2
hold            5
horrible        3
hotel           7
hour            9
howev           3
hr              2
hype            2
idea            3
im              6
impossible      2
inaccurate      4
includ          2
inferior        4
install         2
instead         4
instruction     3
interface       2
internet        2
invest          2
ipod            22
iriv            2
it              25
item            28
ive             17
jump            3
junk            8
kazoo           2
kid             4
know            11
l               2
lack            2
large           2
last            9
lat             2
late            2
lcd             4
less            2
let             2
lexar           2
life            5
light           5
like            18
list            3
little          5
load            5
lock            2
long            3
look            2
loose           4
lost            3
lot             6
love            2
machine         2
made            9
make            9
manual          2
manufactur      2
many            4
matt            2
max             2
may             2
maybe           4
mb              3
me              2
mean            2
media           2
memory          5
met             2
microsoft       3
might           3
minute          7
miss            2
mode            2
model           3
money           23
monitor         2
monst           2
month           24
more            25
mouse           2
mp              20
much            9
multiple        2
music           9
nano            3
ne              2
need            3
nev             19
new             9
next            3
nice            4
no              22
nor             2
not             184
notebook        2
nothing         8
o               2
octob           2
off             7
often           3
ok              2
old             5
once            4
one             5
onto            2
open            2
operate         2
ord             7
order           6
oregon          3
out             2
overall         2
own             2
page            3
paid            3
pain            2
pair            2
palm            2
pay             9
pedomet         2
pedometer       2
people          4
perfect         2
perhap          2
philip          2
phone           2
photo           2
pick            3
piece           6
place           6
plastic         2
play            44
player          6
poor            4
portable        2
pound           3
present         2
pretty          5
previou         2
pric            2
price           11
problem         12
product         47
promis          4
prone           2
proper          2
provide         2
purchas         8
purchase        2
put             2
quality         13
quick           3
quite           4
radio           5
random          2
range           2
rate            2
rca             2
read            4
real            9
reason          3
reasonable      2
receiv          7
reciev          2
recogniz        2
recomend        2
recommend       9
record          3
refund          6
reliable        2
repair          3
replac          4
replace         2
requir          2
reset           2
respond         4
rest            2
restart         2
return          20
review          7
right           4
rio             2
room            2
rope            2
same            8
samsung         2
sandisk         4
save            4
scientific      2
scratch         3
scratche        3
screen          12
screw           6
sd              2
second          7
seem            7
sell            4
send            5
sense           2
sent            4
service         8
set             4
several         5
shipp           9
shock           3
short           5
show            2
shuffle         2
sign            2
since           3
slow            3
small           7
so              2
software        9
sold            3
someone         2
something       2
sometime        2
son             2
song            11
sony            4
sound           5
spec            3
spend           6
spent           4
spin            2
st              2
star            2
start           6
stat            2
stay            13
still           11
stinky          2
stop            5
stopp           6
store           2
string          3
stuff           2
stupid          2
sturdy          2
such            5
suck            4
sudden          2
suggest         4
support         3
switch          2
system          2
tak             2
take            8
tell            4
terrible        6
textbook        2
th              19
thank           4
that            4
there           3
therefore       2
third           2
tho             2
though          4
three           8
tighten         5
time            26
tip             2
today           3
toilet          4
too             14
took            3
total           3
touch           2
tourist         2
toy             4
transf          2
transfer        2
trash           2
tri             10
try             4
tun             3
turn            8
twice           2
unable          2
unit            4
unless          2
until           7
upgrade         2
upload          2
upset           2
us              15
usb             8
use             2
useless         4
vendor          2
version         2
very            31
video           4
wasnt           3
waste           14
watch           3
way             2
wear            2
web             2
website         3
week            13
while           5
whole           2
why             4
window          6
wipe            2
wish            3
within          6
wo              8
work            22
worse           4
worst           10
worth           9
wrong           2
xp              5
ye              2
year            8
you             4
youre           2
zen             3
