aaa             2
able            2
accurate        7
adapt           4
add             3
adult           2
advertis        3
again           3
ago             2
airport         2
album           3
allow           2
almost          5
alway           3
amaz            8
amazon          5
anoth           3
anyone          6
anywhere        2
apple           4
arm             2
around          6
arriv           2
attention       2
average         2
awesome         4
baby            2
bad             4
ball            2
band            5
bar             5
batterie        6
battery         15
be              3
beautiful       3
before          6
bell            2
best            14
bett            14
big             4
bike            7
birthday        2
blood           5
book            4
bose            2
both            7
bought          22
brand           2
built           2
business        4
buy             23
ca              4
cable           3
camera          6
car             3
card            6
care            3
carry           6
case            2
cd              2
certain         3
cheap           5
christma        8
class           2
clean           6
clear           4
clip            5
close           2
color           3
combination     2
comfortable     4
common          2
compact         9
company         3
complaint       3
condition       7
control         3
convenient      2
cool            7
cord            5
cost            6
cover           2
creative        6
cute            2
cymbal          2
dad             2
damage          2
daught          9
daughter        2
day             2
deal            6
definate        3
definite        2
delhi           2
delivery        3
describ         2
describe        2
description     2
design          3
device          5
diap            2
different       5
digg            2
digital         2
dog             3
dominat         2
dont            2
download        3
drive           5
drum            3
durable         2
dvd             3
easi            4
easy            50
eat             2
elegant         2
else            4
energy          6
enjoy           7
enough          6
equipment       2
ev              7
every           4
everything      8
everywhere      3
exact           2
excellent       15
except          2
exercise        9
expect          6
expected        2
extra           5
extreme         2
face            2
fami            3
fantastic       3
far             8
fast            11
favorite        5
feature         10
feel            8
fell            2
figur           2
file            3
find            2
fine            6
fit             4
fitness         2
flash           2
flavor          4
floor           2
fm              4
food            2
forev           3
forget          2
form            2
found           4
free            5
friend          9
full            2
fun             2
future          2
gadget          2
garage          2
gb              7
gen             4
general         2
gift            8
girl            2
glad            5
go              5
good            62
great           125
guess           2
gym             4
hand            3
handle          3
handy           4
happen          2
happy           12
hard            5
hav             3
headphone       3
healthy         2
hear            2
heard           4
help            2
here            3
high            11
hold            8
home            3
hooah           2
hope            3
horse           3
hotel           5
house           2
huge            2
hungry          2
husband         5
id              2
im              8
includ          2
inexpensive     2
inside          2
instruction     3
instrument      2
ipod            42
it              28
item            15
itself          2
ive             7
keep            7
key             2
kid             6
know            4
large           4
last            9
learn           2
least           2
less            4
life            10
light           5
lightweight     2
like            33
line            3
listen          9
little          14
location        2
long            7
look            4
lose            2
lot             18
loud            2
lov             5
love            55
low             4
machine         4
made            4
make            11
man             2
many            5
market          3
mat             2
me              2
memory          5
met             2
mic             7
microphone      8
military        2
mom             2
money           7
monitor         5
month           4
more            18
move            2
movie           2
mp              27
much            24
music           22
musical         2
must            3
nano            13
ne              7
near            3
need            9
negative        2
nev             6
new             6
nice            20
nifty           2
night           2
no              19
noise           2
nokia           3
not             64
note            2
oh              2
ok              2
old             7
once            4
one             2
open            4
opinion         2
option          4
order           4
other           2
out             2
over            2
own             9
p               3
package         7
pedomet         3
pen             2
perfect         10
perfectly       4
perform         2
performance     3
phone           7
photo           2
pic             2
pick            2
picture         6
piece           2
pillow          3
pink            2
place           4
play            35
player          5
pleas           9
pocket          2
pod             2
portable        5
present         4
pressure        4
pretty          5
price           31
print           2
probab          5
problem         10
produc          2
product         43
purchas         9
purchase        4
purse           2
put             3
quality         21
quick           4
quite           2
radio           10
rate            2
read            5
real            26
reason          2
receiv          5
reciev          5
recommend       13
record          4
reliable        2
requir          2
result          2
review          3
right           8
rio             3
rock            2
roll            2
room            6
run             7
runing          2
safe            3
same            2
satisfi         3
say             2
screen          9
secure          2
seem            11
sent            2
service         14
set             4
shape           5
shave           2
shipp           7
show            8
simple          4
since           3
size            17
sleek           2
slight          2
slim            2
small           19
snack           3
snug            2
soft            2
software        3
solid           4
someone         4
something       7
son             6
song            10
soooo           2
sound           28
south           2
space           6
special         2
spent           2
staff           2
stand           5
star            2
start           6
stay            4
stereo          2
still           6
storage         3
store           6
strong          2
stuff           2
sturdy          2
such            4
summ            2
suppos          2
sure            4
system          3
take            6
talk            2
tast            2
taste           4
tempo           2
th              9
thank           6
thanks          2
theyre          2
thin            2
thing           6
though          3
through         5
tight           2
time            16
tiny            4
ton             2
too             8
tool            2
top             2
total           2
tough           2
track           2
transf          5
travel          3
try             3
tun             3
tv              4
understand      3
unit            4
until           2
up              3
upgrad          2
us              15
usb             4
use             8
useful          3
utility         2
value           7
version         2
very            69
video           8
want            7
watch           2
wear            2
week            2
weight          4
while           7
why             2
wife            3
window          2
without         6
wonderful       6
work            9
worth           6
wrong           4
xlr             2
year            2
you             6
young           2
youre           2
yr              2
zen             5
