</stop>                         270
able                            2
absolute                        2
actual                          4
adapt                           2
addition                        2
address                         2
again                           4
ago                             5
agree                           2
almost                          5
alone                           2
along                           2
already                         4
although                        2
alway                           3
amazon                          9
amount                          2
anoth                           8
anymore                         2
anyone                          3
anything                        9
apart                           2
apple                           9
archo                           2
around                          3
arriv                           4
arrive                          3
ask                             3
average                         2
avoid                           2
aware                           2
away                            5
backpack                        2
bad                             15
bar                             2
basical                         2
batterie                        3
battery                         12
be                              3
before                          6
begin                           2
bett                            12
between                         2
beware                          2
big                             2
biofeedback                     2
bit                             3
black                           5
body                            3
boston                          2
both                            3
bought                          19
box                             4
brand                           2
break                           4
broke                           6
broken                          4
buck                            2
bud                             3
button                          5
buy                             29
calendar                        2
camera                          3
card                            9
cash                            2
caus                            2
cd                              2
chang                           3
charg                           2
charge                          6
cheap                           13
check                           2
child                           3
christma                        3
clean                           2
clear                           2
club                            2
company                         2
compatible                      3
complete                        5
complicat                       2
comput                          6
condition                       2
conect                          3
consider                        2
contact                         4
control                         2
correct                         2
cost                            3
couple                          3
crash                           4
crashe                          3
creative                        4
cute                            2
cuz                             2
daught                          2
day                             10
dead                            5
defective                       3
deliv                           2
deliver                         2
dent                            2
deserve                         2
design                          2
device                          7
di                              6
didnt                           3
different                       3
difficult                       3
disappoint                      5
disc                            2
display                         4
do                              3
doesnt                          3
dog                             2
dont                            6
down                            4
download                        8
drain                           2
drink                           4
drive                           4
dvd                             7
easi                            2
easy                            4
effect                          2
effort                          2
elliptical                      2
else                            3
email                           2
end                             2
enough                          4
entire                          2
ev                              12
eventual                        2
every                           4
everything                      3
everywhere                      2
exercise                        4
expect                          4
expensive                       3
experienc                       2
experience                      4
fail                            5
far                             2
fat                             2
fault                           2
feature                         2
feel                            3
few                             4
figure                          3
file                            5
final                           3
find                            3
fine                            5
fit                             3
five                            2
flash                           3
flashlight                      2
flaw                            2
fm                              2
fool                            2
force                           2
forev                           2
found                           6
four                            2
fragile                         2
free                            2
freeze                          4
friend                          3
froze                           5
full                            2
functionality                   2
game                            2
gb                              9
gett                            5
gift                            3
go                              7
good                            13
gotten                          2
great                           9
guess                           2
guitar                          5
guy                             2
half                            3
hand                            3
hang                            2
happen                          3
happy                           6
hard                            9
hardware                        2
hate                            2
head                            2
headphone                       4
heard                           2
heavy                           2
here                            2
high                            2
hold                            5
horrible                        3
hotel                           5
hour                            9
howev                           3
hr                              2
hype                            2
idea                            3
im                              6
impossible                      2
inaccurate                      4
includ                          2
inferior                        4
install                         2
instead                         4
interface                       2
internet                        2
invest                          2
ipod                            18
iriv                            2
item                            17
itself                          2
ive                             11
junk                            5
kazoo                           2
kept                            2
kid                             4
know                            11
l                               2
lack                            2
large                           2
last                            7
lat                             2
late                            2
lcd                             2
less                            2
let                             2
lexar                           2
life                            5
light                           5
like                            18
list                            3
little                          5
lock                            2
long                            3
look                            2
loose                           4
lost                            3
lot                             6
love                            2
machine                         2
made                            9
make                            9
manual                          2
manufactur                      2
many                            4
matt                            2
max                             2
may                             2
maybe                           4
mb                              3
mean                            2
measurement                     2
media                           2
memory                          5
mess                            2
met                             2
microsoft                       3
might                           3
minute                          7
miss                            2
mode                            2
model                           3
money                           15
monitor                         2
monst                           2
month                           16
more                            19
mouse                           2
mp                              6
much                            4
multiple                        2
music                           9
ne                              2
need                            3
nev                             12
new                             9
next                            3
nice                            2
no                              15
nor                             2
not                             93
notebook                        2
nothing                         6
o                               2
octob                           2
off                             5
often                           3
ok                              2
old                             5
once                            4
onto                            2
open                            2
operate                         2
ord                             7
order                           4
overall                         2
overpric                        2
own                             2
page                            3
paid                            3
pain                            2
pair                            2
palm                            2
pap                             2
pay                             9
pedomet                         2
pedometer                       2
people                          4
perfect                         2
perhap                          2
philip                          2
phone                           2
photo                           2
pick                            3
piece                           2
place                           6
plastic                         2
play                            36
player                          2
poor                            4
portable                        2
pound                           3
pow                             2
present                         2
pretty                          5
previou                         2
pric                            2
price                           5
problem                         10
product                         36
promis                          4
prone                           2
proper                          2
proprietary                     2
provide                         2
purchas                         8
purchase                        2
put                             2
quality                         9
quick                           3
quite                           4
radio                           2
random                          2
range                           2
rate                            2
read                            4
real                            9
reason                          3
reasonable                      2
receipt                         2
receiv                          7
reciev                          2
recogniz                        2
recommend                       9
record                          3
refund                          2
reliable                        2
rememb                          2
repair                          3
replac                          2
replace                         2
requir                          2
reset                           2
respond                         4
rest                            2
restart                         2
return                          13
review                          5
right                           4
rio                             2
room                            2
rope                            2
run                             2
same                            4
samsung                         2
sandisk                         4
scientific                      2
scratch                         3
scratche                        3
screen                          8
screw                           4
sd                              2
second                          5
seem                            5
sell                            4
send                            5
sense                           2
sent                            4
service                         8
set                             4
several                         5
shipp                           7
shock                           3
short                           5
show                            2
shuffle                         2
sign                            2
since                           3
slow                            3
small                           7
so                              2
software                        7
sold                            3
someone                         2
something                       2
sometime                        2
son                             2
song                            9
sony                            4
sound                           5
spec                            3
spend                           6
spent                           4
spin                            2
st                              2
star                            2
start                           6
stat                            2
stay                            10
stiff                           2
still                           7
stinky                          2
stop                            2
stopp                           3
store                           2
stuff                           2
stupid                          2
sturdy                          2
such                            5
suck                            4
sudden                          2
suggest                         2
support                         3
sure                            2
switch                          2
system                          2
tak                             2
take                            6
talk                            2
tell                            4
terrible                        6
textbook                        2
th                              15
thank                           2
that                            2
there                           3
therefore                       2
third                           2
tho                             2
though                          4
three                           8
thru                            2
tighten                         5
time                            19
tip                             2
today                           3
toilet                          2
too                             8
toothbrush                      2
total                           3
touch                           2
tourist                         2
toy                             4
transfer                        2
trash                           2
tri                             10
try                             4
tun                             3
turn                            8
twice                           2
unable                          2
und                             2
unfortunate                     2
unit                            4
unless                          2
until                           7
upgrade                         2
upload                          2
upset                           2
us                              15
usb                             6
use                             2
useless                         4
vendor                          2
version                         2
very                            23
video                           4
wasnt                           3
waste                           4
watch                           3
wear                            2
web                             2
website                         3
week                            11
weight                          2
while                           5
whole                           2
why                             4
window                          6
wipe                            2
wish                            3
work                            12
worse                           4
worst                           6
worth                           9
worthless                       2
wrong                           2
xp                              5
ye                              2
year                            6
you                             4
youre                           2
zen                             3
