</stop>                         540
aaa                             3
able                            4
absolut                         2
accurate                        5
actual                          4
adapt                           6
add                             3
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      3
afraid                          2
again                           5
ago                             7
agree                           2
airport                         2
album                           3
allow                           3
almost                          10
alone                           2
along                           3
alot                            2
already                         4
although                        3
alway                           6
amaz                            8
amazo                           2
amazon                          8
amazone                         2
amount                          3
amp                             2
anoth                           11
answ                            2
anymore                         2
anyone                          9
anything                        10
anywhere                        2
apart                           2
apple                           7
archo                           2
around                          7
arriv                           6
arrive                          3
ask                             4
attention                       2
audio                           2
available                       2
avoid                           3
aware                           2
away                            6
awsome                          2
baby                            2
backpack                        3
bad                             17
ball                            2
band                            6
bar                             7
basi                            2
basical                         2
bass                            2
batterie                        9
battery                         14
be                              6
beautiful                       3
become                          2
before                          12
begin                           2
believe                         2
bell                            2
best                            14
bett                            24
between                         2
beware                          2
big                             6
bike                            7
biofeedback                     2
birthday                        3
bit                             3
black                           5
body                            4
book                            2
boost                           2
bose                            2
boston                          2
both                            10
bought                          38
box                             5
brand                           4
break                           4
broke                           7
broken                          5
brought                         2
buck                            2
bud                             3
built                           3
business                        4
button                          6
buy                             37
bye                             2
cable                           4
calendar                        2
camera                          7
car                             4
card                            13
care                            3
carry                           7
case                            3
cash                            3
caus                            2
cd                              4
cent                            2
certain                         3
chang                           4
charg                           2
charge                          7
cheap                           16
check                           3
child                           3
children                        2
christma                        7
city                            2
class                           3
clean                           8
clear                           6
clip                            5
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     5
common                          3
compact                         7
company                         3
compatible                      3
complaint                       3
complete                        6
complicat                       2
comput                          7
condition                       4
conect                          3
conector                        2
consider                        2
constant                        2
contact                         4
control                         5
convenient                      2
cool                            7
copy                            2
cord                            5
correct                         3
cost                            9
count                           2
couple                          4
cov                             2
cover                           2
crash                           5
crashe                          3
creative                        5
cute                            4
cuz                             2
cymbal                          2
dad                             3
dai                             2
damag                           2
damage                          3
data                            2
daught                          9
daughter                        2
day                             12
dead                            5
deal                            6
defective                       3
definate                        3
definite                        2
delhi                           2
deliv                           2
deliver                         3
delivery                        3
dent                            2
describ                         3
describe                        2
description                     2
deserve                         2
design                          3
develop                         2
device                          10
di                              6
diap                            2
didnt                           3
die                             2
different                       8
difficult                       3
digg                            2
direct                          2
direction                       2
dirty                           2
disappoint                      5
disc                            2
disk                            2
display                         5
do                              4
doesnt                          3
dog                             5
dollar                          2
dont                            4
down                            3
download                        9
drain                           3
drink                           5
driv                            2
drive                           9
dropp                           2
drum                            3
dur                             2
durable                         3
dvd                             10
easi                            6
easy                            36
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            7
email                           3
end                             2
energy                          3
enjoy                           8
enough                          8
entire                          2
equipment                       2
especial                        2
etc                             2
ev                              19
eventual                        2
everthing                       2
every                           7
everything                      11
everywhere                      5
exact                           2
excellent                       12
except                          3
exercis                         2
exercise                        9
expect                          10
expensive                       4
experienc                       2
experience                      5
extra                           6
extreme                         2
face                            2
fail                            6
fami                            2
fantastic                       3
far                             10
fast                            8
fat                             2
fault                           2
favorite                        4
feature                         10
feedback                        2
feel                            6
few                             5
figur                           2
figure                          4
file                            8
fill                            2
final                           3
find                            5
fine                            9
fit                             7
fitness                         2
five                            2
flash                           3
flashlight                      2
flat                            2
flavor                          4
flaw                            2
floor                           2
food                            2
fool                            2
force                           2
forev                           5
forget                          2
form                            3
format                          2
found                           10
four                            2
fragile                         2
free                            5
freeze                          4
friend                          12
froze                           5
full                            4
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            2
gb                              14
gen                             4
general                         3
gett                            6
gift                            9
girl                            2
glad                            5
go                              12
good                            46
gotten                          3
great                           58
green                           2
guess                           4
guest                           2
guitar                          6
guy                             2
gym                             4
half                            4
hand                            6
handl                           2
handle                          3
handy                           4
hang                            2
happen                          5
happy                           13
hard                            13
hardware                        2
hate                            2
hav                             3
have                            2
headphone                       7
healthy                         2
hear                            3
heard                           6
heavy                           3
help                            3
helpful                         2
here                            4
high                            5
hold                            9
home                            4
hooah                           2
hope                            2
horrible                        3
horse                           3
hotel                           10
hour                            9
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         4
hype                            2
id                              3
idea                            3
ill                             2
im                              8
impossible                      2
inaccurate                      4
includ                          4
inexpensive                     2
inferior                        4
info                            2
information                     2
inside                          2
install                         3
instead                         4
instruction                     4
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            36
iriv                            2
isnt                            2
issue                           2
item                            29
itself                          3
ive                             14
junk                            5
kazoo                           2
keep                            8
kept                            2
key                             2
kid                             6
kind                            2
know                            15
l                               2
lack                            2
lady                            2
laptop                          2
large                           6
last                            12
lat                             3
late                            3
lcd                             2
learn                           3
least                           3
less                            6
let                             2
level                           2
lexar                           2
life                            12
light                           8
lightweight                     2
like                            35
line                            4
list                            3
listen                          8
little                          17
load                            2
location                        3
lock                            3
long                            8
look                            6
loose                           4
lose                            2
lost                            3
lot                             19
loud                            2
lov                             6
love                            34
low                             3
m                               2
machine                         6
made                            13
major                           2
mak                             2
make                            16
man                             2
manual                          3
manufactur                      2
many                            9
market                          2
mat                             2
matt                            3
max                             2
may                             2
maybe                           4
mb                              4
mean                            2
measurement                     2
media                           3
meditation                      2
memory                          8
mention                         2
menu                            2
mess                            2
met                             4
mic                             5
microphone                      6
microsoft                       3
might                           4
military                        2
million                         2
minute                          8
miss                            2
mode                            2
model                           4
mom                             2
money                           18
monitor                         5
monst                           2
month                           20
more                            35
mouse                           2
move                            2
movie                           3
mp                              11
much                            14
multiple                        2
music                           24
musical                         2
must                            3
myself                          2
nano                            9
navigation                      2
ne                              9
neck                            2
need                            12
negative                        3
nev                             17
new                             13
next                            4
nice                            20
nifty                           2
night                           3
no                              27
noise                           2
nokia                           3
nor                             2
not                             136
note                            2
notebook                        2
nothing                         7
notice                          2
o                               2
octob                           2
off                             6
offer                           2
often                           3
oh                              2
ok                              4
old                             12
omron                           2
once                            6
one                             2
onto                            3
open                            4
operate                         2
opinion                         2
option                          5
ord                             8
order                           8
other                           3
otherwise                       2
over                            2
overall                         3
overpric                        2
own                             8
p                               4
package                         8
page                            4
paid                            3
pain                            3
pair                            2
palm                            2
pap                             2
pay                             8
pedomet                         3
pedometer                       2
pen                             2
people                          4
perfect                         10
perform                         3
performance                     3
perhap                          2
personal                        2
philip                          2
phone                           9
photo                           4
pic                             3
pick                            5
picture                         5
piece                           4
pillow                          4
pink                            2
place                           8
plastic                         2
play                            53
player                          3
pleas                           5
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        7
pound                           3
pow                             2
present                         6
pretty                          8
previou                         2
pric                            3
price                           32
print                           2
probab                          3
problem                         17
produc                          2
product                         64
promis                          5
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         15
purchase                        4
purse                           2
put                             5
quality                         24
quick                           7
quite                           6
radio                           10
random                          2
range                           2
rate                            4
rath                            2
read                            7
real                            20
reason                          5
receipt                         2
receiv                          12
recharge                        2
reciev                          7
recogniz                        2
recommend                       14
record                          7
refund                          2
refuse                          2
relative                        2
reliable                        4
rememb                          2
repair                          4
replac                          2
replace                         2
requir                          4
reset                           2
respond                         5
response                        2
rest                            2
restart                         2
result                          3
return                          13
review                          8
right                           12
rio                             5
rock                            2
roll                            2
room                            8
rope                            2
run                             8
safe                            3
same                            6
samsung                         2
sandisk                         5
sansa                           2
satisfi                         4
sav                             2
save                            2
say                             3
scratch                         3
scratche                        3
screen                          13
screw                           4
sd                              3
second                          5
secure                          2
seem                            12
select                          2
sell                            5
seller                          2
send                            5
sense                           2
sent                            6
service                         16
set                             8
sett                            2
several                         5
shape                           5
shave                           2
shipp                           14
shock                           3
short                           5
show                            10
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          4
since                           6
site                            2
size                            14
slight                          2
slim                            2
slow                            3
small                           22
snack                           3
snug                            2
soft                            2
software                        10
sold                            3
solid                           4
someone                         6
something                       9
sometime                        3
son                             6
song                            19
sony                            5
soon                            2
soooo                           3
sound                           17
south                           2
space                           5
speak                           2
spec                            3
special                         2
spend                           5
spent                           6
spin                            3
sport                           2
st                              2
staff                           3
stand                           5
star                            4
start                           12
stat                            2
stay                            14
stereo                          2
stick                           2
stiff                           3
still                           11
stinky                          2
stop                            3
stopp                           4
stor                            2
storage                         3
store                           8
strap                           2
strong                          2
stuff                           4
stupid                          2
sturdy                          4
such                            9
suck                            4
sudden                          2
sugar                           2
suggest                         2
summ                            2
support                         3
suppos                          2
suprising                       2
sure                            5
switch                          2
system                          3
tak                             2
take                            10
talk                            3
tape                            2
target                          2
tast                            2
taste                           5
tell                            4
tempo                           2
terrible                        7
textbook                        2
th                              24
thank                           5
that                            3
there                           3
therefore                       2
theyre                          3
thin                            2
thing                           4
third                           3
tho                             2
though                          5
three                           9
through                         5
thru                            2
thumb                           2
tight                           3
tighten                         5
time                            33
tiny                            5
tip                             2
title                           2
tivo                            2
today                           4
toilet                          2
ton                             3
too                             12
took                            2
tool                            2
toothbrush                      3
top                             3
toss                            2
total                           5
touch                           2
tough                           2
tourist                         2
toy                             4
track                           3
transf                          2
transfer                        2
trash                           2
travel                          3
tri                             11
try                             7
tun                             6
turn                            8
tv                              3
twice                           3
type                            2
unable                          2
und                             2
unfortunate                     2
unit                            4
unless                          2
until                           9
update                          2
upgrad                          2
upgrade                         3
upload                          2
upset                           2
us                              28
usb                             10
use                             5
useful                          3
useless                         4
utility                         2
value                           5
vendor                          2
version                         4
very                            35
video                           10
vista                           2
volume                          2
wait                            2
walk                            2
walmart                         2
want                            7
wasnt                           3
waste                           4
watch                           3
wear                            4
web                             2
website                         4
week                            13
weight                          5
what                            2
whatsoev                        2
where                           2
while                           12
whole                           3
why                             6
wife                            4
window                          6
wipe                            2
wish                            4
within                          2
without                         7
wonderful                       6
word                            2
work                            17
world                           2
worse                           4
worst                           6
worth                           11
worthless                       2
wrong                           6
xlr                             2
xp                              5
ye                              3
year                            8
yet                             2
you                             5
young                           3
youre                           4
yr                              3
zen                             8
zune                            2
