a               31
able            2
about           19
absolute        3
actual          4
adapt           3
addition        2
aft             30
again           6
ago             4
agree           2
all             35
almost          6
alone           2
along           2
already         4
also            6
although        2
alway           3
am              7
amazon          9
amount          2
an              23
and             171
anoth           7
any             13
anymore         2
anyone          4
anything        9
apart           2
apple           9
are             27
around          3
arriv           4
arrive          2
ask             5
at              25
average         2
avoid           2
aware           2
away            5
back            15
backpack        2
bad             17
bar             2
basical         2
batterie        3
battery         16
be              32
because         10
been            9
before          6
begin           2
believe         3
bett            15
between         2
beware          2
big             2
biofeedback     2
bit             5
black           5
body            4
boston          2
both            4
bought          26
box             4
brand           2
break           6
broke           9
broken          3
buck            2
bud             2
burn            2
but             48
button          6
buy             46
by              11
ca              5
came            3
camera          3
can             17
canot           3
card            11
cash            2
caus            2
cd              2
chang           2
charg           3
charge          8
cheap           10
check           3
child           3
christma        4
clean           2
clear           2
club            3
company         3
compatible      3
complete        5
complicat       2
comput          7
condition       2
conect          4
consider        2
contact         3
control         3
correct         2
cost            3
could           14
couple          3
crash           4
crashe          3
creative        4
credit          2
custom          6
cute            2
cuz             2
day             15
dead            5
defective       4
definite        2
deliv           2
deliver         2
dent            3
deserve         2
design          3
device          10
di              11
did             22
didnt           3
different       3
difficult       2
disappoint      6
disc            3
display         4
do              53
doe             24
doesnt          5
dog             2
dont            8
down            4
download        8
drain           2
drink           4
drive           5
dur             3
dvd             6
each            2
ear             2
easi            2
easy            4
effect          2
elliptical      2
else            3
email           3
end             2
energy          2
enough          4
entire          2
ev              14
even            17
eventual        2
every           8
everything      3
everywhere      2
exercise        6
expect          4
expensive       5
experienc       2
experience      3
fail            5
fall            3
far             4
fast            2
fat             2
fault           2
feature         3
feel            3
few             2
figure          2
file            4
final           2
find            3
fine            6
first           15
fit             3
five            2
flash           3
flaw            2
fm              6
fool            2
for             100
force           3
forev           2
found           7
four            2
fragile         2
free            3
freeze          5
friend          2
from            32
froze           4
frustrat        2
full            2
functionality   2
game            2
gave            3
gb              8
get             32
gett            5
gift            3
give            8
go              11
good            16
got             14
great           8
guess           2
guitar          5
guy             2
ha              16
had             25
half            3
hand            3
happen          3
happy           5
hard            10
hardware        2
have            43
he              2
head            2
headphone       5
heavy           2
here            2
hi              2
high            2
hold            3
horrible        4
hotel           7
hour            10
how             11
howev           3
hr              2
hype            2
i               106
idea            3
if              20
im              6
impossible      2
in              56
inaccurate      3
includ          2
inferior        3
install         2
instead         4
instruction     4
into            4
invest          2
ipod            26
iriv            2
it              289
item            30
itself          2
ive             15
jump            3
junk            11
just            28
kazoo           2
kept            2
kid             3
know            11
l               2
lack            2
large           2
last            9
lat             2
late            2
lcd             4
less            2
let             3
lexar           2
life            4
light           6
like            14
list            3
little          6
load            6
lock            2
long            4
look            11
loose           4
lost            2
lot             6
love            2
machine         3
made            7
make            8
manual          2
manufactur      3
many            4
matt            4
max             2
may             3
maybe           4
mb              2
me              19
mean            3
measurement     2
media           2
memory          5
mess            2
met             2
microsoft       3
might           3
mine            6
minute          8
miss            3
model           6
money           21
monitor         2
monst           2
month           22
more            26
mouse           2
mp              21
much            7
multiple        4
music           10
my              44
need            2
neith           2
nev             18
new             9
next            3
nice            5
nitru           2
no              26
nor             4
not             172
notebook        2
nothing         5
now             16
o               2
octob           2
of              97
off             9
often           2
ok              2
old             6
on              76
once            3
one             38
onto            3
open            2
or              11
ord             7
order           5
oregon          2
oth             10
out             26
ov              8
overall         2
overpric        2
own             3
page            3
paid            2
pain            2
pair            2
palm            2
pap             2
pay             9
people          4
perfect         2
perhap          2
philip          2
phone           2
photo           2
pick            4
piece           6
place           5
plastic         2
play            46
player          3
poor            4
portable        2
pound           2
pow             3
present         2
pretty          4
previou         2
pric            3
price           10
problem         13
product         49
prone           2
proper          2
provide         2
purchas         7
purchase        3
put             2
quality         14
quick           3
quite           3
radio           5
range           2
rate            2
rca             2
read            6
real            10
reason          3
reasonable      2
receipt         2
receiv          6
reciev          2
recogniz        2
recomend        2
recommend       9
record          3
refund          7
reliable        2
rememb          2
rep             2
repair          4
replac          4
replace         2
requir          2
reset           3
respond         5
return          20
review          7
right           3
rio             2
room            2
rope            2
run             2
said            2
same            8
samsung         2
sandisk         6
save            4
saw             2
say             8
scratche        4
screen          10
screw           6
sd              2
second          6
seem            7
seen            3
sell            2
send            6
sense           2
sent            5
service         10
set             4
several         6
shipp           9
shock           2
short           6
should          9
show            2
sign            2
since           4
slow            2
small           6
so              22
software        8
sold            3
some            7
someone         2
something       2
sometime        2
son             3
song            11
sony            5
sound           5
spec            2
spend           6
spent           4
spin            2
st              2
star            4
start           7
stat            2
stay            14
stiff           2
still           10
stink           2
stinky          2
stop            4
stopp           6
store           2
string          3
stupid          2
sturdy          2
such            5
suck            6
sudden          2
suggest         4
support         3
sure            2
switch          2
system          2
tak             2
take            9
talk            2
tell            4
terrible        7
textbook        2
th              17
than            11
thank           5
that            46
the             245
their           3
them            9
then            14
there           17
therefore       2
these           9
they            26
thi             157
think           6
third           2
tho             2
those           4
though          4
thought         2
three           7
thru            2
tighten         5
time            31
tip             2
to              152
today           3
toilet          4
too             15
took            2
toothbrush      2
total           3
touch           2
tourist         2
toy             4
transfer        2
trash           2
tri             9
try             4
tun             4
turn            10
twice           3
two             12
unable          2
und             2
unfortunate     2
unit            4
unless          2
until           7
up              21
upgrade         2
upload          2
upset           2
us              12
usb             8
use             26
useless         4
vendor          2
very            34
video           4
wa              56
want            7
wasnt           2
waste           13
watch           3
way             9
we              7
wear            2
web             2
website         3
week            12
weight          3
well            7
went            4
were            9
what            18
when            15
which           5
while           4
who             6
whole           2
why             4
will            20
window          7
wipe            2
wish            2
with            48
within          8
wo              7
work            56
worse           2
worst           7
worth           10
worthless       2
would           33
xp              5
yahoo           2
ye              2
year            16
you             61
your            17
youre           2
zen             3
