*               270
</stop>         270
able            2
absolute        3
actual          4
adapt           2
addition        2
address         2
again           7
ago             3
agree           2
all             3
almost          7
already         4
although        2
alway           2
amazon          9
amount          2
anoth           7
anymore         2
anyone          4
anything        10
apart           2
apple           6
arriv           4
arrive          3
ask             4
average         2
aware           2
away            7
back            3
bad             16
bar             2
basical         2
batterie        3
battery         12
be              2
before          6
believe         2
bett            13
between         2
beware          2
biofeedback     2
bit             4
black           3
body            4
boston          2
both            4
bought          24
box             4
brand           2
break           5
broke           8
broken          4
bud             3
burn            2
button          6
buy             47
ca              5
calendar        2
camera          3
canot           3
card            9
cd              2
chang           3
charg           3
charge          7
cheap           13
check           2
child           3
christma        4
clean           2
clear           2
company         3
compatible      2
complete        4
complicat       2
comput          9
condition       2
conect          3
consider        2
contact         3
control         3
correct         2
cost            3
couple          3
crash           3
crashe          3
creative        4
custom          6
cuz             2
daught          2
day             8
dead            4
defective       4
definite        2
deliv           2
dent            3
deserve         2
design          3
device          10
di              10
didnt           3
different       3
difficult       3
disappoint      4
disc            4
display         4
do              3
doe             2
doesnt          6
dont            9
down            5
download        7
drink           4
drive           4
dur             3
dvd             7
each            2
ear             3
easi            2
easy            3
effect          2
effort          2
elliptical      2
else            2
email           2
end             2
energy          2
enough          5
ev              15
eventual        2
every           10
everything      2
everywhere      2
exercise        6
expect          4
expensive       5
experienc       2
experience      4
fail            5
fall            3
far             4
fat             2
fault           2
feature         3
feel            2
few             4
figure          3
file            5
final           3
find            3
fine            6
flash           4
flashlight      2
flaw            2
fm              6
fool            2
force           3
forev           2
found           7
four            2
fragile         2
free            3
freeze          3
friend          2
froze           5
full            2
functionality   2
game            2
gb              6
gett            5
gift            3
go              6
good            15
gotten          2
great           8
guess           2
guitar          5
guy             2
half            3
hand            3
hang            2
happen          2
happy           6
hard            13
hardware        2
hate            2
headphone       6
heard           2
heavy           2
here            2
high            2
hold            4
horrible        5
hotel           6
hour            9
howev           3
hr              2
idea            3
im              5
impossible      2
inaccurate      4
includ          2
inferior        4
install         2
instead         3
instruction     4
interface       2
internet        2
invest          2
ipod            24
it              23
item            30
itself          2
ive             17
jump            2
junk            12
kazoo           2
kept            2
kid             4
know            11
l               2
lack            2
last            7
lat             2
lcd             4
less            2
let             3
life            4
light           6
like            16
list            3
little          5
load            6
lock            2
long            4
look            2
loose           3
lost            3
lot             6
love            2
machine         3
made            7
make            9
manual          2
manufactur      2
many            3
matt            3
max             2
may             3
maybe           4
me              2
measurement     2
media           2
memory          5
met             2
microsoft       3
might           3
minute          6
mode            2
model           4
money           24
monitor         2
monst           2
month           27
more            29
mouse           2
mp              22
much            8
multiple        4
music           9
nano            2
ne              2
need            2
nev             18
new             9
next            2
nice            5
no              25
nor             4
not             180
notebook        2
nothing         8
octob           2
off             7
often           2
ok              2
old             5
once            4
one             4
onto            3
open            2
operate         2
ord             6
order           7
oregon          3
out             2
overall         2
overpric        2
own             3
page            3
paid            2
pain            2
pair            2
palm            2
pap             2
pay             9
pedomet         2
pedometer       2
people          4
perfect         2
perhap          2
philip          2
phone           2
photo           2
pick            4
piece           6
place           6
plastic         2
play            42
player          6
poor            3
portable        2
pound           2
pow             2
present         3
pretty          5
pric            2
price           11
problem         12
product         45
promis          4
proper          2
proprietary     2
provide         2
purchas         8
purchase        3
put             2
quality         14
quick           3
quite           3
radio           5
random          2
range           2
rate            2
rca             2
read            6
real            9
reason          3
reasonable      2
receipt         2
receiv          6
reciev          2
recogniz        2
recomend        2
recommend       10
record          3
refund          7
reliable        2
rememb          2
repair          3
replac          4
reset           3
respond         4
rest            2
restart         2
return          23
review          7
right           4
rio             2
room            2
rope            2
run             2
same            8
samsung         2
sandisk         5
save            4
scientific      2
scratch         3
scratche        4
screen          11
screw           5
sd              2
second          7
seem            7
sell            4
send            6
sense           2
sent            6
service         10
set             2
several         6
shipp           8
shock           3
short           5
show            2
shuffle         2
sign            2
since           3
slow            3
small           5
so              2
software        8
sold            3
someone         3
something       2
sometime        2
son             2
song            9
sony            4
sound           4
spec            3
spend           6
spent           4
spin            2
star            2
start           7
stat            2
stay            15
stiff           2
still           10
stinky          2
stop            4
stopp           4
string          3
stuff           2
stupid          2
sturdy          2
such            5
suck            4
suggest         3
support         3
sure            2
switch          2
system          2
tak             2
take            7
talk            2
tell            3
terrible        7
textbook        2
th              18
that            4
them            2
there           3
therefore       2
third           2
tho             2
though          4
three           7
thru            2
tighten         4
time            31
toilet          4
too             13
took            3
toothbrush      2
total           3
touch           2
tourist         2
toy             4
transf          2
transfer        2
trash           2
tri             9
try             3
tun             3
turn            10
twice           3
unable          2
und             2
unfortunate     2
unit            5
unless          2
until           8
upgrade         2
upload          2
us              14
usb             6
use             2
useless         3
vendor          2
very            33
video           3
wasnt           3
waste           16
watch           3
way             2
wear            2
web             2
website         2
week            13
weight          3
while           4
whole           3
why             3
window          4
wipe            2
wish            4
within          8
wo              9
work            20
worse           4
worst           10
worth           10
worthless       2
wrong           2
xp              4
yahoo           3
year            5
you             3
zen             3
