</stop>                         540
aaa                             3
able                            5
absolut                         2
absolute                        2
accurate                        5
actual                          4
adapt                           5
add                             3
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      3
afraid                          2
again                           5
ago                             4
agree                           3
airport                         2
album                           4
allow                           3
almost                          9
alone                           2
along                           2
alot                            2
already                         5
although                        2
alway                           6
amaz                            8
amazo                           2
amazon                          10
amazone                         2
amount                          3
amp                             2
anoth                           10
answ                            2
anymore                         2
anyone                          9
anything                        11
anywhere                        3
apart                           2
apple                           6
archo                           2
around                          5
arriv                           6
arrive                          3
ask                             5
attention                       2
audio                           2
available                       2
average                         2
avoid                           3
aware                           2
away                            6
awesome                         2
awsome                          2
baby                            3
backpack                        3
bad                             19
ball                            2
band                            6
bar                             7
basi                            2
basical                         2
bass                            2
batterie                        8
battery                         12
be                              5
beautiful                       3
become                          2
before                          12
begin                           2
believe                         3
bell                            2
best                            12
bett                            25
between                         2
beware                          2
big                             4
bike                            6
biofeedback                     2
birthday                        2
bit                             2
black                           3
body                            3
book                            2
boost                           2
bose                            2
boston                          2
both                            9
bought                          35
box                             5
brand                           5
break                           5
broke                           9
broken                          5
brought                         2
buck                            2
bud                             3
built                           3
business                        4
button                          7
buy                             39
bye                             2
cable                           4
calendar                        2
camera                          9
car                             4
card                            11
care                            3
carry                           6
case                            3
cash                            3
caus                            2
cd                              6
cent                            2
certain                         2
chang                           4
charg                           3
charge                          7
cheap                           15
check                           3
child                           3
children                        2
christma                        5
city                            2
class                           3
clean                           9
clear                           7
clip                            5
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     5
common                          3
compact                         7
company                         5
compatible                      2
complaint                       4
complete                        5
complicat                       2
comput                          10
condition                       5
conect                          3
conector                        2
consider                        2
constant                        2
contact                         3
control                         6
convenient                      2
cool                            7
copy                            2
cord                            3
correct                         3
cost                            7
count                           2
couple                          4
cov                             2
cover                           2
crash                           4
crashe                          3
creative                        5
cute                            2
cuz                             2
cymbal                          3
dad                             4
dai                             2
damag                           2
damage                          3
data                            2
daught                          9
daughter                        2
day                             9
dead                            4
deal                            6
defective                       4
definate                        2
definite                        2
delhi                           2
deliv                           2
deliver                         2
delivery                        3
dent                            3
describ                         4
describe                        2
description                     2
deserve                         2
design                          4
develop                         2
device                          10
di                              5
diap                            2
didnt                           3
die                             2
different                       8
difficult                       3
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      4
disc                            2
disk                            2
display                         5
do                              4
doesnt                          6
dog                             4
dollar                          2
dont                            4
down                            4
download                        8
drain                           2
drink                           5
driv                            2
drive                           8
dropp                           2
drum                            4
dur                             2
durable                         3
dvd                             11
easi                            6
easy                            34
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            5
email                           3
end                             3
energy                          2
enjoy                           6
enough                          9
entire                          2
especial                        2
etc                             2
ev                              19
eventual                        2
everthing                       2
every                           6
everything                      8
everywhere                      5
exact                           2
excellent                       13
except                          3
exercis                         2
exercise                        10
expect                          10
expensive                       6
experienc                       2
experience                      5
extra                           5
extreme                         2
face                            2
fail                            5
fami                            2
fantastic                       2
far                             12
fast                            8
fat                             3
fault                           3
favorite                        2
feature                         9
feedback                        2
feel                            5
few                             5
figur                           2
figure                          4
file                            8
fill                            2
final                           3
find                            6
fine                            10
fit                             5
fitness                         2
five                            2
flash                           2
flashlight                      2
flat                            2
flavor                          3
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           5
forget                          2
form                            3
format                          2
found                           11
four                            2
fragile                         2
free                            7
freeze                          3
friend                          10
froze                           5
full                            4
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              12
gen                             4
general                         3
gett                            6
gift                            10
girl                            2
glad                            5
go                              9
good                            46
gotten                          3
great                           63
green                           2
guess                           4
guest                           2
guitar                          7
guy                             2
gym                             4
half                            3
hand                            6
handl                           2
handle                          4
handy                           4
hang                            2
happen                          4
happy                           13
hard                            14
hardware                        2
hate                            2
hav                             4
have                            2
headphone                       10
healthy                         2
hear                            3
heard                           6
heavy                           3
help                            3
helpful                         2
here                            4
high                            5
hold                            11
home                            5
hooah                           3
hope                            2
horrible                        5
horse                           3
hotel                           10
hour                            10
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         4
hype                            2
id                              3
idea                            3
ill                             2
im                              10
impossible                      2
inaccurate                      4
includ                          4
inexpensive                     2
inferior                        4
info                            2
information                     2
inside                          3
install                         3
instead                         3
instruction                     5
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            38
iriv                            2
isnt                            2
issue                           2
item                            33
itself                          4
ive                             16
junk                            7
kazoo                           2
keep                            5
kept                            2
key                             2
kid                             6
kind                            3
know                            15
l                               2
lack                            2
lady                            2
laptop                          2
large                           5
last                            12
lat                             2
late                            2
lcd                             2
learn                           3
least                           3
less                            6
let                             3
level                           2
lexar                           2
life                            10
light                           9
lightweight                     3
like                            35
line                            2
list                            3
listen                          8
little                          17
load                            3
location                        4
lock                            3
long                            9
look                            6
loose                           3
lose                            2
lost                            3
lot                             18
loud                            2
lov                             6
love                            32
low                             2
m                               2
machine                         8
made                            11
major                           2
mak                             2
make                            14
man                             2
manual                          3
manufactur                      2
many                            8
market                          2
mat                             2
matt                            4
max                             2
may                             3
maybe                           4
mb                              2
mean                            2
measurement                     2
media                           3
meditation                      2
memory                          9
mention                         2
menu                            2
mess                            2
met                             3
mic                             5
microphone                      4
microsoft                       3
might                           5
military                        2
million                         2
minute                          7
miss                            2
mode                            2
model                           6
mom                             2
money                           17
monitor                         4
monst                           2
month                           21
more                            36
mouse                           2
move                            2
movie                           3
mp                              13
much                            18
multiple                        2
music                           26
musical                         2
must                            3
myself                          2
nano                            9
navigation                      2
ne                              7
neck                            2
need                            10
negative                        3
nev                             15
new                             11
next                            3
nice                            17
nifty                           2
night                           3
no                              27
noise                           2
nokia                           3
nor                             4
not                             121
note                            2
notebook                        2
nothing                         7
notice                          2
o                               2
octob                           2
off                             6
offer                           2
often                           2
oh                              2
ok                              3
old                             11
omron                           2
once                            6
one                             4
onto                            4
open                            3
operate                         3
opinion                         2
option                          5
ord                             6
order                           7
other                           2
otherwise                       2
over                            3
overall                         3
overpric                        2
own                             9
p                               4
package                         8
page                            4
paid                            2
pain                            2
pair                            2
palm                            2
pap                             2
pay                             10
pedomet                         3
pedometer                       2
pen                             2
people                          7
perfect                         11
perform                         2
performance                     3
perhap                          2
personal                        2
philip                          2
phone                           8
photo                           5
pic                             3
pick                            6
picture                         9
piece                           4
pillow                          4
pink                            3
place                           8
plastic                         2
play                            49
player                          3
pleas                           5
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            3
pop                             2
port                            2
portable                        7
pound                           2
pow                             2
present                         7
pretty                          8
previou                         2
pric                            3
price                           31
print                           2
probab                          2
problem                         16
produc                          2
product                         59
promis                          5
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         16
purchase                        4
purse                           2
put                             4
quality                         23
quick                           7
quite                           6
radio                           9
random                          2
range                           2
rate                            4
rath                            2
read                            6
real                            21
reason                          5
receipt                         2
receiv                          9
recharge                        2
reciev                          7
recogniz                        2
recommend                       12
record                          7
refuse                          2
relative                        2
reliable                        4
rememb                          2
repair                          4
replac                          2
replace                         2
requir                          3
reset                           3
respond                         5
response                        2
rest                            2
restart                         2
result                          2
return                          14
review                          7
right                           11
rio                             5
rock                            2
roll                            2
room                            8
rope                            2
run                             10
safe                            3
same                            6
samsung                         3
sandisk                         6
sansa                           3
satisfi                         4
sav                             2
say                             3
scratch                         3
scratche                        4
screen                          12
screw                           3
sd                              3
second                          5
secure                          2
seem                            12
select                          2
sell                            5
seller                          2
send                            6
sense                           2
sent                            8
service                         20
set                             7
sett                            2
several                         6
shape                           6
shave                           2
shipp                           12
shock                           3
short                           5
show                            9
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          3
since                           7
site                            2
size                            16
slight                          2
slim                            2
slow                            3
small                           20
snack                           2
snug                            2
soft                            2
software                        10
sold                            3
solid                           3
someone                         4
something                       10
sometime                        3
son                             6
song                            18
sony                            5
soon                            2
soooo                           3
sound                           20
south                           2
space                           3
speak                           2
spec                            3
special                         3
spend                           6
spent                           5
spin                            3
sport                           2
st                              2
staff                           3
stand                           4
star                            5
start                           12
stat                            2
stay                            15
stereo                          2
stick                           2
stiff                           2
still                           9
stinky                          2
stop                            3
stopp                           3
stor                            2
storage                         5
store                           3
strap                           2
strong                          2
stuff                           4
stupid                          2
sturdy                          4
such                            9
suck                            4
sudden                          2
sugar                           2
summ                            2
support                         3
suppos                          2
suprising                       2
sure                            6
switch                          2
system                          5
tak                             2
take                            8
talk                            4
tape                            2
target                          2
tast                            3
taste                           4
tell                            3
tempo                           2
terrible                        8
textbook                        2
th                              24
thank                           5
that                            3
there                           3
therefore                       2
theyre                          3
thin                            3
thing                           4
third                           3
tho                             2
though                          5
three                           8
through                         5
thru                            2
thumb                           2
tight                           3
tighten                         4
time                            35
tiny                            4
tip                             2
title                           2
tivo                            2
today                           2
toilet                          2
ton                             3
too                             13
took                            2
tool                            3
toothbrush                      3
top                             2
toss                            2
total                           5
touch                           2
tough                           2
tourist                         2
toy                             4
track                           3
transf                          3
transfer                        2
trash                           2
travel                          4
tri                             9
try                             6
tun                             5
turn                            8
tv                              4
twice                           3
type                            4
unable                          2
und                             2
unfortunate                     2
unit                            6
unless                          3
until                           10
update                          2
upgrad                          2
upgrade                         2
upload                          2
upset                           2
us                              27
usb                             8
use                             3
useful                          3
useless                         3
utility                         2
value                           6
vendor                          2
version                         3
very                            37
video                           10
vista                           2
volume                          2
wait                            2
walk                            2
walmart                         2
want                            7
wasnt                           3
waste                           3
watch                           3
wear                            4
web                             2
website                         2
week                            15
weight                          7
what                            2
whatsoev                        2
where                           2
while                           13
whole                           4
why                             4
wife                            3
window                          5
wipe                            2
wish                            6
within                          2
without                         7
wonderful                       6
word                            2
work                            16
world                           2
worse                           4
worst                           6
worth                           12
worthless                       2
wrong                           5
xlr                             2
xp                              4
ye                              2
year                            8
yet                             3
you                             5
young                           3
youre                           3
yr                              3
zen                             8
zune                            2
