aaa                             2
able                            3
accurate                        5
adapt                           3
add                             3
adult                           2
advertis                        3
affordable                      3
ago                             3
airport                         2
album                           4
allow                           2
almost                          4
alway                           4
amaz                            8
amazon                          3
anoth                           3
anyone                          5
anywhere                        3
around                          4
arriv                           2
attention                       2
awesome                         2
awsome                          2
baby                            3
bad                             5
ball                            2
band                            5
bar                             5
basi                            2
bass                            2
batterie                        5
battery                         2
be                              3
beautiful                       3
before                          6
bell                            2
best                            12
bett                            12
big                             4
bike                            6
birthday                        2
book                            2
bose                            2
both                            5
bought                          18
brand                           3
built                           2
business                        4
buy                             14
bye                             2
cable                           3
camera                          6
car                             3
card                            4
care                            3
carry                           6
case                            2
cd                              4
certain                         2
cheap                           4
christma                        3
class                           2
clean                           7
clear                           5
clip                            5
close                           2
combination                     2
comfortable                     4
common                          2
compact                         7
company                         2
complaint                       4
complete                        2
comput                          2
condition                       3
control                         3
convenient                      2
cool                            7
cord                            3
cost                            4
cover                           2
creative                        2
cute                            2
cymbal                          3
dad                             3
damage                          2
daught                          7
daughter                        2
day                             2
deal                            5
definate                        2
definite                        2
delhi                           2
delivery                        3
describ                         3
describe                        2
description                     2
device                          5
diap                            2
different                       5
digg                            2
digital                         2
direct                          2
dog                             3
dont                            2
download                        3
drive                           4
drum                            4
durable                         2
dvd                             4
easi                            4
easy                            31
eat                             2
effective                       2
elegant                         2
else                            3
energy                          2
enjoy                           6
enough                          4
equipment                       2
especial                        2
ev                              6
every                           2
everything                      6
everywhere                      3
exact                           2
excellent                       13
except                          2
exercise                        6
expect                          6
extra                           4
extreme                         2
face                            2
fantastic                       2
far                             8
fast                            7
favorite                        2
feature                         6
feel                            3
fell                            2
figur                           2
file                            3
fill                            2
find                            3
fine                            5
fit                             4
fitness                         2
flash                           2
flavor                          3
floor                           3
food                            2
forev                           3
forget                          2
form                            2
found                           4
free                            4
friend                          8
full                            2
fun                             2
gadget                          2
gb                              10
gen                             4
general                         2
gift                            7
girl                            2
glad                            5
go                              3
good                            42
great                           59
guess                           2
guitar                          2
gym                             4
hand                            3
handl                           2
handle                          4
handy                           4
happen                          2
happy                           10
hard                            4
hav                             4
have                            2
headphone                       4
healthy                         2
hear                            2
heard                           4
help                            2
here                            2
high                            3
hold                            7
home                            4
hooah                           3
hope                            3
horse                           3
hotel                           6
house                           2
huge                            2
hungry                          2
hurt                            2
husband                         3
id                              2
im                              5
includ                          2
inexpensive                     2
inside                          2
instruction                     3
instrument                      2
ipod                            22
item                            14
itself                          2
ive                             5
keep                            5
key                             2
kid                             2
kind                            2
know                            4
large                           4
last                            7
learn                           2
least                           2
less                            4
life                            6
light                           5
lightweight                     3
like                            25
line                            2
listen                          7
little                          12
location                        3
long                            7
look                            4
lose                            2
lot                             12
loud                            2
lov                             5
love                            31
low                             3
machine                         5
made                            4
make                            7
man                             2
many                            5
mat                             2
media                           2
memory                          4
met                             2
mic                             5
microphone                      4
might                           2
military                        2
million                         2
model                           2
mom                             2
money                           2
monitor                         2
month                           5
more                            16
move                            2
movie                           2
mp                              7
much                            14
music                           17
musical                         2
must                            3
nano                            8
ne                              5
need                            8
negative                        2
nev                             4
new                             5
nice                            14
nifty                           2
night                           2
no                              13
noise                           2
nokia                           3
not                             41
note                            2
oh                              2
ok                              2
old                             6
once                            4
one                             4
open                            3
opinion                         2
option                          4
order                           3
other                           2
over                            2
own                             6
p                               3
package                         7
pay                             2
pedomet                         3
pen                             2
people                          3
perfect                         9
perform                         2
performance                     3
phone                           6
photo                           3
pic                             2
pick                            2
picture                         8
piece                           2
pillow                          3
pink                            3
place                           2
play                            27
pleas                           5
plenty                          2
pocket                          2
pod                             2
portable                        5
present                         4
pretty                          3
price                           26
print                           2
probab                          2
problem                         6
produc                          2
product                         27
purchas                         8
purchase                        3
purse                           2
put                             2
quality                         15
quick                           4
quite                           3
radio                           7
rate                            2
read                            4
real                            12
reason                          2
receiv                          5
reciev                          5
recommend                       9
record                          4
reliable                        2
requir                          2
result                          3
review                          2
right                           7
rio                             3
rock                            2
roll                            2
room                            6
run                             8
safe                            3
same                            2
sansa                           2
satisfi                         3
say                             2
screen                          3
secure                          2
seem                            7
sent                            2
service                         13
set                             5
several                         2
shape                           6
shave                           2
shipp                           6
show                            7
simple                          3
since                           4
size                            17
sleek                           2
slight                          2
slim                            2
small                           17
snack                           2
snug                            2
soft                            2
software                        4
solid                           3
someone                         3
something                       8
son                             4
song                            9
soooo                           2
sound                           17
south                           2
space                           2
speak                           2
special                         3
spent                           2
staff                           2
stand                           4
star                            3
start                           5
stay                            4
stereo                          2
still                           5
stor                            2
storage                         5
store                           3
strap                           2
strong                          2
stuff                           2
sturdy                          2
such                            4
summ                            2
suppos                          2
sure                            4
system                          5
take                            3
talk                            2
tast                            3
taste                           3
tempo                           2
th                              12
thank                           4
theyre                          2
thin                            2
thing                           4
through                         5
tight                           2
time                            13
tiny                            4
ton                             2
too                             6
tool                            3
top                             2
total                           2
tough                           2
track                           2
transf                          4
travel                          4
tri                             2
try                             3
tun                             2
tv                              3
type                            3
unit                            3
until                           2
up                              2
upgrad                          2
us                              13
usb                             4
use                             3
useful                          3
utility                         2
value                           6
version                         2
very                            18
video                           7
walk                            2
want                            7
watch                           2
wear                            2
week                            2
weight                          4
while                           9
why                             2
wife                            3
window                          2
wish                            2
without                         6
wonderful                       6
work                            8
worth                           2
wrong                           3
xlr                             2
year                            3
yet                             2
you                             2
young                           2
youre                           2
yr                              2
zen                             5
