*               270
</stop>         270
absolute        2
actual          3
adapt           2
again           6
ago             4
all             2
almost          8
alone           2
along           2
already         3
although        2
alway           3
amazon          11
amount          2
anoth           8
anymore         2
anyone          4
anything        8
apart           2
apple           8
archo           2
around          3
arriv           4
arrive          2
ask             4
average         2
avoid           2
aware           2
away            7
back            4
backpack        2
bad             16
bar             2
basical         2
batterie        3
battery         16
be              3
before          6
begin           2
believe         3
bett            14
better          2
between         2
beware          2
big             2
bit             5
black           4
body            4
boston          2
both            4
bought          28
box             2
break           5
broke           9
broken          3
buck            2
bud             3
button          6
buy             46
ca              6
calendar        2
camera          3
canot           2
card            10
cash            2
caus            2
cd              2
chang           3
charg           3
charge          8
cheap           10
check           3
child           3
christma        4
clean           2
club            2
company         3
compatible      3
complete        4
complicat       2
comput          9
condition       2
conect          3
consider        3
contact         3
control         3
correct         2
couple          3
crash           4
crashe          3
creative        4
custom          4
cute            2
cuz             2
daught          2
day             8
dead            5
defective       4
definite        2
deliv           2
deliver         2
dent            3
deserve         2
design          3
device          11
di              11
didnt           2
different       2
difficult       3
disappoint      6
disc            2
display         4
doe             2
doesnt          6
dog             2
dont            8
down            4
download        8
drain           2
drink           4
drive           6
dvd             4
ear             3
easy            4
effect          2
effort          2
elliptical      2
else            2
email           3
end             2
energy          2
enough          5
entire          2
ev              13
eventual        2
every           9
everything      3
everywhere      2
exercise        3
expect          3
expensive       5
experience      3
fail            5
fall            3
far             4
fat             2
feature         3
feel            3
few             4
figure          3
file            4
final           2
find            3
fine            6
fit             3
five            2
flash           4
flashlight      2
fm              6
fool            2
force           3
forev           2
found           3
four            2
fragile         2
free            3
freeze          5
friend          3
froze           5
full            2
functionality   2
gb              9
gett            4
gift            4
go              7
good            15
gotten          2
great           8
guitar          5
half            3
hand            3
hang            2
happen          3
happy           5
hard            12
hate            2
head            2
headphone       6
heard           2
heavy           2
here            2
high            2
hold            5
horrible        4
hotel           7
hour            10
howev           3
hr              2
hype            2
idea            2
im              5
impossible      2
inaccurate      3
includ          2
inferior        4
install         2
instead         4
instruction     4
interface       2
invest          2
ipod            26
iriv            2
it              25
item            31
itself          2
ive             14
jump            3
junk            11
kazoo           2
kept            2
kid             4
know            9
l               2
large           2
last            9
lat             3
late            2
lcd             3
less            2
let             3
lexar           2
life            5
light           6
like            17
list            3
little          6
load            6
lock            2
long            3
look            2
loose           4
lost            3
lot             5
love            2
machine         3
made            8
make            6
manual          2
many            3
matt            4
max             2
may             3
maybe           4
mb              3
me              2
mean            2
measurement     2
media           2
memory          6
mess            2
microsoft       3
might           3
minute          7
miss            2
mode            2
model           5
money           20
monst           2
month           23
more            30
mouse           2
mp              22
much            9
multiple        4
music           12
nano            3
need            3
nev             15
new             9
next            3
nice            5
no              27
nor             4
not             179
notebook        2
nothing         7
o               2
octob           2
off             9
often           2
ok              2
old             5
once            5
one             4
onto            3
open            2
operate         2
ord             6
order           5
oregon          2
overall         2
own             2
page            3
paid            3
pair            2
palm            2
pap             2
pay             9
pedomet         2
pedometer       2
people          3
perhap          2
philip          2
phone           2
photo           2
pick            4
piece           6
place           5
play            44
player          4
poor            4
portable        2
pound           3
pow             2
present         2
pretty          5
previou         2
pric            2
price           11
problem         13
product         48
promis          4
prone           2
proprietary     2
provide         2
purchas         8
purchase        2
put             2
quality         14
quick           2
quite           4
radio           5
random          2
range           2
rate            2
rca             2
read            3
real            9
reason          3
reasonable      2
receipt         2
receiv          8
recogniz        2
recomend        2
recommend       10
record          3
refund          6
reliable        2
rememb          2
repair          2
replac          3
requir          2
reset           3
respond         5
restart         2
return          20
review          5
right           3
room            2
rope            2
run             2
same            8
samsung         2
sandisk         6
scratch         3
scratche        3
screen          10
screw           5
sd              2
second          5
seem            6
sell            4
send            6
sent            5
service         8
set             4
several         5
shipp           8
shock           3
short           6
shuffle         2
sign            2
since           4
slow            2
small           6
so              2
software        8
sold            3
someone         3
something       2
sometime        2
son             3
song            12
sony            5
sound           5
spec            3
spend           5
spent           4
spin            2
st              2
star            3
start           7
stat            2
stay            12
stiff           2
still           10
stinky          2
stop            5
stopp           6
store           2
string          3
stupid          2
sturdy          2
such            4
suck            5
sudden          2
suggest         3
support         4
sure            2
switch          2
system          2
tak             2
take            9
talk            2
tell            3
terrible        5
textbook        2
th              19
thank           3
that            3
them            2
there           3
therefore       2
tho             2
though          3
three           8
thru            2
tighten         4
time            31
tip             2
today           3
toilet          3
too             16
took            3
toothbrush      2
total           2
touch           2
tourist         2
toy             3
transf          2
transfer        2
trash           2
tri             8
try             4
tun             3
turn            10
unable          2
und             2
unfortunate     2
unit            5
until           8
upgrade         2
upload          2
upset           2
us              14
usb             8
use             3
useless         4
vendor          2
version         2
very            37
video           4
wasnt           2
waste           14
web             2
website         2
week            15
weight          3
while           5
whole           3
why             4
window          5
wipe            2
wish            4
within          7
wo              9
work            21
worse           3
worst           8
worth           10
worthless       2
wrong           2
xp              5
yahoo           3
ye              2
year            9
you             4
youre           2
zen             3
