</stop>                         540
aaa                             2
able                            4
absolut                         2
accurate                        3
actual                          3
adapt                           6
add                             3
addition                        2
address                         2
adult                           2
advertis                        3
affordable                      3
afraid                          2
again                           4
ago                             5
agree                           2
airport                         2
album                           4
allow                           2
almost                          11
alone                           2
along                           3
alot                            2
already                         4
although                        3
alway                           6
amaz                            9
amazo                           2
amazon                          9
amazone                         2
amount                          3
amp                             2
anoth                           11
answ                            2
anymore                         2
anyone                          10
anything                        9
anywhere                        3
apart                           2
apple                           6
archo                           2
around                          6
arriv                           6
arrive                          2
ask                             3
attention                       2
audio                           2
available                       2
average                         2
avoid                           3
aware                           2
away                            6
awesome                         2
awsome                          2
baby                            3
backpack                        3
bad                             15
ball                            2
band                            5
bar                             8
basi                            2
basical                         2
bass                            2
batterie                        6
battery                         12
be                              5
beautiful                       2
become                          2
before                          12
begin                           2
believe                         2
bell                            2
best                            13
bett                            23
between                         2
beware                          2
big                             6
bike                            6
biofeedback                     2
birthday                        2
bit                             3
black                           4
body                            3
book                            2
boost                           2
bose                            2
boston                          2
both                            11
bought                          39
box                             3
brand                           4
break                           5
broke                           10
broken                          4
brought                         2
buck                            2
bud                             3
built                           2
burn                            2
business                        3
button                          7
buy                             41
bye                             2
cable                           4
calendar                        2
camera                          9
canot                           2
car                             3
card                            12
care                            2
carry                           7
case                            4
cash                            3
caus                            2
cd                              6
cent                            2
certain                         3
chang                           4
charg                           3
charge                          9
cheap                           12
check                           4
child                           3
children                        2
christma                        8
city                            2
class                           3
clean                           9
clear                           6
clip                            5
close                           2
club                            2
college                         2
color                           2
combination                     2
comfortable                     4
common                          3
compact                         7
company                         4
compatible                      3
complaint                       4
complete                        6
complicat                       2
comput                          11
condition                       6
conect                          3
conector                        2
consider                        3
constant                        2
contact                         3
control                         6
convenient                      3
cool                            7
copy                            2
cord                            4
correct                         2
cost                            6
count                           2
couple                          4
cov                             2
cover                           2
crash                           5
crashe                          3
creative                        5
cute                            4
cuz                             2
cymbal                          3
dad                             4
dai                             2
damag                           2
damage                          3
data                            2
daught                          9
daughter                        2
day                             10
dead                            5
deal                            6
defective                       4
definate                        3
definite                        2
delhi                           2
deliv                           2
deliver                         3
delivery                        3
dent                            3
describ                         4
describe                        2
description                     2
deserve                         2
design                          4
develop                         2
device                          11
di                              7
diap                            2
didnt                           2
die                             2
different                       7
difficult                       3
digg                            2
digital                         2
direct                          2
direction                       2
dirty                           2
disappoint                      6
disc                            2
disk                            2
display                         5
do                              2
doesnt                          6
dog                             5
dollar                          2
dont                            3
down                            3
download                        9
drain                           3
drink                           5
driv                            2
drive                           11
dropp                           2
drum                            4
dur                             2
durable                         3
dvd                             8
easi                            4
easy                            36
eat                             3
effect                          3
effective                       2
effort                          2
elegant                         2
elliptical                      2
else                            6
email                           4
end                             2
energy                          3
enjoy                           8
enough                          8
entire                          2
equipment                       2
especial                        2
etc                             2
ev                              19
eventual                        2
everthing                       2
every                           9
everything                      10
everywhere                      5
exact                           2
excellent                       8
except                          2
exercis                         2
exercise                        6
expect                          9
expensive                       6
experienc                       2
experience                      4
extra                           5
extreme                         2
face                            2
fail                            6
fami                            2
fantastic                       4
far                             10
fast                            8
fat                             3
fault                           2
favorite                        4
feature                         11
feedback                        2
feel                            5
few                             5
figur                           2
figure                          4
file                            7
fill                            2
final                           2
find                            5
fine                            10
fit                             7
fitness                         2
five                            2
flash                           2
flashlight                      2
flat                            2
flavor                          4
flaw                            2
floor                           4
food                            2
fool                            2
force                           3
forev                           5
forget                          2
form                            3
format                          2
found                           6
four                            2
fragile                         2
free                            6
freeze                          3
friend                          11
froze                           5
full                            4
fun                             2
functionality                   2
fundamental                     2
gadget                          2
game                            3
gb                              15
gen                             4
general                         3
gett                            5
gift                            11
girl                            2
glad                            4
go                              11
good                            49
gotten                          3
great                           60
green                           2
guess                           3
guest                           2
guitar                          7
guy                             2
gym                             3
half                            4
hand                            6
handl                           2
handle                          4
handy                           5
hang                            2
happen                          4
happy                           13
hard                            12
hardware                        2
hate                            2
hav                             3
have                            2
headphone                       10
healthy                         2
hear                            3
heard                           6
heavy                           3
help                            4
helpful                         2
here                            5
high                            5
hold                            11
home                            3
hooah                           3
hope                            2
horrible                        4
horse                           3
hotel                           11
hour                            11
house                           2
howev                           4
hr                              2
huge                            2
hungry                          2
hurt                            2
husband                         4
hype                            2
id                              3
idea                            2
ill                             2
im                              7
impossible                      2
inaccurate                      3
includ                          4
inexpensive                     2
inferior                        4
info                            2
information                     2
inside                          3
install                         3
instead                         4
instruction                     5
instrument                      2
interface                       2
internet                        2
invest                          2
ipod                            37
iriv                            2
isnt                            2
issue                           2
item                            34
itself                          4
ive                             16
junk                            6
kazoo                           2
keep                            8
kept                            2
key                             2
kid                             5
kind                            3
know                            13
l                               2
lack                            2
lady                            2
laptop                          2
large                           6
last                            13
lat                             4
late                            3
lcd                             3
learn                           3
least                           2
less                            5
let                             3
level                           2
lexar                           2
life                            9
light                           8
lightweight                     3
like                            34
line                            3
list                            3
listen                          8
little                          16
load                            3
location                        4
lock                            3
long                            9
look                            7
loose                           4
lose                            2
lost                            3
lot                             19
loud                            2
lov                             6
love                            35
low                             3
m                               2
machine                         6
made                            13
major                           2
mak                             2
make                            12
man                             2
manual                          3
manufactur                      2
many                            7
market                          2
mat                             2
matt                            5
max                             2
may                             3
maybe                           4
mb                              4
mean                            2
measurement                     2
media                           4
meditation                      2
memory                          8
mention                         2
menu                            2
mess                            2
met                             2
mic                             4
microphone                      6
microsoft                       3
might                           5
military                        2
million                         2
minute                          8
miss                            2
mode                            2
model                           7
mom                             2
money                           17
monitor                         5
monst                           2
month                           20
more                            38
mouse                           2
move                            2
movie                           2
mp                              11
much                            16
multiple                        2
music                           26
musical                         2
must                            3
myself                          2
nano                            9
navigation                      2
ne                              7
near                            2
neck                            2
need                            10
negative                        3
nev                             14
new                             10
next                            4
nice                            19
nifty                           2
night                           2
no                              31
noise                           2
nokia                           3
nor                             4
not                             125
note                            2
notebook                        2
nothing                         8
notice                          2
o                               2
octob                           2
off                             8
offer                           2
often                           2
oh                              2
ok                              4
old                             12
omron                           2
once                            7
one                             4
onto                            4
open                            4
operate                         3
opinion                         2
option                          6
ord                             7
order                           6
other                           3
otherwise                       2
over                            3
overall                         3
overpric                        2
own                             8
p                               4
package                         8
page                            4
paid                            3
pain                            2
pair                            2
palm                            2
pap                             3
pay                             9
pedomet                         4
pedometer                       2
pen                             2
people                          6
perfect                         10
perform                         3
performance                     2
perhap                          2
personal                        2
philip                          2
phone                           8
photo                           4
pic                             3
pick                            6
picture                         8
piece                           5
pillow                          3
pink                            3
place                           8
plastic                         2
play                            55
player                          2
pleas                           4
please                          2
plenty                          2
plu                             2
pocket                          2
pod                             2
point                           2
pool                            2
poor                            4
pop                             2
port                            2
portable                        7
pound                           3
pow                             2
present                         5
pretty                          8
previou                         2
pric                            3
price                           29
print                           3
probab                          2
problem                         17
produc                          2
product                         65
promis                          5
prone                           2
proper                          3
proprietary                     2
provide                         2
purchas                         15
purchase                        4
purse                           2
put                             5
quality                         24
quick                           5
quite                           6
radio                           10
random                          2
range                           2
rate                            4
rath                            2
read                            7
real                            21
reason                          5
reasonable                      2
receipt                         2
receiv                          11
recharge                        2
reciev                          6
recogniz                        2
recommend                       11
record                          7
refuse                          2
relative                        2
reliable                        4
rememb                          2
repair                          3
replace                         2
requir                          4
reset                           3
respond                         5
response                        2
rest                            2
restart                         2
result                          4
return                          13
review                          8
right                           10
rio                             2
rock                            2
roll                            2
room                            6
rope                            2
run                             9
safe                            3
same                            7
samsung                         3
sandisk                         7
sansa                           3
satisfi                         2
sav                             2
save                            2
say                             3
scratch                         3
scratche                        3
screen                          13
screw                           5
sd                              3
second                          3
secure                          2
seem                            13
select                          2
sell                            5
seller                          2
send                            6
sense                           2
sent                            6
service                         18
set                             9
sett                            2
several                         5
shape                           6
shave                           2
shipp                           12
shock                           3
short                           6
show                            7
shuffle                         2
shutt                           2
sign                            2
simp                            2
simple                          3
since                           8
site                            2
size                            16
slight                          2
slim                            2
slow                            2
small                           22
snack                           3
snug                            2
soft                            2
software                        10
sold                            3
solid                           4
someone                         5
something                       8
sometime                        3
son                             8
song                            20
sony                            6
soon                            2
soooo                           2
sound                           18
south                           2
space                           5
speak                           2
spec                            3
special                         3
spend                           4
spent                           5
spin                            3
sport                           2
st                              2
staff                           3
stand                           4
star                            6
start                           13
stat                            2
stay                            11
stereo                          2
stick                           2
stiff                           3
still                           10
stinky                          2
stop                            3
stopp                           3
stor                            2
storage                         5
store                           8
strap                           2
strong                          2
stuff                           3
stupid                          2
sturdy                          3
such                            8
suck                            5
sudden                          2
sugar                           2
suggest                         2
summ                            2
support                         4
suppos                          2
suprising                       2
sure                            5
switch                          2
system                          5
tak                             2
take                            12
talk                            4
tape                            2
target                          2
tast                            3
taste                           5
tell                            3
tempo                           2
terrible                        5
textbook                        2
th                              23
thank                           4
that                            3
there                           3
therefore                       2
theyre                          3
thin                            3
thing                           5
third                           2
tho                             2
though                          5
three                           9
through                         5
thru                            2
thumb                           2
tight                           3
tighten                         4
time                            37
tiny                            5
tip                             2
title                           2
tivo                            2
today                           4
ton                             3
too                             12
took                            2
tool                            3
toothbrush                      3
top                             3
toss                            2
total                           3
touch                           2
tough                           2
tourist                         2
toy                             3
track                           3
transf                          3
transfer                        2
trash                           2
travel                          4
tri                             9
try                             7
tun                             6
turn                            8
tv                              4
twice                           2
type                            3
unable                          2
und                             2
unfortunate                     2
unit                            7
unless                          2
until                           9
update                          2
upgrad                          2
upgrade                         3
upload                          2
upset                           2
us                              25
usb                             10
use                             4
useful                          3
useless                         4
utility                         2
value                           7
vendor                          2
version                         4
very                            39
video                           11
vista                           2
volume                          2
wait                            2
walk                            3
walmart                         2
want                            8
wasnt                           2
waste                           3
wear                            3
web                             2
website                         3
week                            15
weight                          7
what                            2
whatsoev                        2
where                           2
while                           14
whole                           4
why                             6
wife                            4
window                          5
wipe                            2
wish                            6
within                          2
without                         4
wonderful                       5
word                            2
work                            16
world                           2
worse                           3
worst                           4
worth                           13
worthless                       2
wrong                           6
xlr                             2
xp                              5
ye                              3
year                            10
yet                             3
you                             5
young                           3
youre                           4
yr                              3
zen                             8
zune                            2
